{
  "VerseByVerse": {
    "articles": [{
      "category": "",
      "topics": [],
      "ID": "1737",
      "postedDate": "1451699280",
      "title": "My New Year’s Resolution: I want to be poor",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_19.jpeg",
      "authorThumbnailAltText": "Ivette Irizarry",
      "averageRating": "",
      "authorName": "Ivette Irizarry",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "This is the time of year when many will cinch the laces on their new running shoes, finally put away the laundry that&rsquo;s been hiding the treadmill, and strap on their new fitbit. Many will start their new diet, or the more PC &mdash;but equally hard to keep&mdash; new relationship with food. Or maybe Monday. They&rsquo;ll start on Monday. All diets start on Monday. On Monday for sure.\r\n\r\nA new year gives us a fresh start and no matter how cynical we are we can&rsquo;t help but be infected by that renewed sense of purpose and hope that comes with having to get used to writing a different number on those darn checks. Many of us have spent time no matter how informally taking inventory of all the blessings and accomplishments of the past year, as well as the things we would have liked to do better or ways we could be better.&nbsp;\r\n\r\nPrayers and well-wishes&nbsp;given and received&nbsp;for the new year often revolve around health and prosperity. We want the new year to bring us blessings and abundance. I&rsquo;ve done this too, but this year I turned to the 5th chapter of Matthew searching for blessings, so my resolution is to be poor.\r\n\r\nI want to be poor in spirit, so I can inherit the kingdom of heaven. I want to be more aware of how poor and lacking the spirit I inherited from Adam is. I want to remember every day, that my spirit is wanting, and that it can only be perfected by the Spirit of God. I want to be aware of the poverty of my heart and that my only riches lie with my faith in Christ.\r\n\r\nThis year I want to mourn, so that I may receive comfort. Oh, there is so much to mourn, and maybe that is why I find myself numb to all of the things that should break my heart the way I know they break God&rsquo;s heart. I want to mourn the lostness of my unbeliever friends and unbelieving family members. I want to mourn the times I fail to yield to the Holy Spirit and compromise my witness. But I also want to mourn the godlessness and depravity that is overtaking our world, even as I know that it is a sign of the end of the age. I want to mourn our disregard for human life, the perversion of God&rsquo;s word that hypnotizes so many who sit in &ldquo;churches&rdquo;. I have to remember that man&rsquo;s depravity breaks God&rsquo;s heart. As I am comforted in the knowledge that the end of this age leads to life in glory with the Lord, I want to mourn the knowledge that people who don&rsquo;t know the Lord are terrified by the chaos. A broken heart would compel me to share the gospel.\r\n\r\nI want to be meek, that I may inherit the earth. This is so hard. We are brought up to be first, to be best. But I want to learn how to be meek. Meekness is so much more than false modesty, or even honest humility. The meekness we need is the humility that would lead the creator of the universe to leave His throne in heaven to come suffer like us, and for us. The humility of the one who stooped down to wash the feet of his disciples while they argued with one another over which of them was better than the other. The meekness that would lead Jesus to let Himself be flogged and crucified even while He had the power and the right to destroy the earth in judgment to avoid the pain. The rightful Heir of literally everything was meekest of all. Yet I find myself wanting to have my way so much of the time. I have to learn to leave my high horse to empathize with others. I have to learn to do dirty work that shows love, even if the people I am serving are oblivious to my gesture. I need to make myself last for the sake of others and suffer pain and indignation for the sake of testifying to the Kingdom. I have to trust that there is a sovereign Witness to my meekness who is keeping an eternal record, and who can see my heart.\r\n\r\nI want to be hungry and thirsty. I want to hunger and thirst for righteousness, so that I may be filled. And while this is very explicitly a figurative hunger and thirst, I can&rsquo;t help but think that we are no longer capable of these feelings. In our culture of excess and over-abundance, when was the last time any of us was truly hungry, or thirsty? Food and drink are ever at hand, keeping us in a state of blissful satiety at best, and at worst enabling some of us to obesity or drunkenness. If we never feel physical hunger and thirst, how can we hunger and thirst for righteousness? Jesus doesn&rsquo;t say should &ldquo;desire&rdquo; righteousness. Desiring something sort of sounds like you&rsquo;re okay, but it would be really nice to have &ldquo;x&rdquo;. Hunger and thirst means your whole being is consumed with the need (not the desire) for righteousness. It means your being needs righteousness the way your body needs food and water to survive. So this year I want to feel physical hunger and thirst, that I may know how to hunger and thirst for righteousness. And I want to hunger and thirst for righteousness that I may understand that only the righteousness of Christ can satisfy me.\r\n\r\nI want to be merciful, so that I may be shown mercy. Oh, I really need help here. I am so quick to flick the speck off my brother&rsquo;s eye, as I struggle to blink over the plank in my own eye. Do I not understand the mercy and forbearance the Lord has to show me, even as I write this? I pray that I will be better at showing mercy, so I can understand and appreciate better the depth of grace in the fact that God delayed His judgment of my sin so that I could come to faith in His Son and be called His child.\r\n\r\nI want to be pure in heart, so that I may see God. See God? We serve a God we cannot see. As a believer I have assurance I will eventually see God when I get to heaven. But how can a pure heart allow me to see God? If I purify my heart and purge it of its selfish desires I can give way for God to reveal Himself. If my heart is pure, then my prayers will fall in line with God&rsquo;s will. If my heart is pure I can see God expressed in creation. I can see God in my daily provision. I can see God in His statutes. With a pure heart I can begin to trust God&rsquo;s vision. He can see everything so much more clearly. &ldquo;Truly, God does not see what man sees, for man looks at the outward appearance, but the LORD sees the heart.&rdquo; (1 Sam. 16:7) God sees my heart, no matter how polished I try to appear on the outside.\r\n\r\nI want to be a peacemaker, so I can be called a child of God. I am thankful that my personality is naturally averse to conflict. But the lack of conflict is not synonymous with peace. Sometimes confrontation is what is needed to settle matters. I tend to be more confrontational in my comfort zone. It&rsquo;s so easy to pick petty fights with my children and my husband. I&rsquo;ve noticed that sometimes even if I don&rsquo;t pick a fight with others overtly, I can carry and nice grudge against them in my head. I can do this for a long time. All of that behavior is unworthy of a child of God. I must learn to be a peacemaker, so I can bear His name.\r\n\r\nI want to be persecuted, so that the Kingdom of heaven will be mine. I want to suffer insult and slander for the sake of Christ, so that I may receive my reward in heaven. We are living a time of growing hostility toward the Christian faith. Jesus promises reward in heaven for every time we suffer for His sake. As one who feels a tug to go to battle to defend the honor of his country I find myself wanting my faith to be tested, to face the challenge of choosing between faith or lose a friendship, faith or risk my reputation, faith or lose my job, faith or lose my life? Am I ready? How would I fare? Would I stand fast, or am I reflecting the spirit of Peter before the crucifixion? How do I perform daily when the stakes are not so high? Do I give God the glory in the little things? Do I take a stand for God when it won&rsquo;t really cost me much. I pray to God for the strength to stand up for His word and His statutes daily.\r\n\r\nSo this year I want to be less. I want to be a LOT less. I want to be less so He can be more in me. I want to have less, so I can realize how rich I am in having Him. I want to do less, so that I can let Him be the one doing in, for and through me.&nbsp;\r\n\r\nMatthew 5: 1-12\r\n\r\nNow when Jesus saw the crowds, he went up on a mountainside and sat down. His disciples came to him, 2&nbsp;and he began to teach them.\r\n\r\nHe said:\r\n\r\n&ldquo;Blessed are the poor in spirit,\r\n\r\n&nbsp;&nbsp;&nbsp;&nbsp;for theirs is the kingdom of heaven.\r\n\r\nBlessed are those who mourn,\r\n\r\n&nbsp;&nbsp;&nbsp;&nbsp;for they will be comforted.\r\n\r\nBlessed are the meek,\r\n\r\n&nbsp;&nbsp;&nbsp;&nbsp;for they will inherit the earth.\r\n\r\nBlessed are those who hunger and thirst for righteousness,\r\n\r\n&nbsp;&nbsp;&nbsp;&nbsp;for they will be filled.\r\n\r\nBlessed are the merciful,\r\n\r\n&nbsp;&nbsp;&nbsp;&nbsp;for they will be shown mercy.\r\n\r\nBlessed are the pure in heart,\r\n\r\n&nbsp;&nbsp;&nbsp;&nbsp;for they will see God.\r\n\r\nBlessed are the peacemakers,\r\n\r\n&nbsp;&nbsp;&nbsp;&nbsp;for they will be called children of God.\r\n\r\nBlessed are those who are persecuted because of righteousness,\r\n\r\n&nbsp;&nbsp;&nbsp;&nbsp;for theirs is the kingdom of heaven.\r\n\r\n&nbsp;&ldquo;Blessed are you when people insult you, persecute you and falsely say all kinds of evil against you because of me. 12&nbsp;Rejoice and be glad, because great is your reward in heaven, for in the same way they persecuted the prophets who were before you."
    }, {
      "category": "",
      "topics": [

      ],
      "ID": "1731",
      "postedDate": "1450663680",
      "title": "Four Octaves",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
      "authorThumbnailAltText": "Melissa Church",
      "averageRating": "",
      "authorName": "Melissa Church",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "~~Since I&rsquo;m church home-less (again) I welcomed an invitation to attend the Christmas candlelight service at the sweet little storefront church that hosts our Bible study group. We sang most of my favorite traditional Christmas hymns. Since it&rsquo;s a small church, there is no big production-value show for television broadcast. It&rsquo;s just a few simple (gifted) Christians leading a few more simple (less-than-gifted) Christians in worship through song.&nbsp;\r\n\r\nI am always moved by the sound of corporate worship. Sometimes I just close my eyes and whisper, &ldquo;Be pleased with your people Lord Jesus,&rdquo; as I listen to the sound of the saints lifting their voices together to the throne. Tonight was no different. &ldquo;Silent Night&rdquo; did me in. The thing that was different tonight was the sound of struggle.\r\n\r\nHave you ever noticed that every traditional Christmas song is written in a key that no one can sing, and spans four octaves? It&rsquo;s as if every common pew-sitting Christian from the 1800s was a classically trained operatic singer. One thing a small church illuminates quickly is the general lack of talent in the pew. If we could sing a four-octave range, we&rsquo;d likely be up front, but we can&rsquo;t, so we usually rely on a really loud sound system and great production to make us &ldquo;blend&rdquo; into one acceptable voice. In a small church, there is no hiding, there is no blending, there is no &ldquo;one voice&rdquo;. And it was really beautiful, the sound of the struggle. As I whispered through tears, &ldquo;Be pleased with your people Lord Jesus,&rdquo; I thought about how our struggle to sing all the right notes exemplified our common struggle through the year to live a life worthy of our calling. We are flawed human beings. Ordinary people, trying to do the extraordinary. Trying to reach beyond our abilities in an effort to please our most worthy king, but failing more often than succeeding. Hearing the note, but unable to reach it. &ldquo;Be pleased with your people Lord Jesus.&rdquo; I think He is.\r\n\r\nI think He is as pleased with our earnest daily efforts to live a life that honors Him as He is with our earnest effort to go from the basement to the roof while singing &ldquo;O Come O Come Emmanuel&rdquo;. It&rsquo;s the heart that matters. And the audience.\r\n\r\nWe are trying Lord. Oh, how your people are trying to get it right in this four-octave world as one-octave singers. It&rsquo;s a stretch every day but every day we try again, and we trust your grace to cover us in our inadequacies. We lift our hearts, we lift our voices, we lift our efforts, we lift our failures and shortcomings to you with praise, in worship. Be pleased with your people Lord Jesus. We&rsquo;re trying.\r\n\r\n&ldquo;Oh Come, oh come Emmanuel, and ransom captive Israel who mourns in lonely exile here until the Son of God appear. Rejoice! Rejoice! Emmanuel shall come to thee oh Israel.&rdquo; Sing it or croak it, but praise the One who was born for this purpose. He is your ransom. He is your song. He is your audience. He is your Emmanuel. Merry Christmas!!"
    }, {
      "category": "",
      "topics": [{
        "ID": "Church",
        "topic": "Church"
      }],
      "ID": "975",
      "postedDate": "1446423120",
      "title": "Finding the &#8220;Perfect&#8221; Church",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_2.jpg",
      "authorThumbnailAltText": "Stephen Armstrong",
      "averageRating": "",
      "authorName": "Stephen Armstrong",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "There&#39;s an old joke that says if you&#39;re looking for the perfect church and you find it, don&#39;t join it - or else you&#39;ll ruin it!\r\n\r\nThe point of the joke is easy to see. A perfect church simply doesn&#39;t exist. Every church consists of people, and it&#39;s all those people that cause the problems. Church people are often stubborn, selfish, egotistical, self-centered and ignorant - and those are just the elders!\r\n\r\nGod has chosen to build His Church with living stones of sinful people, but He is working by His Spirit to fashion each of us into His image. The Lord commands us to submit to one another in a community of believers for that purpose, so we can be trained in righteousness. This is a messy, imprecise process requiring faith, patience and humility &ndash; along with a willingness to accept others despite their weaknesses.\r\n\r\nSooner or later, circumstances may lead us to seek a new place to fellowship, and when that time comes, we&#39;re faced with many decisions. How do we decide which church is best? What do we look for? Where do we start?&nbsp;When finding your next church home, we might be tempted to draft a long list of must-have requirements, but in reality you need only three criteria to find the \"perfect\" church:\r\n\r\n1. Does the church believe and preach the true New Testament Gospel?&nbsp; Not the prosperity gospel. Not trances and dances. Not a political speech. Not a rock concert combined with a motivational pep talk. The Gospel of Jesus Christ. And not only should the church embrace the Gospel in their statement of faith and creeds, but the Gospel should be evident in their approach to ministry. Most importantly, the Gospel should be written plainly and visibly on their hearts. If asked, can the church explain the Gospel to you easily and clearly? Not just the pastor and elders. The&nbsp;congregation. When you find a church where the folks in the pews can explain the Gospel properly, you&#39;ve found a church with the right foundation (1Cor 3:11).\r\n\r\n2. When the pastor enters the pulpit, does the congregation flip open their Bibles in anticipation of the sermon?&nbsp; A church body that expects the Bible to be taught in the Sunday sermon is a church familiar with training in righteous from the meat of God&#39;s word. This practice should be the norm in our churches, but sadly it is the exception. So when you look around the congregation, are people even carrying Bibles? Did the pastor&#39;s sermon teach the word of God with respect and reverence and a high view of Scripture? Did he attempt to divide the word of God rightly or merely toss out a verse here and there as window dressing for his three-point lecture? How a church approaches the word of God during the Sunday service will tell you all you need to know about their attitude toward the Bible and their devotion to the Lord. As Christ Himself said, \"If you love Me, feed My sheep.\" (John 21:15-17)\r\n\r\n3. Does the church raise up servants and leaders - including pastors - from within the congregation?&nbsp;Here&#39;s one we don&#39;t think about very often, but it&#39;s a key measure for the health of a body. Are new church&#39;s leaders identified and discipled inside the congregation or are they sought through resumes and search committees? When a service need is identified, does the church hire outside professional help or seek qualified church members? Who performs the worship music and sweeps the floors and cleans the bathrooms and mows the lawn: strangers responding to a want ad (who may be unbelievers) or church members trained and encouraged to fill the need? Does the church recognize that service within the body is a means to personal sanctification or does the church outsource their sanctification? Finally, does the church make a distinction between church staff and church members? The answers to these questions reveal whether the church is fulfilling its Biblical mission to equip the saints for the work of ministry (Eph 4:11-13).&nbsp;\r\n\r\nDid your church pass all three tests? If not, here&#39;s how to respond:\r\n\r\n1. If your church fails Question #1, you should leave immediately. No apologies or explanations required. You need a church that believes and lives the Gospel.\r\n\r\n2. If your church fails Question #2, you should visit a few Bible-teaching churches in your area to discover what you&#39;ve been missing. When you find one that passes these tests, strongly consider joining it. Every Christian should receive consistent, sound Bible teaching.\r\n\r\n3. If your church fails Question #3, you may not need to leave, but if you stay your opportunities to serve in your gifting and grow spiritually may be stunted by your church&#39;s practice of drawing an artificial and unbiblical distinction between \"staff\" and \"members\" (or between \"clergy\" and \"laity\"), which is the Nicolatian heresy Jesus condemns in Revelation.\r\n\r\nKeep looking for that perfect church, but when you find it...well, you know the rest."
    }, {
      "category": "",
      "topics": [

      ],
      "ID": "1687",
      "postedDate": "1443808740",
      "title": "Keep a Short Leash",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
      "authorThumbnailAltText": "Melissa Church",
      "averageRating": "",
      "authorName": "Melissa Church",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "~~I came home from my walk this morning and my husband was watching &ldquo;The Dog Whisperer&rdquo;. We don&rsquo;t have dogs, but we love them anyway, in theory and at a distance. It&rsquo;s funny how neurotic they can be. This morning Caesar was &ldquo;whispering&rdquo; to an Australian Shepherd that was afraid of the new baby gate. I mean this dog was terrified of that gate. I missed the beginning so I don&rsquo;t know if there was a precipitating event or if this was an entirely irrational thing. Well, let&rsquo;s face it, event or not, for a herding dog to be terrified of a stationary baby gate is a bit irrational, but who am I to talk. Anyway&hellip; Caesar&rsquo;s solution was to make the dog face its fear. So, you know right where I&rsquo;m going don&rsquo;t you? Uh huh. &lsquo;Cause it was just that good. My husband was like, &ldquo;Are you crying because of the dog?!&rdquo; Uh&hellip;no.\r\n\r\nHere&rsquo;s how it went. Caesar would take the dog&rsquo;s leash very firmly in hand, walk the quaking dog right up to that gate, and make it stand there until it relaxed. At first, the poor thing cowered behind Caesar&rsquo;s legs. Then it would peek around his legs but only out of the corner of its eye. Then Caesar would rein in the tension on the leash until the dog was right beside him facing that evil gate square on, legs quivering, pulling at the leash to turn around and run. And it stood there until it could stand there without shaking, cowering, or straining at the leash - until it could look at that gate without flinching. That was step one.\r\n\r\nThe second part of the exercise was where I started feeling a little something in my stomach. Like this was familiar somehow and profound &ndash; like I really needed toy pay attention. Once the dog relaxed enough to face the gate, Caesar would turn the dog around with extreme tension on the leash and make it walk away. It could not run. It could not look back to see if the gate was coming after it &ndash; and that poor dog tried! It strained so hard to see behind it that only the whites of its eyes were showing! That dog was as afraid of the gate being at its heels as it had been approaching the gate straight on. Once the dog was able to successfully complete both steps, they did it again. And again. And again.\r\n\r\nFace the fear.\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Turn and walk away.\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Not like hell is on your heels.\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Like the One who&rsquo;s walking next to you has\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; GOT\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; THIS\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; THING!&nbsp;\r\n\r\nThe gate was never the enemy, the fear was. The gate was never what needed conquering, the fear did. The dog was still afraid of the gate, but it had learned to stand steady in spite of the fear. It did not learn to trust itself. It did not learn to trust the gate. It learned to stop resisting the leash that continued to lead it in and out of fear&rsquo;s presence. It learned to trust the one at the end of the leash who led it there and walked beside it to protect it.\r\n\r\nIf you&rsquo;ve read my last few posts then you know I&rsquo;ve been in a hard place &ndash; a place that has forced me to face (OK&hellip;run from!!) some fears. (Sorry I&rsquo;ve been so gloomy! It happens, you know?). It doesn&rsquo;t matter if those fears have a basis in the truth of experience. It doesn&rsquo;t matter even if they don&rsquo;t. What matters is that the Lord did not give me a Spirit of fear but of power and love and a sound mind. What matters is that He is the Lord my God who brought me out of my Egypt so I would no longer be a slave. He broke the bars of my yoke and made me walk with my head held high. What&rsquo;s important to know is that even though I walk in the midst of trouble &ndash; even in the valley of the shadow of death &ndash; He preserves my life. He stretches out His hand against the anger of my foes and with His right hand He saves me. What I need to know most urgently is that the Lord goes before me and will be with me and will not leave me &ndash; I need not be afraid or discouraged for He is my strength and my shield. He will keep me in perfect peace if my heart is steadfast in my trust for Him &hellip;The Rock Eternal.\r\n\r\nIn a couple of weeks, I&rsquo;m going into enemy territory where I will face some very real fears. There is the truth of experience there &ndash; experience that may repeat itself. God never promised that what we fear would not come to pass. He said that He is in control. Not I. Not my fear. He. Is. In. Control.\r\n\r\nThe enemy is shrewd and his weapons effective but even then, God redeems all. His purpose is to make us into the image of His son. That image was forged on the cross where even Jesus had to face his fear &ndash; fear that did not diminish in the experience, but could be endured because of Hope. I should expect no less for myself. I will not escape my fears. I will face them (because He keeps insisting on it!). I will learn to endure the terror and the outcome. Then I will turn and I will walk home with my Master. I will walk. I will not run. I will not cower. I will not quake. I will let my Master teach me to trust Him. I will let Him make me into a woman of power and love, with a sound mind.\r\n\r\nLord&hellip;it&rsquo;s a long walk! Keep a short leash!"
    }, {
      "category": "",
      "topics": [{
        "ID": "Faith",
        "topic": "Faith"
      }, {
        "ID": "Word+of+God",
        "topic": "Word of God"
      }, {
        "ID": "Prayer",
        "topic": "Prayer"
      }, {
        "ID": "Satan",
        "topic": "Satan"
      }],
      "ID": "1668",
      "postedDate": "1441481100",
      "title": "War Room",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_11.jpg",
      "authorThumbnailAltText": "Brady Stephenson",
      "averageRating": "",
      "authorName": "Brady Stephenson",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "This past weekend the movie \"War Room\" was released and I greatly enjoyed watching it with my bride. It was our first \"date night\" since our kids moved to college.\r\n\r\nThis is an inspiring and encouraging movie that does credit to the Kendrick brothers&#39; continuing legacy of family-friendly and faith-friendly films. I laughed, I cried, er, had some sinus trouble in the dusty theater.&nbsp; Two thumbs up!\r\n\r\nJust because a movie is \"faith-friendly\", however, doesn&#39;t always mean it is 100% Biblically accurate. Before recommending it to others, I share a few items of concern that I think are worth mentioning.\r\n\r\n&nbsp;\r\n\r\nIssue OneThere is an age old concept that every bad thing that happens in our lives is the result of the \"The Devil\" doing X, Y, or Z.\r\n\r\nGrandpa has lung cancer? That&#39;s the Devil at work! \r\n\r\nLittle Jenny has a cold? The Devil did it!\r\n\r\nUncle Bob is in jail for selling crack? The Devil made him do it!\r\n\r\nThis kind of flawed thinking attempts to absolve humanity of any responsibility for our actions.\r\n\r\nAs far as we know from Scripture, Satan is a finite creature limited to being in one place at one time. We also know that some bad things are the result of our own bad choices (like getting lung cancer as a result of smoking for 50 years). The main female character in the movie (Elizabeth Jordan) appears to embrace the idea that The Devil (i.e. Satan) is actively involved in messing with her life. Demons? Mayyyybe. Is there a spiritual component to her troubles? Absolutely... but \"The Devil\"? Unlikely.\r\n\r\n&nbsp;\r\n\r\nIssue TwoAfter reading James 4:7 [Submit therefore to God. Resist the devil and he will flee from you], Mrs Jordan decides she wants to have a conversation with Satan and give him a piece of her mind including a sassy repartee at the end (\"Oh,&nbsp;and another thing...\"). Throughout the period of history covered by the Bible (about 4,000 years), we only find 3 people speaking directly with Satan: G-d (see Genesis, Job, etc), Eve (look how that turned out!), and the angel Michael (Jude 9... Steve also speaks to this issue in his third lesson on the book of Jude). \"Resisting the devil\" means turning our eyes, hearts, and hope to G-d and ceasing from sin. It doesn&#39;t mean starting a dialog with the enemy of humanity!\r\n\r\nWhen our Lord and Savior, G-d in the flesh, had a brief discussion with Satan during His temptation in the wilderness (Matthew 4, Luke 4, and Mark 1:12-13) it was only to respond with words of Scripture.\r\n\r\nNo servant is greater than his Master (John 13:16)... surely we should do no more than our Messiah!\r\n\r\n&nbsp;\r\n\r\nIssue Three&nbsp;The third issue is a pet peeve of mine: context.\r\n\r\nThis movie is a call to a strong, active prayer life...I get it. And I can definitely see the appeal of closing the film by quoting 2 Chronicles 17 [\"If my people who are called by my name...\"] but why must people take that verse out of its context?\r\n\r\nLet&#39;s revisit that context for a second...\r\n\r\nAfter Solomon constructs the first Temple in Israel, G-d speaks to him:\r\n\r\nThen the Lord appeared to Solomon at night and said to him, \"I have heard your prayer and have chosen this place for Myself as a house of sacrifice. If I shut up the heavens so that there is no rain, or if I command the locust to devour the land, or if I send pestilence among My people, and My people who are called by My name humble themselves and pray and seek My face and turn from their wicked ways, then I will hear from heaven, will forgive their sin and will heal their land. Now My eyes will be open and My ears attentive to the prayer offered in this place. For now I have chosen and consecrated this house that My name may be there forever, and My eyes and My heart will be there perpetually. As for you, if you walk before Me as your father David walked, even to do according to all that I have commanded you, and will keep My statutes and My ordinances, then I will establish your royal throne as I covenanted with your father David, saying, &#39;You shall not lack a man to be ruler in Israel.&#39;\r\n\r\nBut if you turn away and forsake My statutes and My commandments which I have set before you, and go and serve other gods and worship them, then I will uproot you from My land which I have given you, and this house which I have consecrated for My name I will cast out of My sight and I will make it a proverb and a byword among all peoples. As for this house, which was exalted, everyone who passes by it will be astonished and say, &#39;Why has the Lord done thus to this land and to this house?&#39; And they will say, &#39;Because they forsook the Lord, the God of their fathers who brought them from the land of Egypt, and they adopted other gods and worshiped them and served them; therefore He has brought all this adversity on them.&#39;\"\r\n(2 Chronicles 7:12-22)\r\n\r\n&nbsp;\r\n\r\nG-d sets up some pretty simple \"If A then B\" logic here:\r\n\r\nIF G-d shuts up the heavens (or commands the locust to devour the Land or sends a pestilence among Israel) and\r\nIF the Israelites humble themselves and\r\nIF pray in the Temple (see v15) and\r\nIF they seek G-d&#39;s face\r\nTHEN He will hear from heaven, forgive their sin, and heal their land (i.e. the Land of Israel).\r\n\r\nThere is no asterisk in Scripture that says *oh, and by the way, if any OTHER nation wants to pray in some generic location, I&#39;ll heal their land too. Offer limited to 48 contiguous states and not valid in Uzbekistan (sorry, Uzbekistan!)\r\n\r\nThis flawed idea has its origins in replacement theology which has no place among believers.\r\n\r\nAside from these few issues this movie is a BAZILLION times better than 99.9% of what normally shows at the theaters!&nbsp;\r\n\r\nArmed with these words of caution, enjoy the movie!&nbsp;\r\n\r\n&nbsp;\r\n\r\nShabbat shalom!\r\n\r\n&lt;&gt;&lt;\r\n\r\n&nbsp;\r\n\r\nBrady on Google Plus"
    }, {
      "category": "",
      "topics": [

      ],
      "ID": "1666",
      "postedDate": "1440961320",
      "title": "A Reason to Call Home",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
      "authorThumbnailAltText": "Melissa Church",
      "averageRating": "",
      "authorName": "Melissa Church",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "~~So my son has been away at college for two weeks now.&nbsp;Fourteen days that seem like a year. I&rsquo;m past the point of the persistent twinge in my stomach like I ate something bad, and find myself now constantly patting my pockets and checking to be sure I&rsquo;m carrying my purse because it feels as if I&rsquo;m forgetting something vital. I&rsquo;m going to indulge in a bit of what a friend of mine would call melodrama, but it has a point, so try to endure. I miss my kiddo as if a part of myself wandered off and got lost. I long for a text&hellip;about anything at all&hellip;like the one asking for his license plate number when it&rsquo;s on the plate that&rsquo;s on his car, which is with him. That is the highlight of my day. We talked by phone last week and I was ecstatic to just hear his voice. You can tell so much from a voice. We had Facetime on Sunday and I could hardly concentrate on the conversation because I was examining his face for clues. Is he OK? Is he eating? Is he sleeping? Is he getting along with his roommate? Is he stressed? Is he sad? Is he clean? Is he coping? He will be home in 10 days. 10 days that seem like an eternity. I want to touch him. I want to examine him for breakage. I want to hear him moving about in his room, coming in and out the back door, blaring his screamo music while in the shower. I want to fix his favorite meal and take him shopping. I want him to sit at the bar and tell me funny stories, introduce me to all his new friends, complain about his art teacher, his math lessons, and laundry. I want to know all the things. All of them. I want to consume every single moment of his waking life while he&rsquo;s here (and maybe watch him breathe in his sleep), because it will be so brief. 31\/2 days that will seem like a nano-second.\r\n\r\nI have intentionally kept my schedule full and have given myself very little time to feel all the feels. It&rsquo;s just too dangerous to give in. I have kept it all at arm&rsquo;s length, examining it abstractly as if it&rsquo;s happening to someone else. But it creeps in. Like yesterday, on the way to the gas station, the still small voice that I have kept at bay suddenly said, &ldquo;This is how God loves you, Melissa.&rdquo; And I could barely breathe.\r\n\r\nMy first response was conviction. It was like having the wind knocked out of you. You know? That desperate sucking that you do trying to draw a straw-full of air into your lungs until your diaphragm relaxes again? Like that. My absence from God&hellip;my purposeful avoidance&hellip;makes Him feel like I feel right now. In that moment, I saw my role as God&rsquo;s daughter, so busy and so focused on doing life, that I forget Him. When He asks for Facetime, I shrug and say, &ldquo;I guess. If you want to.&rdquo; But I am hasty, and short on the details that He so wants to hear. I consider it a duty to check in with Him, and I check the box until I have to call again. In the meantime, He waits, as I wait, as if waiting is the new purpose of my life.&nbsp;\r\n\r\nMy second thought, which, if I had the ability to accept love like a normal human being, would be even more devastating, is that God longs for me. He misses me. He feels as if a part of Him has wandered off and gotten lost. He counts the days, the hours, the minutes, between calls, and He watches the time pass as a millisecond when I do finally come home. He feels this same constant ache of loss for His child&hellip;His children. In fact, it hurts Him so much that He would rather die than continue to be separated from us. He would give anything if we would just&hellip;call home once in a while. To know that I am loved even more than I love my son, is inconceivable to me. I have never known this kind of love as a recipient. The emotion of it is overwhelming, and I&rsquo;m not sure yet how to receive it. That&rsquo;s why I&rsquo;m indulging in a bit of melodrama. I want to feel these feelings and consider what it means to be the object of them.&nbsp;\r\n\r\nThinking about how to respond to being the beloved daughter of God, I ask myself what I want from my son in return for my love. I only want him to know how deeply we love him. How important he is to us. How vital to our own happiness and fulfillment. And, if I&rsquo;m honest, I suppose I do want that to have some value to him. I do want him to respond to that by not depriving us of himself. That is our joy. To see him fly. To see him succeed. To still have his trust when he has a need. To still be where he lands when he falls. I want him to come home occasionally and be generous with us, sharing his life with us as his constant supporters, encouragers, advisors, and biggest fans. I just think that there is no way he can understand. He has never loved this way, this all-consuming love that only a parent can understand. He has only been loved this way, and in it, he feels an eternal security that makes no unreasonable demands on him. He has received a heavy grace without feeling the weight of it. As it should be for him. As it is with us. And yet&hellip; and yet&hellip; it&rsquo;s a love that begs a response when we allow ourselves to feel it.&nbsp;&nbsp;\r\n\r\nMaybe you &ldquo;get&rdquo; this better than I do. It&rsquo;s pretty simple, I think, on an intellectual level. God loves us with an all-consuming love. Blah blah blah. We say that. But we don&rsquo;t feel it, neither as those who love like that, nor as those who receive it. And I&rsquo;m not sure we could live every day in the constant wash of that emotion, not productively anyway. I would be undone. On my face in the carpet. Worthless for the day&rsquo;s work. But I do think that we should give in to the emotion occasionally and really receive the love that God has for us as His children. I need to be less selfish with myself and my time. I need to fuel His joy. See&hellip;even writing that makes me nervous. ME? Give Him JOY? It seems so presumptuous, and yet I know it to be true in my own aching heart. He wants us to fly, and then He wants us to remember Him who gave us wings. That&rsquo;s all really.&nbsp;&nbsp;\r\n\r\nSo, maybe it&rsquo;s time to call home, get in a little Facetime. If you&rsquo;re super-pressed for time, send a text until you can do more, but remember your daddy today. He misses you. He really misses you. Trust me on this."
    }, {
      "category": "",
      "topics": [{
        "ID": "Prophecy",
        "topic": "Prophecy"
      }, {
        "ID": "end+times",
        "topic": "end times"
      }, {
        "ID": "Tribulation",
        "topic": "Tribulation"
      }],
      "ID": "1356",
      "postedDate": "1439947260",
      "title": "Four Blood Moons",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_2.jpg",
      "authorThumbnailAltText": "Stephen Armstrong",
      "averageRating": "",
      "authorName": "Stephen Armstrong",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "In late September the moon will experience a&nbsp;total lunar eclipse. A total lunar eclipse occurs&nbsp;when the moon passes entirely through the earth&rsquo;s shadow. The&nbsp;earth&rsquo;s shadow casts an orange hue upon the moon, causing the moon to appear reddish-orange&nbsp;in the night sky. This unusual appearance has led some to call it a &ldquo;blood moon.&rdquo;\r\n\r\n\r\n\r\nLunar eclipses&nbsp;occur at&nbsp;irregular but predictable intervals. The earth can go long periods without witnessing&nbsp;a total lunar&nbsp;eclipse. For example, the earth went 300 years&nbsp;during the 17th-19th centuries&nbsp;without experiencing a single blood moon. On the other hand, since the dawn of the 21st century, total&nbsp;lunar eclipses have been fairly common,&nbsp;with nine blood moons having already appeared in just the past decade.\r\n\r\nIn fact, over a two-year&nbsp;period, beginning in April 2014, North America will have experienced&nbsp;four such blood moons. Three occurrences have already come and gone, and the final&nbsp;one will occur in the final&nbsp;week of September 2015.&nbsp;\r\n\r\nThe recent increase of blood moons has led&nbsp;students and scholars alike to speculate&nbsp;whether these occurrences are the fulfillment of Biblical prophecy concerning the last days. Specifically, they point to the words of the prophet Joel, who declared that red moons would mark the end of the age:\r\n\r\nJoel 2:30&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;I will&nbsp;display wonders in the sky and on the earth,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Blood, fire and columns of smoke.&nbsp;\r\nJoel 2:31&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;The&nbsp;sun will be turned into darkness&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; And the moon into blood&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Before the&nbsp;great and awesome day of the LORD comes.&nbsp;&nbsp;\r\nJoel says that the Lord will turn the moon to blood before the great and awesome day of the Lord. Contrary to some teaching, the phrase \"great and awesome day of the Lord\"&nbsp;does&nbsp;not&nbsp;refer to Jesus&#39; Second Coming.&nbsp;Instead, it refers to the seven-year Tribulation on earth foretold by Daniel and the other prophets. The Tribulation goes by many different names in both the Old and New Testaments, including the &ldquo;day of the Lord&rdquo; or the &ldquo;great and terrible day of the Lord.\"\r\n\r\nJoel says that the moon turning into blood will be one of the signs that Tribulation is near. This sign is notably different than the signs the world will experience&nbsp;during&nbsp;the Tribulation. During the seven-year period of Tribulation,&nbsp;both&nbsp;the sun and the moon will be darkened so that neither gives light upon the earth. Multiple prophets mention this dual darkening, including Jesus Himself in Matthew 24.&nbsp;\r\n\r\nBut Joel quite clearly declares that the sun will go dark (perhaps an eclipse),&nbsp;but the moon will turn red like blood (also an eclipse). These signs mark the approach of Tribulation, not the Tribulation itself.\r\n\r\nSo are these ongoing lunar eclipses a fulfillment of Joel&rsquo;s prophecy?\r\n\r\nBefore we answer, we should consider one additional, curious detail. The four blood moon eclipses of 2014-2015&nbsp;occur on April 15, 2014, October 8, 2014, April 4, 2015, and September 28, 2015. These dates are significant in the Jewish calendar. The Spring dates in April coincide with Passover in each year, which is the first feast on the Jewish calendar year. The&nbsp;Autumn dates in October and September&nbsp;coincide with&nbsp;the Feast of Tabernacles, the final feast on the Jewish calendar.&nbsp;\r\n\r\nThe first feast of Passover commemorates the exodus of Israel out of slavery, and it pictures Jesus&rsquo; death on the cross for the sins of Israel and the world. The final annual feast of Tabernacles remembers Israel&rsquo;s wandering in the desert, but it pictures their arrival in the Kingdom. Together they represent the beginning and the end of God&#39;s plan of redemption for His people.\r\n\r\nIt&#39;s not unusual to experience a lunar eclipse in conjunction with a Jewish feast since the Jewish calendar is a lunar calendar and the start of some feasts are tied to the moon&#39;s phases. In fact, a lunar tetrad (i.e., four total lunar eclipses spaced&nbsp;six months apart) occurring in conjunction&nbsp;with these two&nbsp;Jewish feasts is not unprecedented either. This pattern has occurred&nbsp;at least 8 times in the past 2,100 years.\r\n\r\nStill, given the sudden prevalence of full&nbsp;lunar eclipses and their alignment with significant Jewish feasts, Bible scholars wonder if we&#39;re witnessing the&nbsp;fulfillment of Joel&#39;s prophecy.&nbsp;Do they indicate&nbsp;the approach of Tribulation and the other events associated with the end of the Age? Or are they meaningless?\r\n\r\nIf these moons were appearing absent other prophetic fulfillment, then we would be justified in dismissing&nbsp;them as inconclusive, but they are not isolated signs. Numerous other significant end times signs have been fulfilled over the past century or are being fulfilled today, including two world wars (fulfilling Matt 24:7), the reemergence of Israel in her land (Matt 24:32), the increasing frequency of earthquakes and famines (Luke 21:11), and the apostasy of the church (2Thess 2:3). (You can learn more about the signs of the end in our Revelation study.)\r\n\r\nTaken together, all signs point to the approaching end of this age, and in light of this growing body of evidence, we believe it&#39;s reasonable to conclude that&nbsp;the coming lunar eclipses&nbsp;(along with those of the past century) are&nbsp;fulfilling&nbsp;Joel&#39;s prophecy. Notice that other signs in Joel&#39;s prophecy&nbsp;have yet to be fulfilled, so we are not suggesting that these eclipses mean the Tribulation is imminent,&nbsp;only that it&nbsp;is approaching.&nbsp;\r\n\r\nNevertheless, the world and even many Christians will fail to heed these signs, as Jesus warned in His day:\r\n\r\nMatt. 16:1&nbsp;&nbsp;The&nbsp;&nbsp;Pharisees and Sadducees came up, and testing Jesus, they&nbsp;&nbsp;asked Him to show them a&nbsp;&nbsp;sign from heaven.&nbsp;\r\nMatt. 16:2&nbsp; But He replied to them,&ldquo;&nbsp;&nbsp;When it is evening, you say, &lsquo;It will be fair weather, for the sky is red.&rsquo;\r\nMatt. 16:3&nbsp;&ldquo;And in the morning, &lsquo;There will be a storm today, for the sky is red and threatening.&rsquo;&nbsp;&nbsp;Do you know how to discern the&nbsp;appearance of the sky, but cannot discern the signs of the times?&nbsp;\r\n\r\nJesus criticized the unbelieving Pharisees for their unwillingness to recognize the obvious signs He was showing them. Ironically, Jesus chose as His analogy the practice of&nbsp;predicting the weather&nbsp;by watching&nbsp;atmospheric signs in the sky. While the Pharisees&nbsp;could detect subtle changes in the heavens and predict weather patterns, they were unable (i.e., unwilling) to recognize clear and unmistakable signs that the Messiah had come.&nbsp;\r\n\r\nLikewise, today men will take note of the rare appearance of these moons, the unique alignment with important Jewish feasts and the prophecy given in Joel, yet will walk away unconvinced. We are called to live with eyes for eternity, so we can recognize these signs and be prepared for our Lord&rsquo;s return. As Jesus said:\r\n\r\nMatt. 24:32&nbsp; &ldquo;Now learn the parable from the fig tree: when its branch has already become tender and puts forth its leaves, you know that summer is near;\r\nMatt. 24:33 &nbsp;so, you too, when you see all these things,&nbsp;recognize that&nbsp;&nbsp;He is near, right at the&nbsp;&nbsp;door.\r\n&nbsp;If you&#39;re interested in learning more about the signs of the times, consider listening to our Revelation&nbsp;Bible study available in our Bible Studies section.&nbsp;"
    }, {
      "category": "",
      "topics": [{
        "ID": "Homosexuality",
        "topic": "Homosexuality"
      }, {
        "ID": "culture",
        "topic": "culture"
      }, {
        "ID": "society",
        "topic": "society"
      }, {
        "ID": "Persecution",
        "topic": "Persecution"
      }],
      "ID": "1630",
      "postedDate": "1438483860",
      "title": "Staying the Course",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_2.jpg",
      "authorThumbnailAltText": "Stephen Armstrong",
      "averageRating": "",
      "authorName": "Stephen Armstrong",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "Recent events remind us we live in a lost and dying world that desperately needs to know the truth of Christ and Him crucified.&nbsp;\r\n\r\nA cultural revolution is rewriting the rules of right and wrong at a dizzying rate. Immorality is celebrated, piety is mocked and anything goes. As our social fabric frays, many Christians struggle with how to keep our message relevant while protecting our right to participate freely in the marketplace of ideas. For the first time, many fear persecution.\r\n\r\nAs a Christian ministry operating in the midst of this upheaval, it&rsquo;s easy to lose focus. We could detour from teaching the Bible into timely political discourse or social commentary. We could dispense with book studies to examine the roots of these movements, to predict future outcomes and to offer possible antidotes. Certainly, we would have much to say on these matters, and I know we would say it with passion and conviction. And perhaps some in the culture might even listen.\r\n\r\nBut we won&rsquo;t. We don&rsquo;t need to. The Lord has already spoken, and His word is clear enough.\r\n\r\nOur mission is to teach the word of God &ndash; methodically, unrelentingly, and consistently &ndash; and to do so for the reasons God ordained: to persuade the unbeliever to the truth of the Gospel and to equip the saints for the work of ministry. We will continue doing this because it&rsquo;s the&nbsp;only&nbsp;solution for society&rsquo;s ills.\r\n\r\nEach new terrorist act, economic calamity or court decision only serves to strengthen our resolve to preach the word in season or out of season. As Jesus Himself taught:\r\n\r\nLuke 16:31&nbsp;&ldquo;But he said to him, &lsquo;If they do not listen to Moses and the Prophets, they will not be persuaded even if someone rises from the dead.&rsquo;&rdquo;\r\nFriends, if the world will not listen to the word of God, then we have nothing better we can offer. Teaching the word of God is the only thing that will rescue men and women from sin and rebellion and lead them to salvation at the cross of Jesus. The word of God is the power of God to those who are being saved, so a thousand volumes of political commentary cannot equal one verse of scripture. So we will preach the word.\r\n\r\nI am sincerely thankful to all those who have chosen to favor this ministry with prayers and donations, and I assume they do so because they also agree with the importance of teaching scripture. They make it possible for us to reach millions with the word of God, and I assure them &ndash; and everyone &ndash; we will never deviate from that mission until the Lord returns or brings us home.&nbsp;\r\n\r\nMay the Lord return soon, and may He bless your devotion to His holy word.\r\n\r\nSteve"
    }, {
      "category": "",
      "topics": [

      ],
      "ID": "1636",
      "postedDate": "1437342060",
      "title": "My Guts on the Page",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
      "authorThumbnailAltText": "Melissa Church",
      "averageRating": "",
      "authorName": "Melissa Church",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "~~I&rsquo;ve just wrapped up a short summer study with my Bible study group where we allowed Jesus to confront us with some hard questions. He asked us, &ldquo;Who do you say I am?&rdquo; What are you looking for?&rdquo; &ldquo;What do you want me to do for you?&rdquo; And, &ldquo;Does this offend you? You do not want to leave too, do you?&rdquo; Well, I guess that technically makes 5 questions but we answered both of those last two with Peter&rsquo;s own words: &ldquo;Lord, to whom shall we go?&rdquo;\r\n\r\nI have to confess that this was a tough study for me. As a teacher I feel the burden of confronting these things myself before I ask my group to do it. It&rsquo;s hard stuff. And, while Jesus was not surprised by my answers, I surely was. Today, I realized that He&rsquo;s asked me another one. This one isn&rsquo;t found directly in scripture. It&rsquo;s just for me (except as I find myself moved to share it with you!). It&rsquo;s quiet, and penetrating, and I have not yet allowed it to go deep enough to answer. In fact, I am powerless to answer right now, but He is gracious to begin asking now in preparation.\r\n\r\nMy son is leaving for college in 23 days. Don&rsquo;t tune me out. Hang in for the ending. Like my friends, roll your eyes, pat my hand, and stay with me!! I have to explain some of this for you to truly understand, and even then you won&rsquo;t, but I will give it a go anyway. &hellip; and here I sit waiting for a beginning to present itself on the page. I don&rsquo;t know where to start. I guess, I would say that I am very close to my son. If you&rsquo;ve been reading for any time at all, you know that when Wil was small we discovered that he had cancer. That began a bonding of sorts between us that exceeds what other parents typically experience. I almost feel like I birthed him twice, after carrying him twice. And &ldquo;carrying&rdquo; him through chemotherapy was harder and longer. Psychologists would say, peering critically over their glasses, that I am enmeshed with my son.\r\n\r\nWhen Wil was four, I became a true follower of Christ, and shortly thereafter, Jesus set me free from the corporate world. Yes. I continued to work part-time the whole year Wil was in chemo. Then the Lord sent me home. To live every single day with a 4-year-old. Every. Day. Alone. With a 4-year-old. I had no idea what to do. I never wanted to be a stay-at-home mom. I was completely freaked. I could not comprehend what had happened to my purpose, my identity, my significance. It wasn&rsquo;t that I had loved my job. I hadn&rsquo;t. I hated it. I hated working. But&hellip;this. This was not something I had ever imagined for myself, and I was too afraid to love it. Gladly, that didn&rsquo;t last long. Within 6 months, I couldn&rsquo;t imagine anything MORE purposeful, MORE significant, and I loved that my identity was now &ldquo;mom&rdquo;. I know. Stay with me.\r\n\r\nThat was 14 years ago. I filled every unforgiving minute of those 14 years with 60 seconds worth of distance run! I loved my mom-job, and because I have always been secretly quite ambitious, I set out to be the BEST at my job. If there were awards&hellip;that&rsquo;s what I was shooting for. Scripture says, &ldquo;her children rise up and call her blessed&rdquo;. That was the goal. And though I&rsquo;ve yet to hear the words, I think I met the challenge. I (OK&hellip;credit where due&hellip;WE) raised a great kid. I could not&nbsp; be more proud. Wil is truly a blessing to me and his dad. If we could have written a &ldquo;perfect kid&rdquo; recipe as parents, Wil would have been the result. We never experience rebellion. He has always been uber-obedient. He sets high standards for himself and tries hard to meet those standards. He&rsquo;s not perfect&hellip;his politics are questionable, and he likes to be the Junior Holy Spirit convicting the whole world of sin, but I know there are great things ahead for him and I am thrilled with excitement at the prospect of who he will become and what he will experience.&nbsp; And I am positively sick at heart.\r\n\r\nWhat. Now?\r\n\r\nI have never had to confront my identity separate from&hellip;anything. Always, I&rsquo;ve latched on to the next thing that I could throw myself into. I am fearful for the nice people at the Children&rsquo;s Shelter and for my Bible study group because&hellip;well&hellip;they&rsquo;re next! Unless&hellip;unless I can sit quietly in the dust at my Master&rsquo;s feet and answer His question.\r\n\r\n&ldquo;Am I enough?&rdquo;\r\n\r\nI&rsquo;m too scared to answer right now. That nothingness of purpose, significance, and identity seems a vast and empty darkness looming as I hurtle toward its shadow. I don&rsquo;t know what lurks there. I don&rsquo;t know how to anticipate having my heart and soul and life and reason for rising in the morning abruptly removed. (And let me just tell you that the words I want to use here but didn&rsquo;t for fear of melodrama are: sucked, amputated, severed, ripped, and pried-from-my-cold dead-hands!) He is my first. He is my last. He is my only.\r\n\r\n&ldquo;Am. I. Enough?&rdquo;\r\n\r\nOnly by your own power, Lord. You gave me a heart for this child that burns with an all-consuming fire. Your heart. You wrapped my days and nights around him. You planted the seed in my heart that grew and bore sweet fruit. You blessed my obedience, redeemed my past, empowered my weaknesses, overcame my insecurities. You made me fierce and fearless. You made me tender. You spoke when I had no words. You healed when I could only nurse. You worked when I could only pray. You went ahead when I could only follow. You hold all that I treasure in your hands&hellip;and I surrender him to you. Are you enough? Are you enough for him? Will you be enough for me when he is gone?\r\n\r\nFellow traveler, I am aware of the theology gaps (and the sin!) in what I&rsquo;ve confessed to you. I know my identity is in Christ&hellip;my purpose, my significance&hellip;and I hope that you do too. I hope you know it better than I do. I hope your heart knows it, because that is the work ahead of me. Teaching my heart to know what my head understands in theory. I also know that only a handful of you may be where I am right now, but I bet every one of you is facing a big black gaping unknown of some sort where Jesus is standing at the precipice asking you, &ldquo;Am I enough?&rdquo; We all have to answer at some point, and then live to tell about it. Because we know that HE IS, and that this is His story&hellip;His glory. But our hearts tremble with the thought of the unknown, the surety of the pain, and the effort that lies ahead to just get&hellip;out&hellip;of&hellip;bed and&hellip;what? For me&hellip;walk past that empty room. For you? That is your own gap to fill. For Him to fill. And I pray that we will all find it filled &ndash; poured out, pressed down, shaken together, and running over &ndash; with the very presence of God.\r\n\r\nHe is enough.\r\n\r\n(Just a last thought. I&rsquo;ve done the math, and as near as I can remember this marks the 8th year I&rsquo;ve been contributing to Verse by Verse since Pastor Armstrong said that he felt the site needed someone to write to the &ldquo;soccer moms&rdquo;. HA! I&rsquo;m not sure I ever did that, but for sure, now I&rsquo;ve run out of those carpool mini-van days. I hope you all will stick with me now that I&rsquo;ve left the soccer field, the classroom, and crossed the stage to &ldquo;Pomp and Circumstance&rdquo;.&nbsp; Consider this post the launching pad for the next &ldquo;adventure&rdquo; &ndash;we&rsquo;re going to call it that in faith! I hope the Lord will continue to bless me with material and words to say that find you where I am too. Many blessings&hellip;Melissa)&nbsp;&nbsp;"
    }, {
      "category": "",
      "topics": [

      ],
      "ID": "1629",
      "postedDate": "1435850760",
      "title": "God Does Not Believe In Democracy",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_19.jpeg",
      "authorThumbnailAltText": "Ivette Irizarry",
      "averageRating": "",
      "authorName": "Ivette Irizarry",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "God does not believe in democracy.\r\n\r\nI hope that doesn&rsquo;t come as a shock to you, especially if you are a dedicated student of God&rsquo;s word. Don&#39;t get me wrong. I love living in America and being a US citizen. It is undeniable that we have been blessed to live in a country where so far we have been able to personally embrace the faith God has breathed into us, largely without persecution or opposition.&nbsp;But&nbsp;it baffles me how many Christians, especially American Christians have so inextricably linked their faith with their patriotism that it is hard to see any boundary between the two.\r\n\r\nWhen we look at things with God&rsquo;s eyes, we will find that the many categories and distinctions we invent as human beings are greatly reduced and simplified. Where we see Baptists, Presbyterians, &ldquo;Non-denominationals&rdquo;, God sees ONE church comprised of a subset of individuals &mdash;only the ones sealed with the Holy Spirit&mdash; who identify themselves with each of those labels. Where we see Jew, African, Latin-American, European, Asian, Caucasian, Black, etc., scripture clarifies the only two categories are Jew and Gentile (i.e. not Jew). In God&rsquo;s eyes there are only two kinds of government: His government (a Theocracy), and democracies of various different flavors.&nbsp;\r\n\r\nDemocracy is quintessentially defined as &ldquo;a government of the people, by the people and for the people.&rdquo; You can travel the entire globe and you will not find a single government that does not fit this definition. All earthly governments have been invented by people, they are run by people and are established to serve, you guessed it, people. They only differ in how many &lsquo;people&rsquo;s&rsquo; interests are actually represented.\r\n\r\nSo it should come as no surprise to you when your beloved democracy fails to uphold the Biblical values that define you as a Christian. Brothers and sisters, yes, God&rsquo;s hand was mightily involved in the formation of the United States, just as much as He was involved in the establishment of all nations:\r\n\r\nDaniel 2:21\r\n&ldquo;It is He who changes the times and the epochs;\r\nHe removes kings and establishes kings;\r\nHe gives wisdom to wise men\r\nAnd knowledge to men of understanding.&rdquo;\r\n\r\nAnd, yes, the founding fathers subscribed to moral values and ethics, most of which aligned with Biblical principles. That does not make the US a &ldquo;Christian country&rdquo;. A democracy, as we define it, is essentially a human (and humanistic) government with its roots in the very pagan&nbsp;Greek and Roman civilizations. Anything human in origin is by definition sinful and corrupt. It eventually decays and crumbles from within, because of its very essence. Simply put, a&nbsp;government by people is not led by God.\r\n\r\nDo you want an example from scripture? We have only to look at Israel, a PEOPLE hand-selected and anointed by God. At every turn they forsook and opposed the leading of their pillar of cloud and fire (God&rsquo;s very presence, which later dwelt among them in the Tabernacle and Templ), and sought to build their nation based on alliances with the Canaanites who led them into rampant idolatry. These same people eschewed God&rsquo;s leadership and clamored to be ruled by human kings. That experiment did not end well.\r\n\r\nWhen you celebrate your country&rsquo;s freedom, do be thankful for all you have been given and for the country where you live, but remember that your thanks ought to be directed principally to the God who provided for you this portion on earth. Celebrate the freedom in your country with your eyes open,&nbsp;considering that we define freedom in human terms, and that freedom is a double-edged sword. It equally protects those who would&nbsp;use our lips to bless God as much as those would would use their lips to curse Him. It gives us the freedom to elect people who uphold Biblical principles, or just as easily to elect those who deny God&rsquo;s existence and proclaim&nbsp;the absence of any moral statutes. When the choice is left in the hands of people, people will follow their sinful nature. There is none righteous, no not one. No one seeks after God. (Romans 3:10-11)\r\n\r\nWhen you look at your faith and your country, can you clearly see the distinction? What is your citizenship? Are you an American who believes in Christ, or are you a Christian who lives in America?\r\n\r\nTake a look at Paul&rsquo;s warning to the Philipians. Don&rsquo;t focus on the earthly things as those who follow their own appetite do. Your citizenship is in Heaven.&nbsp;Our focus needs to be on eternity. Our lives need to reflect the peace of the knowledge we have received.\r\n\r\nPhilipians 3:18-21\r\n18&nbsp;For many walk, of whom I often told you, and now tell you even weeping, that they are enemies of the cross of Christ, 19&nbsp;whose end is destruction, whose god is their appetite, and whose glory is in their shame, who set their minds on earthly things. 20&nbsp;For our citizenship is in heaven, from which also we eagerly wait for a Savior, the Lord Jesus Christ; 21&nbsp;who will transform the body of our humble state into conformity with the body of His glory, by the exertion of the power that He has even to subject all things to Himself.\r\n\r\nAt the end of the age, Christ Jesus, the &ldquo;King of Kings and Lord of Lords&rdquo; is coming to establish a government. It will most definitely NOT be a democracy. Isaiah 9:6 tells us &ldquo;the government shall be upon His shoulder.&rdquo; The whole government, all of it, what Jesus says goes. There will be no voting; nothing will be ruled by committee. &ldquo;Yes&rdquo; or &ldquo;No&rdquo; from the mouth of God; no gray areas.&nbsp;\r\n\r\nI am infinitely grateful that I have been given the unmerited gift of trading my paper passport for the one that will allow me to enjoy the boundless peace, joy and prosperity that awaits us in God&rsquo;s Kingdom."
    }, {
      "category": "",
      "topics": [

      ],
      "ID": "1624",
      "postedDate": "1435173120",
      "title": "Still a Fan",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
      "authorThumbnailAltText": "Melissa Church",
      "averageRating": "",
      "authorName": "Melissa Church",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "~~Author&rsquo;s pre-ramble\r\nI wrote the following article a couple of years ago, so I realize that it&rsquo;s dated in context. However, you will quickly understand the issue, and the timely discussion that follows&hellip;I trust you to see the bigger message that came from a small less-than-relevant-or-noteworthy event of a moment and how it applies to a very important and relevant dialogue taking place in our country right now. As always&hellip;read at your own risk, knowing that I&rsquo;m with you at the mirror.&nbsp;\r\n\r\nYou may have heard about Adam Levine&rsquo;s unfortunate faux pas on national television this week. (Don&rsquo;t tune out now even if you have no idea what I&rsquo;m talking about!!) He muttered a comment under his breath in an obviously emotional moment that revealed his heart. He said, &ldquo;I hate this country&rdquo;. If you watch The Voice, you know how intense the eliminations can get and how attached these judges are to their contestants. Adam&rsquo;s comment revealed his commitment to and respect for his team. It also revealed his bias and his humanity.\r\n\r\nHere&rsquo;s the thing. Adam has taken a very vocal stand in his personal and professional life&nbsp;against the intolerance he sees in other places and people, and he practices an attitude of tolerance. He seems to be a truly, genuinely nice guy; the appearance of tolerance is certainly attractive. The problem is that it&rsquo;s a lie. None of us is truly tolerant. Adam&rsquo;s comments expose the lie for what it is. What he really said, reading between the lines, was, &lsquo;I hate that people liked country music more than what my team sang today&rsquo;. &lsquo;I hate the diversity represented by the democratic process&rsquo;.&nbsp; &lsquo;I hate that not everyone thinks the way I do, nor shares my taste in music&rsquo;. &lsquo;I hate that I did not get my way because other people are different from me.&rsquo;&nbsp;\r\n\r\nThat is not tolerance. It&rsquo;s&hellip;preference&hellip;partiality&hellip;prejudice. These are traits common to the human condition, but (pardon my personal opinion here) this is a truth that a tolerant philosophy will not own. Humility is required in order to admit that we favor certain people over others and dislike entire groups of people for no good reason. Just try admitting it out loud in your next Bible study meeting and you&rsquo;ll see what I mean! (Oh&hellip;did you think I was talking about &ldquo;them&rdquo; and not you?) Jesus condemned this attitude of partiality as sin &ndash; God condemned it long before Jesus came. If a tendency to show partiality didn&rsquo;t exist within us, it wouldn&rsquo;t be worth mentioning, would it?\r\n\r\nGet real with me here. If you will shake out your ruffled feathers for a minute, I&rsquo;ll bet you could easily name 10 groups of people you dislike or who make you suspicious.\r\n\r\n1.&nbsp;Bad drivers\r\n2.&nbsp;People who talk too loudly on their cell phones in public\r\n3.&nbsp;Teenagers\r\n4.&nbsp;People who are overweight (ouch)\r\n5.&nbsp;Muslims (now we&rsquo;re gettin&rsquo; real)\r\n6.&nbsp;Liberals \/conservatives\r\n7.&nbsp;Democrats \/Republicans\r\n8.&nbsp;The president (too close to home??)\r\n9.&nbsp;Illegal aliens (hurt your feelings now??)\r\n10.&nbsp;Unbelievers (you know it&rsquo;s true - just think Chik-fil-A!)\r\n\r\nPlus car salesmen, &lsquo;customer service&rsquo; reps, those people selling magazines door to door, insurance salesmen, computer hackers, telephone solicitors, financial planners, men who work in day care, Catholics and the whole Catholic establishment, people with tattoos and nose rings, school administrators, the Los Angeles police department, Disney, New Orleans &ndash;all of it &ndash;, televangelists, faith-healers, prosperity preachers, Joyce Meyer, Calvinists and Armenians (take your pick) people who don&rsquo;t know the difference between there\/their\/they&rsquo;re, people who can&rsquo;t form possessives using apostrophes (is this just me?), stay at home dads, working moms, the press. The list is as unique as the person making it, but we all have one &ndash; a list of people toward whom we are surely intolerant.&nbsp;&nbsp;&nbsp;\r\n\r\nThe problem with wearing an air of tolerance (whether as a part of your Christian practice or otherwise) is that when you have one of those difficult encounters with diversity, your tolerance is unmasked and revealed to be prideful hypocrisy and false humility. There&rsquo;s no backpedaling. What Adam said was not so much, &ldquo;I hate my country&rdquo; as it was, &lsquo;I hate people who are different from me&rsquo;. Making him as intolerant as the guy he points his finger at. And if you just thought something along the lines of, &ldquo;Yeah! All that and a bag of chips!&rdquo; then you&rsquo;ve just revealed your own intolerance for Adam and people like Adam. Making you as misguided as you think he is. Shazam.\r\n\r\nWe would all &ndash; believer and unbeliever alike &ndash; like to think of ourselves as accepting, loving people who don&rsquo;t wash after we shake hands with the poor (You may bump elbows with them at the lav &ndash; wouldn&rsquo;t that be something!). We would all like to congratulate ourselves on our holy enlightenment by giving away our Abercrombie to the homeless as if that&rsquo;s not insulting to them (I digress). But reaching around to pat ourselves on the back makes us too busy to notice our sin. And too full of pride to admit and confess it, turn from it in repentance, and become a debtor to grace. That is the sad condition in which those who practice a philosophy of tolerance find themselves. And, Christian, that is the sad condition some of us find ourselves in. No pointing fingers and saying, &ldquo;Ah-ha!&rdquo; unless you&rsquo;re standing in front of the mirror.\r\n\r\nSo if I were face to face with Adam I might pat his back and tell him how sorry I am that his philosophy has been proven false and that he has been unable to carry it out and that his idols have feet of clay. I would welcome him to the human race and say that we&rsquo;re all in this together and we&rsquo;re all in need of a Savior. I would agree that it&rsquo;s almost intolerable in its weight, but true none the less. And I would assure him that I&rsquo;m still a fan."
    }, {
      "category": "",
      "topics": [{
        "ID": "Word+of+God",
        "topic": "Word of God"
      }, {
        "ID": "Righteousness",
        "topic": "Righteousness"
      }, {
        "ID": "False+Teachers",
        "topic": "False Teachers"
      }],
      "ID": "1611",
      "postedDate": "1432439160",
      "title": "Is preaching verse-by-verse &#8220;cheating?&#8221;",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_13.jpg",
      "authorThumbnailAltText": "Brian Smith",
      "averageRating": "",
      "authorName": "Brian Smith",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "There are many ways to preach a sermon.&nbsp; No doubt, some are more effective than others.&nbsp;Some people preach thematically, some topically, some do series, and some preach verse by verse through books of the Bible.&nbsp; Each can be effective, but surely some ways are better than others.&nbsp; By the name of our ministry, you can probably guess which method of preaching we prefer.&nbsp;Personally, I think it&rsquo;s the best method of preaching.&nbsp; But would you say it is &ldquo;cheating&rdquo;?\r\n\r\nWell, the senior pastor of a mega church thinks that preaching verse by verse through books of the Bible is cheating.&nbsp;Andy Stanley is the pastor of North Point Community Church in Alpharetta, GA (just outside Atlanta).&nbsp;At just over 30,000 members, this is the second largest church in America.&nbsp; In a 2009 interview, pastor Stanley was asked this question:&nbsp;&ldquo;What do you think about preaching verse-by-verse messages through books of the Bible?&rdquo;&nbsp; Here was his response:\r\n\r\n&#10;Guys that preach verse-by-verse through books of the Bible-- that is just cheating.&#10;It&#39;s cheating because that would be easy, first of all. That isn&#39;t how you grow people.&#10;No one in the Scripture modeled that.  There&#39;s not one example of that.  All Scripture&#10;is equally inspired, but not all Scripture is equally applicable or relevant to every &#10;stage of life. My challenge is to read culture and to read an audience and ask: What &#10;is the felt need?  Or perhaps what is more important, what is an unfelt need they need&#10;to feel that I can address? Because if they don&#39;t feel it, then they won&#39;t address it.&#10;\r\nWhen I read this, I really didn&rsquo;t understand what he meant by &ldquo;cheating&rdquo;.&nbsp;He says it&rsquo;s easy, but just because something is easy does not mean it is cheating.&nbsp;To cheat means to deceive, defraud, violate rules, to act dishonestly.&nbsp;I cannot see how preaching verse by verse &ldquo;cheats&rdquo; in any way whatsoever.&nbsp;Scripture does not say preaching has to be verse by verse, but it also does not say one cannot preach that way.&nbsp;So, to say it is cheating is simply nonsensical.\r\n\r\nHe also says that preaching verse by verse is &ldquo;easy&rdquo;.&nbsp;Clearly, pastor Stanley has never preached verse by verse.&nbsp;It may be many things, but it is not easy, at least not if it&rsquo;s done right.&nbsp;Preaching through a book of the Bible requires a historical understanding of the book being preached.&nbsp;It requires an understanding of the underlying Hebrew or Greek.&nbsp;It requires cross referencing to other Scriptures.&nbsp;It requires studying Biblical commentaries, which aren&rsquo;t absolutely necessary, but are certainly very helpful.&nbsp; No, this is not easy.&nbsp;On the contrary, it is hard work.\r\n\r\nHe next says that verse by verse preaching does not grow people.&nbsp;Before examining this, it&rsquo;s helpful to know what pastor Stanley thinks does grow people.&nbsp;He relates a defining moment in his life:\r\n\r\n&nbsp;\r\n\r\nI believe the true defining moment of my life as a communicator took place when&#10;I was in seminary. I was asked to do a chapel for the high school academy at &#10;First Baptist Church, Dallas. So I got the message all ready to go, and I was &#10;going to preach on the story of Naaman. And God told him to dip in the water &#10;seven times and he would be healed. I had all this great stuff. And I was sitting &#10;in my one-room efficiency apartment and I was thinking, \"These kids have heard &#10;everything. They go to church all the time. They are not going to remember this. &#10;This is just another chapel. What can I do so that they can remember this? I am &#10;just going to come up with one phrase and I am going to say it so many times that &#10;they can&#39;t possibility forget it.  So I came up with this phrase: \"To understand &#10;why, submit and apply.\" That was over 30 years ago and I still remember it.  &#10;So I told the whole story. And I said the bottom line was: \"To understand why, &#10;submit and apply.\" And I said that God is going to ask you to do some things &#10;that you might not understand why, but you must submit and apply. I had them say &#10;it over and over. Three years go by, and I am working in the college department &#10;in the same church and a freshman walks in and says, \"I remember you. To understand &#10;why, submit and apply.\" He didn&#39;t remember my name. He wasn&#39;t even sure where &#10;he had seen me before. But it stuck in his head. And I&#39;ll never forget thinking, &#10;\"That is what I want to do for the rest of my life. I want to take all this stuff &#10;in the Bible, and I want to say it so simply that it gets so lodged in people&#39;s &#10;hearts that in the moment of transition or temptation or whatever it might be, &#10;they think: What is that statement? What is that phrase?&nbsp;\r\n\r\nOn the positive side, it&rsquo;s good he wants to take what&rsquo;s in the Bible and get it lodged into people&rsquo;s hearts.&nbsp;While using a catch phrase can be helpful, I think he turns preaching on its head.&nbsp; Rather than preach the word and let it do its work by the power of the Spirit, he thinks in his own power (by using catch phrases and appealing to felt needs), he can grow people.&nbsp;That is not what Scripture says.&nbsp;In John 17, in His high priestly prayer to the Father, Jesus prays for His disciples&rsquo; sanctification:\r\n&nbsp;\r\n\r\n&ldquo;13 But now I come to You; and these things I speak in the world so that they may have My joy made full in themselves. 14 I have given them Your word; and the world has hated them, because they are not of the world, even as I am not of the world. 15 I do not ask You to take them out of the world, but to keep them from the evil one. 16 They are not of the world, even as I am not of the world. 17 Sanctify them in the truth; Your word is truth. 18 As You sent Me into the world, I also have sent them into the world. 19 For their sakes I sanctify Myself, that they themselves also may be sanctified in truth.&rdquo;\r\n&nbsp;Jesus explicitly says we will be sanctified in His word.&nbsp;We don&rsquo;t need catchy phrases, appeals to felt needs or an engaging environment in which we hear the word.&nbsp;The word does its work in us by the power of the Spirit.&nbsp;Martin Luther stated this very well:&nbsp;\r\n\r\n&#10;&ldquo;In short, I will preach it, teach it, write it, but I will constrain no man &#10;by force, for faith must come freely without compulsion. Take myself as an example. &#10;I opposed indulgences and all the papists, but never with force. I simply taught, &#10;preached, and wrote God&rsquo;s Word; otherwise I did nothing. And while I slept &#10;[cf. Mark 4:26&ndash;29], or drank Wittenberg beer with my friends Philipp&#65279;&#65279; and Amsdorf,&#65279;&#65279; &#10;the Word so greatly weakened the papacy that no prince or emperor ever inflicted &#10;such losses upon it. I did nothing; the Word did everything.&rdquo;  \r\nIt was the word of God that moved people out of the darkness of the false gospel of Catholicism; Luther simply preached it.\r\n\r\nLuther referred to Mark 4, which says,\r\n\r\n\r\n&ldquo;26 And He was saying, &ldquo;The kingdom of God is like a man who casts seed upon the soil; 27 and he goes to bed at night and gets up by day, and the seed sprouts and grows&mdash;how, he himself does not know. 28 The soil produces crops by itself; first the blade, then the head, then the mature grain in the head. 29 But when the crop permits, he immediately puts in the sickle, because the harvest has come.&rdquo;&nbsp;\r\nThe seed is the word, and all we need do is preach it.&nbsp; The Lord Himself will provide the growth.&nbsp; As we read in 1 Corinthians 3: &nbsp;\r\n\r\n&ldquo;6 I planted, Apollos watered, but God was causing the growth. 7 So then neither the one who plants nor the one who waters is anything, but God who causes the growth.&rdquo;\r\n&nbsp;Furthermore, Paul tells pastor Timothy to preach the word:\r\n\r\n&ldquo;1 I solemnly charge you in the presence of God and of Christ Jesus, who is to judge the living and the dead, and by His appearing and His kingdom: 2 preach the word; be ready in season and out of season; reprove, rebuke, exhort, with great patience and instruction. 3 For the time will come when they will not endure sound doctrine; but wanting to have their ears tickled, they will accumulate for themselves teachers in accordance to their own desires, 4 and will turn away their ears from the truth and will turn aside to myths. 5 But you, be sober in all things, endure hardship, do the work of an evangelist, fulfill your ministry.&rdquo; (2 Timothy 4)\r\n&nbsp;Beloved, if pastors are appealing to &ldquo;felt needs&rdquo;, they are going to draw people to themselves who want their ears tickled.&nbsp; They will seek out those pastors who preach in accordance with their own desires.\r\n\r\nIn fact, perhaps pastor Stanley&rsquo;s worst statement is this:&nbsp;\r\n\r\n&#10;&ldquo;All Scripture is equally inspired, but not all Scripture is equally &#10;applicable or relevant to every stage of life. My challenge is to read &#10;culture and to read an audience and ask: What is the felt need? Or &#10;perhaps what is more important, what is an unfelt need they need to &#10;feel that I can address?  Because if they don&#39;t feel it, then they &#10;won&#39;t address it.&rdquo;&#10;&#8203;Do you see the pride at work here?&nbsp;This man thinks he knows when Scripture is relevant and when it isn&rsquo;t in each life of all of his 30,000 plus congregation.&nbsp;Seriously?&nbsp;No one but God knows what each person needs to hear.&nbsp;Indeed, 2 Timothy 3 contradicts the pastor&rsquo;s statement:&nbsp;\r\n\r\n\r\n&ldquo;6 All Scripture is inspired by God and profitable for teaching, for reproof, for correction, for training in righteousness; 17 so that the man of God may be adequate, equipped for every good work.&rdquo;\r\n&nbsp;The Bible explicitly says all Scripture is profitable, which means it is always profitable.&nbsp;It is always relevant.&nbsp;How can any pastor think they somehow know that some passages of Scripture are and are not relevant to certain stages of life?&nbsp; They can&rsquo;t.\r\n\r\nThis brings us back to the beauty of preaching verse by verse through books of the Bible.&nbsp; When this is done, the pastor doesn&rsquo;t need to try to address felt or unfelt needs.&nbsp;He doesn&rsquo;t need to worry about in what stage of life a person is.&nbsp;He doesn&rsquo;t need to worry about the culture, or &ldquo;reading an audience&rdquo;.&nbsp; Paul certainly didn&rsquo;t worry about reading his audience (Acts 20):\r\n&nbsp;\r\n\r\n&ldquo;7 On the first day of the week, when we were gathered together to break bread, Paul began talking to them, intending to leave the next day, and he prolonged his message until midnight. 8 There were many lamps in the upper room where we were gathered together. 9 And there was a young man named Eutychus sitting on the window sill, sinking into a deep sleep; and as Paul kept on talking, he was overcome by sleep and fell down from the third floor and was picked up dead. 10 But Paul went down and fell upon him, and after embracing him, he said, &ldquo;Do not be troubled, for his life is in him.&rdquo; 11 When he had gone back up and had broken the bread and eaten, he talked with them a long while until daybreak, and then left. 12 They took away the boy alive, and were greatly comforted.&rdquo;\r\n&nbsp;Talk about &ldquo;felt needs&rdquo; &ndash; people were falling asleep and even dying!&nbsp; What did Paul do?&nbsp;Healed the boy and kept on preaching!&nbsp;Paul knew that what we all really need is to hear the word of God, which is profitable for teaching, reproof, correction, and training in righteousness.&nbsp;This is how we are sanctified and equipped for every good work.\r\n\r\nWhile it&rsquo;s not an absolute, generally speaking, the size of a church tends to be inversely related to how much or how deeply the word is preached.&nbsp; This is exactly as God predicted, as people seek out preaching where they can be comfortable (see 2 Timothy 4 above).&nbsp; Indeed, the church I attend preaches verse by verse, and we are very small.&nbsp; As for us, we will continue to preach verse by verse, spreading the seed of the word.&nbsp; We&rsquo;ll go to sleep, wake up and watch how God the Holy Spirit brings that seed to full maturity, all to His glory.&nbsp; We&rsquo;ll also look joyfully towards His harvest.&nbsp; Even so, come Lord Jesus!"
    }, {
      "category": "",
      "topics": [{
        "ID": "Sovereignty",
        "topic": "Sovereignty"
      }, {
        "ID": "Leaders",
        "topic": "Leaders"
      }, {
        "ID": "Faith",
        "topic": "Faith"
      }],
      "ID": "1610",
      "postedDate": "1432244520",
      "title": "A Warning to the Nations",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_19.jpeg",
      "authorThumbnailAltText": "Ivette Irizarry",
      "averageRating": "",
      "authorName": "Ivette Irizarry",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "Maybe it&rsquo;s because I am getting old, but every time I open my Bible these days it strikes me how very TODAY it is. For example, I am currently studying the book of Psalms, and a few weeks ago read Psalm 2.\r\n\r\n1Why are&nbsp;the&nbsp;nations in an uproar\r\nAnd the peoples&nbsp;devising a vain thing?\r\n2&nbsp;The&nbsp;kings of the earth take their stand\r\nAnd the rulers take counsel together\r\nAgainst the&nbsp;Lord&nbsp;and against His&nbsp;Anointed, saying,\r\n3&nbsp;&ldquo;Let us&nbsp;tear their fetters apart\r\nAnd cast away their cords from us!&rdquo;\r\n\r\n4&nbsp;He who&nbsp;sits in the heavens&nbsp;laughs,\r\nThe Lord&nbsp;scoffs at them.\r\n5&nbsp;Then He will speak to them in His&nbsp;anger\r\nAnd&nbsp;terrify them in His fury, saying,\r\n6&nbsp;&ldquo;But as for Me, I have&nbsp;installed&nbsp;My King\r\nUpon Zion,&nbsp;My holy mountain.&rdquo;\r\n\r\n7&nbsp;&ldquo;I will surely tell of the&nbsp;decree of the&nbsp;Lord:\r\nHe said to Me, &lsquo;You are&nbsp;My Son,\r\nToday I have begotten You.\r\n8&nbsp;&lsquo;Ask of Me, and&nbsp;I will surely give&nbsp;the&nbsp;nations as Your inheritance,\r\nAnd the&nbsp;very&nbsp;ends of the earth as Your possession.\r\n9&nbsp;&lsquo;You shall&nbsp;break them with a&nbsp;rod of iron,\r\nYou shall&nbsp;shatter them like&nbsp;earthenware.&rsquo;&rdquo;\r\n\r\n10&nbsp;Now therefore, O kings,&nbsp;show discernment;\r\nTake warning, O&nbsp;judges of the earth.\r\n11&nbsp;Worship the&nbsp;Lord&nbsp;with&nbsp;reverence\r\nAnd rejoice with&nbsp;trembling.\r\n12&nbsp;Do homage to&nbsp;the Son, that He not become angry, and you perish&nbsp;in&nbsp;the way,\r\nFor&nbsp;His wrath may&nbsp;soon be kindled.\r\nHow blessed are all who&nbsp;take refuge in Him!\r\n\r\n&nbsp;\r\n\r\nDid it hit you? It hit me like a semi truck. It hit me like when those poor basketball players would run into Shaquille O&rsquo;Neal down in the post, and fall flat on their backs.\r\n\r\n&ldquo;Let us tear [the fetters of God and His Anointed Jesus] apart\r\nAnd cast away their cords from us!&rdquo;\r\n\r\nIn other words, &ldquo;Let&rsquo;s just get rid of God.&rdquo;\r\n\r\nThe human race has been about the business of &ldquo;getting rid of God&rdquo; for several decades now. Of course, scripture tells us that man&rsquo;s natural inclination is to get rid of God, period. Remember Adam and Eve in the garden? What I mean is getting rid of Him in a very unapologetic, very public way. It is the litany of &lsquo;no&rsquo;: no cross, no Bible, no prayer, no displaying of commandments, no mention of creation in textbook, no such thing as hell, no Bible-based counseling from the chaplain, no moral absolutes, no absolute truth, no boundaries in genetic perversions of His creation, no God-given definition of marriage, no God-established definition of life&hellip; and so on.\r\n\r\nPsalm 2 speaks specifically of an agenda by the rulers, taking counsel together against the Lord. It speaks about a concerted effort to tear off anything that binds us to God, for that is what fetters are. With each decree, treaty, official action and decision they lead their nations ever farther off the course of reconciliation with God. As believers, our eyes widen, our hearts sink, and (I hope) we instantly recognize these as signs of the closing of the age.\r\n\r\nI don&#39;t know if it is true, but I&rsquo;ve read that dogs are not aware of their own size. Have you ever seen a tiny dog square off against a really big dog? It is ridiculous and hilarious, until the big dog barks back. (v.4-5) He who sits in heaven is looking down at us little ants running around scheming and shaking our fists at the One we claim probably doesn&#39;t even exist &mdash;and He laughs. At first He laughs, but then He will speak in anger to remind us that He has appointed His Son Jesus as King upon His holy mountain (v.5). Forever.&nbsp;\r\n\r\nBrothers and sisters in Christ, take comfort in the promises God has made to His Son Jesus (vv. 7-9), and through Him to us, His co-heirs in the Kingdom (Rom. 8:17). When you see the rulers of the earth take counsel together against the Lord, step back and see them for what they are: a tiny little dog who doesn&rsquo;t realize the power of the One against whom they have declared their enmity.\r\n\r\nVerses 10-12 are such a clear warning. It makes you want to copy-paste it onto an email out to all those fools (Ps. 14.1). If only they would read it. If only they had the Spirit to understand it.&nbsp;\r\n\r\n&ldquo;Now therefore, O kings [presidents, prime-ministers, governors, sheiks..], show discernment;\r\nTake warning, O judges [leaders, congress, parliament, city-councils, mayors, court judges] of the earth.\r\n&ldquo;Worship the Lord with reverence and rejoice with trembling.&rdquo; (v.11)\r\n\r\nWorship Him and rejoice, and then tremble in fear and gratitude that you are still alive and the big dog didn&rsquo;t maul you to death right there where you stood barking your little bark. &nbsp;\r\n\r\nAs for me, this little dog will hide behind her Master, her Protector:\r\n\r\n&ldquo;How blessed are all who take refuge in Him!&rdquo; (v.12)\r\n\r\nI don&rsquo;t want to make the same mistake of the rulers. My fetters, I want them nice and tight. I like them locked, and the key thrown away. You see, what I know that they don&rsquo;t is that I used to be bound by a different set of fetters that chained me to sin, and to the cursed earth that will soon be destroyed. But God traded those in for me and bound me to Himself, because it&rsquo;s the only way to keep me safe.\r\n\r\nThe hymn writer said it best:\r\n\r\n&ldquo;Let Thy goodness, like a fetter, bind my wandering heart to Thee.\r\nProne to wander, Lord, I feel it, prone to leave the God I love.\r\nHere&rsquo;s my heart, Lord, take and seal it. Seal it for Thy courts above.&rdquo;"
    }, {
      "category": "",
      "topics": [

      ],
      "ID": "1609",
      "postedDate": "1432212420",
      "title": "My Grandmother&#8217;s Arms - A Call to Confession",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
      "authorThumbnailAltText": "Melissa Church",
      "averageRating": "",
      "authorName": "Melissa Church",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "I have my grandmother&rsquo;s arms. I&rsquo;m not especially pleased about this development. You see, my grandmother was on the&hellip;plump side, and her arms were&hellip;plump&hellip;and flabby and cool. Now they&rsquo;re mine. This morning my husband and I were leaning side by side against the kitchen counter and he reached around me, put his hand against the flabby back of my arm, and sighed. My son does this on occasion as well. They both just seem compelled to touch my arms. I know. It&rsquo;s weird. But I get it.\r\n\r\nMy grandmother was not an affectionate woman. She had little time for it between cooking three huge meals every day of her life, raising six children (and some of their children), quilting, cleaning, working a 2-acre &ldquo;garden&rdquo;, canning, juicing, jellying, plucking chickens, milking cows and all the stuff with which we modern women thankfully have no experience. But sometimes she would sit down in her fancy red velvet rocker and would invite me into her lap. On those rare occasions, I would rest my head on those cool flabby arms and find comfort and peace and security.\r\n\r\nI&rsquo;ve been attending my church&rsquo;s Saturday evening service lately. It has a completely separate identity and personality from the Sunday service. The congregation calls itself &ldquo;Mosaic&rdquo; and their principle is, &ldquo;All are broken. All are welcome. One gets the glory.&rdquo; I like it there. It has the feel of my grandmother&rsquo;s arms. Mosaic is true to Paul&rsquo;s words in 1st Timothy 1:15-17, &ldquo;Here is a trustworthy saying that deserves full acceptance: Christ Jesus came into the world to save sinners--of whom I am the worst. But for that very reason I was shown mercy so that in me, the worst of sinners, Christ Jesus might display his immense patience as an example for those who would believe in him and receive eternal life. Now to the King eternal, immortal, invisible, the only God, be honor and glory for ever and ever. Amen.&rdquo;\r\n\r\nWe all have stuff we don&rsquo;t like about ourselves, like flabby arms, and we do what we can to cover those things when we&rsquo;re in public. You won&rsquo;t likely ever see me wearing a sleeveless shirt. (In fact, I often wonder why all shirtsleeves don&rsquo;t end at the elbow!) But at some point we have to accept that this is the genetic hand we&rsquo;ve been dealt, and no matter how hard we work those triceps, we&rsquo;re just gonna have flabby arms. Doesn&rsquo;t mean we stop working. Doesn&rsquo;t mean we stop wearing longer sleeves. Just means that we know there are limitations to the outcome of our efforts to reverse or hide&nbsp;our condition.\r\n\r\nIn the Church, we are especially bad about pretending that we don&rsquo;t suffer the effects of our DNA. We dress our best when we gather with other believers as if the right clothes, shoes, tie or smile will disguise the fact that we all share the same genetic code: We are sinners. We were born this way. And while your direction of warp may be different from mine, we all have one. I fight the sin of gluttony. Maybe you battle the temptation to gossip. Or you&rsquo;re addicted to prescription drugs. Or you are lustfully tempted by your secretary. Who knows? No one, unless we occasionally roll up our sleeves and let people see the areas we are struggling with, working on, and keeping under wraps - the areas that respond only minimally to self-effort and ultimately have only one solution -&nbsp;Jesus.\r\n\r\nThere are consequences when we refuse to expose our battles against the flesh. Hiding our weaknesses perpetuates the lie that everyone &#39;else&#39; is OK, and it&nbsp;gags those who are screaming for release from their self-imposed cover-up. It prolongs denial, comparison, envy, pride, fear, inferiority, disappointment, and isolation. It delays truth, identification, good-will, humility, courage, security, encouragement, and community. (The devil loves it!)&nbsp; In our pretense, we become an obstruction to God&rsquo;s work in the unsaved, and we steal His glory. Look at Paul&rsquo;s conclusion again in slow motion.\r\n\r\nI was shown mercy. So that. In me. The. Worst. Of. Sinners. Christ Jesus might display His immense patience. As. An. Example. For. Those who would believe in Him and receive eternal life. Glory.\r\n\r\nHow can anyone see the immense patience of God unless they first know just how much patience I require&hellip;and receive? How will anyone know that He is Healer unless I expose my scars? How will anyone believe that they can experience His boundless love unless I first admit to all the ways that I am an undeserving recipient of it? How will anyone come to trust His sufficiency unless I admit to my weaknesses?\r\n\r\nNow, I&rsquo;m not a fan of moping around in our brokenness - I&rsquo;ve already said that we should choose the sleeves that cover the most shame when we&rsquo;re in public - but if I meet you at church and I notice that we share a weakness, I&rsquo;m liable to bare mine to you. Not because I&rsquo;m proud of it, but so that in me, the worst of sinners, Christ Jesus might display His immense patience as an example for you who would believe in Him and be saved. In that way, then, the thing I dislike the most about myself can be redeemed. Then that ugly place in my life becomes a place where you may find a soft cool place to lay your head and find comfort and peace and security. Like my grandmother&rsquo;s arms. Glory. To. God."
    }, {
      "category": "",
      "topics": [{
        "ID": "Witness",
        "topic": "Witness"
      }, {
        "ID": "Evangelism",
        "topic": "Evangelism"
      }],
      "ID": "1350",
      "postedDate": "1431275460",
      "title": "The Accidental Witness",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_2.jpg",
      "authorThumbnailAltText": "Stephen Armstrong",
      "averageRating": "",
      "authorName": "Stephen Armstrong",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "According to my back-of-the-envelope&nbsp;math, the&nbsp;average Christian spends about 1% of waking hours each year in church services (assuming weekly attendance). Throw in a&nbsp;few weekday&nbsp;church events here and there and maybe a mission trip during&nbsp;the summer, and the average Christian still spends less than 5% of each year engaged in formal&nbsp;Christian&nbsp;activities and gatherings. (I suspect for many of us, the actual number is even smaller.)\r\n\r\nMeanwhile, the vast majority of our time is spent in the necessary and predictable activities of everyday life. The Bureau of Labor Statistics collects data on an American&#39;s&nbsp;average work day, and their findings are unsurprising:\r\n\r\n\r\n\r\nWhat I find striking about this chart (apart from the fact that most people seem to get&nbsp;FAR more sleep than I do), is how much time we spend with other people during an average day. According to this estimate, we spend 37% of our time in work-related activities, another 11% in leisure activities&nbsp;and nearly 10% of our day eat, drinking and caring for others. Assuming we aren&#39;t doing these activities alone, the average person spends nearly 60% of every day in the company of other people &ndash; and many of these people do not know Christ.\r\n\r\nThis fact raises an important question: are we putting that time&nbsp;to good use by serving as an ambassador for&nbsp;Christ? Do we practice our Christian lifestyle 24\/7 or only in the presence of other Christians at church or in a home group?&nbsp;Are we \"off-duty\" during the 60% of each day we&#39;re rubbing elbows with the world?&nbsp;If so, then we&#39;re missing our best opportuity to be a witness for the Gospel.\r\n\r\nI&#39;m fond of saying that ministry is what we do between mission trips. That&#39;s my way of pointing out that while Christians will get pumped up at the chance to spread the gospel in some far away, exotic location during one week of the summer, most never witness about Christ to the people they&nbsp;see every day. Obviously, mission trips are important, but they aren&#39;t the only (or even best) way for us&nbsp;to step out as witnesses for Christ.\r\n\r\nAn effective Christian witness begins at home, and it only requires three things: knowledge, relationship, and persistence.\r\n\r\nFirst, we must be knowledgeable of the Gospel, which means knowing WHO and WHAT we are called to represent. Peter says it plainly:\r\n\r\n1Pet. 3:15 &nbsp;but sanctify Christ as Lord in your hearts, always being ready to make a defense to everyone who asks you to give an account for the hope that is in you, yet with gentleness and reverence;&nbsp;\r\n&nbsp;Have you&nbsp;ever spent time&nbsp;preparing for a one-week mission trip (e.g.,&nbsp;learning the culture, practicing an evangelism&nbsp;speech, roleplaying with fellow Christians,&nbsp;praying for a harvest, etc.)? Then you understand how important knowledge and preparation are to the success of your mission. Why prepare any less before&nbsp;talking&nbsp;to&nbsp;your nextdoor neighbor or a coworker about Christ?\r\n\r\nWe must spend time becoming knowledgeable of Christ and the Gospel&nbsp;before we can be an everyday witness&nbsp;to that&nbsp;truth. A teacher can&#39;t teach others until he\/she knows the material first, so a witness for Christ must sanctify Christ in his\/her heart and&nbsp;understand the depths of God&#39;s word before tackling the difficult questions unbelievers&nbsp;ask.\r\n\r\nPrepare everyday for a mission experience at home.&nbsp;Study your&nbsp;Bible until you can explain and&nbsp;defend the Gospel with ease. Be purposeful in your studies, knowing that the days are short and opportunities are fleeting, so we must make the most of every encounter. &nbsp;\r\n\r\nSecondly, we need to establish relationships&nbsp;before we pounce with&nbsp;a call to repent.&nbsp;People know the difference between a&nbsp;sincere appeal and cynical sales pitch, so effective ministry depends on personal relationships. Paul often spent many months living around the people he hoped to influence, because it made his ministry more effective.&nbsp;Concerning his own ministry, Paul said:\r\n\r\n2Cor. 5:11 &nbsp;Therefore, knowing the fear of the Lord, we persuade men, but we are made manifest to God; and I hope that we are made manifest also in your consciences.&nbsp;\r\n&nbsp;Paul understood the arrival of saving faith relies entirely upon the work of the Holy Spirit, nevertheless he says he worked to&nbsp;pursuade&nbsp;men to the truth of the Gospel, while hoping&nbsp;the Lord would make his sincerity and honesty manifest to them. Simply put, Paul&#39;s appeal to the citizens of Corinth was personal. He spent time with them. He loved them, and he spoke from the heart, delivering the truth&nbsp;in a persuasive manner &ndash; yet&nbsp;depending on God to make his message hit home.&nbsp;\r\n\r\nMake it personal. Get to know the people you want to persuade, and relate to them in a sincere way. We have to&nbsp;care&nbsp;about the people we hope to reach.&nbsp;If we see witnessing as a special effort we undertake on rare occasions, then we&#39;re likely to never see much success. Make friends, and you&#39;ll find&nbsp;countless opportunites to represent Christ during the&nbsp;60% of your day spent in the world.\r\n\r\nLastly, we must be persistent in our effort, but persistence doesn&#39;t mean being pushy or overbearing. Persistence in this context means remaining \"on-duty\" at all times. Jesus taught:\r\n\r\nMatt. 5:14 &nbsp;&ldquo;You are the light of the world. A city set on a hill cannot be hidden;\r\nMatt. 5:15&nbsp; nor does anyone light a lamp and put it under a basket, but on the lampstand, and it gives light to all who are in the house.\r\nMatt. 5:16 &ldquo;Let your light shine before men in such a way that they may&nbsp; see your good works, and glorify your Father who is in heaven.\r\n&nbsp;Not every encounter in our day will lead somewhere, but we should live as if every encounter has that potential.&nbsp;Do you desire salvation for&nbsp;the neighbor or coworker you see daily every bit&nbsp;as much&nbsp;as for the orphan in Africa or the shopkeeper in Mexico you meet only once? If so, then remain persistently \"on-duty\" as you spend time with these people.\r\n\r\nThe pattern is simple but powerful. Know your Bible. Make friends.&nbsp;Take&nbsp;every opportunity to testify to the grace of Christ.&nbsp;Live with purpose&nbsp;everyday, and appeal to&nbsp;the Lord to manifest your sincerity to unbelievers. When you live this way, you&#39;re likely to see&nbsp;hearts changed when you least expect it. This&nbsp;is the essence of what Jesus meant in Matthew 5:14-16...being an accidental witness."
    }, {
      "category": "",
      "topics": [{
        "ID": "Word+of+God",
        "topic": "Word of God"
      }, {
        "ID": "Jesus",
        "topic": "Jesus"
      }, {
        "ID": "False+Teachers",
        "topic": "False Teachers"
      }],
      "ID": "1593",
      "postedDate": "1431204300",
      "title": "153 Fishes = I AM G-D?",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_11.jpg",
      "authorThumbnailAltText": "Brady Stephenson",
      "averageRating": "",
      "authorName": "Brady Stephenson",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "A friend recently contacted me and asked about some information he had seen on Facebook:\r\n\r\nFor centuries, people have wondered why the Bible records that 153 fish were caught by the disciples after Jesus told them to throw their nets on the opposite side of the boat in John 21:4-12. As I have mentioned before, EVERYTHING in the Bible is there for a reason. People would have figured out the mystery long ago if they had bothered to learn Hebrew. In Hebrew, every letter has a number attached to it. The Hebrews used their alphabet as a numbering system. The numbers attached to the letters in a Hebrew word could be added together to give a numerical total. The number 153 is the numerical total for the Hebrew words \"Ani Elohim\"--I AM G-D. When Jesus caused the disciples to catch exactly 153 fish, He was declaring to them that not only was He the Son of G-d, but that He was God Himself. Tell your Muslim friends who say that Jesus never claimed to be G-d that yes, He most certainly did!\r\n\r\n&nbsp;\r\n\r\nThe text came with an accompanying graphic showing the calculation of ani elohim totaling 153 similar to this:\r\n\r\n\t\t\t\t\t\t&#1488;\t\t\ta\t\t\t&nbsp;1\t\t\t+\t\t\t&nbsp;\t\t\t\t\t\t\t&#1504;\t\t\tn\t\t\t50\t\t\t+\t\t\t&nbsp;\t\t\t\t\t\t\t&#1497;\t\t\ti\t\t\t10&nbsp;\t\t\t+\t\t\t&nbsp;\t\t\t\t\t\t\t&nbsp;\t\t\t&nbsp;\t\t\t&nbsp;\t\t\t&nbsp;\t\t\t&nbsp;\t\t\t\t\t\t\t&#1488;\t\t\te\t\t\t&nbsp;1\t\t\t+\t\t\t&nbsp;\t\t\t\t\t\t\t&#1500;\t\t\tl\t\t\t30\t\t\t+\t\t\t&nbsp;\t\t\t\t\t\t\t&#1493;\t\t\to\t\t\t&nbsp;6\t\t\t+\t\t\t&nbsp;\t\t\t\t\t\t\t&#1492;\t\t\th\t\t\t&nbsp;5\t\t\t+\t\t\t&nbsp;\t\t\t\t\t\t\t&#1497;\t\t\ti\t\t\t10\t\t\t+\t\t\t&nbsp;\t\t\t\t\t\t\t&#1501;\t\t\tm\t\t\t40\t\t\t+\t\t\t&nbsp;\t\t\t\t\t\t\t&nbsp;\t\t\t&nbsp;\t\t\t&nbsp;\t\t\t&nbsp;=\t\t\t153&nbsp;\t\t\t&nbsp;\r\n\r\nHis question was simple: was this true or not?&nbsp; Here is my response:\r\n\r\n&nbsp;\r\n\r\nGreat question!\r\n\r\nThe answer comes in two points.&nbsp; tldr = \"no\" and \"no\".\r\n\r\n&nbsp;\r\n\r\nPoint Number One\r\n\r\nThe text (above) says \"In Hebrew, every letter has a number atached to it.\" Well... no, it doesn&#39;t [except in later Hebrew texts]. I am not aware of any Scriptural examples of Hebrew letters literally equating to a numeric value. That concept only exists in gematria where the \"hidden\" meanings of words are calculated by means of assigning a value to each letter of a word. It definitely doesn&#39;t work in reverse where you are given a number and find some words that match up with it via gematria. Google \"gematria\" and get an eye full of the origins of that concept. Yikes!\r\n\r\nScripture is full of examples where numbers symbolize concepts:\r\n\r\nTwo symbolizes testimony (\"I call heaven and earth to witness against you\")\r\n\r\nFour symbolizes judgment (the four horns of the altar)\r\n\r\nSix symbolizes flawed humanity (666 in Revelation)\r\n\r\nSeven symbolizes completion (the seven days of Creation), etc\r\n\r\n&nbsp;\r\n\r\nBut this is Scripture connecting a numeric value with an idea. It&#39;s not humans assigning numbers to the letters of a word which calculate into some hidden&nbsp;value which completely means something else.\r\n\r\nAll of the examples of numbers in the Hebrew text that I have seen are actually spelled out labels (like one, two, three) rather than numerals (like 1, 2, 3).\r\n\r\nFor example:\r\n\r\nGenesis 1:16- \"G-d make the two great lights...\" The \"two\" in this case is &#64298;&#1456;&#1504;&#1461;&#1445;&#1497; [shenei] which is clearly not a &#1489; [bet] which has the meaning of 2 in gematria.\r\n\r\nGenesis 7:13- \"... and the three wives of his sons with them...\" The \"three\" in this case is &#64298;&#1456;&#1500;&#1465;&#1447;&#64298;&#1462;&#1514; [sheloshet] which is clearly not a &#1490; [gimmel] (3 in gematria).\r\n\r\nGenesis 2:10- \"...and became four rivers.\" The \"four\" in this is &#64302;&#1512;&#1456;&#64305;&#1464;&#1506;&#1464;&#1445;&#1492; [arbah] which is clearly not a &#1491; [dalet] (4 in gematria).\r\n\r\n&nbsp;\r\n\r\nNow some may object and say \"Oh sure, there are words for single digits but what about larger numbers?\" Let&#39;s turn to the Bible and see...\r\n\r\nGenesis 5:18- \"Jared lived one hundred and sixty-two years...\" If the gematria crowd is correct, we should find &#1511;&#1505;&#1489; [kof, samech, bet = 162] but instead we find &#64298;&#1456;&#64330;&#1463;&#1447;&#1497;&#1460;&#1501; &#1493;&#1456;&#64298;&#1460;&#64300;&#1460;&#1435;&#1497;&#1501; &#64298;&#1464;&#1504;&#1464;&#1430;&#1492; &#64309;&#1502;&#1456;&#64302;&#1443;&#1514; [literally two and sixty years and one hundred].\r\n\r\n&nbsp;\r\n\r\nLet&#39;s go bigger...\r\n\r\nGenesis 20:16- \"... I have given your brother a thousand pieces of silver...\". Thousand here is &#1488;&#1462;&#1444;&#1500;&#1462;&#1507; [elef].\r\n\r\n&nbsp;\r\n\r\nNow let&#39;s go even bigger...\r\n\r\nExodus 12:37- \"Now the sons of Israel journeyed from Rameses to Sucoth, about six hundred thousand men on foot, aside from children.\" Here we find &#64315;&#1456;&#64298;&#1461;&#64298;&#1470;&#1502;&#1461;&#1488;&#1448;&#1493;&#1465;&#1514; &#1488;&#1462;&#1447;&#1500;&#1462;&#1507; [shesh meot elef], literally six hundred thousand.\r\n\r\n&nbsp;\r\n\r\nThe language of the Hebrew Bible is the literal, meaningful Hebrew language... not gematria.\r\n\r\nHebrew scholar, J.K. McKee has an excellent article debunking gematria entitled \"The Effect of Mysticism and Gnosticism on the Messianic Movement\". His conclusion to the article is this:\r\n\r\nThese are some of the very same teachings that are circulating in our midst today. Just as Paul admonished Titus to expose those who are teaching such things as frauds, so must we. We have to have the proper testimony to others that we are Biblically and theologically credible, we must know what the Scriptures say, and above all pray for wisdom and discernment in all that we do.\r\n\r\n&nbsp;\r\n\r\nPoint Number Two\r\n\r\nThere is no place [all caps, large font, bold, italics, underline, red, with blinking, flashing lights and dancing bananas... I mean NO PLACE] in Scripture where G-d declares \"I am G-d\" that the Hebrew text reads &#1488;&#1504;&#1497; &#1488;&#1500;&#1493;&#1492;&#1497;&#1501; [ani elohim].\r\n\r\nInstead we find:\r\n\r\n&#1488;&#1461;&#1500;&#1464;&#1497;&#1493;&#1433; &#1488;&#1458;&#1504;&#1460;&#1497;&#1470;&#1488;&#1461;&#1443;&#1500; &#64298;&#1463;&#64307;&#1463;&#1428;&#1497;\r\n[elai ani El Shaddai... I am G-d Almighty- Genesis 17:1]\r\n\r\n&#1488;&#1458;&#1504;&#1460;&#1448;&#1497; &#1488;&#1461;&#1444;&#1500; &#64298;&#1463;&#64307;&#1463;&#1497;&#1433;\r\n[ani El Shaddai... I am G-d Alighty- Genesis 35:11]\r\n\r\n&#64303;&#1504;&#1465;&#1499;&#1460;&#1445;&#1497; &#1492;&#1464;&#1488;&#1461;&#1430;&#1500; &#1488;&#1457;&#1500;&#1465;&#1492;&#1461;&#1443;&#1497; &#64303;&#1489;&#1460;&#1425;&#1497;&#1498;&#1464;\r\n[anoki haEl elohei avika... I am G-d, the G-d of your father- Genesis 46:3]\r\n\r\n&#64303;&#1504;&#1465;&#1499;&#1460;&#1443;&#1497; &#1488;&#1457;&#1500;&#1465;&#1492;&#1460;&#1425;&#1497;&#1501;\r\n[anoki elohim... I am G-d- Psalm 46:10]\r\n\r\n&#1488;&#1457;&#1500;&#1465;&#1492;&#1460;&#1430;&#1497;&#1501; &#1488;&#1457;&#1500;&#1465;&#1492;&#1462;&#1443;&#1497;&#1498;&#1464;\r\n[elohim eloheika... I am G-d, your G-d- Psalm 50:7]\r\n\r\n&#1488;&#1458;&#1504;&#1460;&#1497;&#1470;&#1488;&#1461;&#1469;&#1500;\r\n[ani El... I am G-d- Isaiah 45:22]\r\n\r\n&#64303;&#1504;&#1465;&#1499;&#1460;&#1445;&#1497; &#1488;&#1461;&#1500;\r\n[anoki El... I am G-d- Isaiah 46:9]\r\n\r\n&#1488;&#1461;&#1444;&#1500; &#64303;&#1469;&#1504;&#1465;&#1499;&#1460;&#1497;&#1433;\r\n[El anoki... G-d I am- Hosea 11:9]\r\n\r\n&nbsp;\r\n\r\nThe graphic [from the original article] references Torah portion Acharei Mot\/Kedoshim [two of the weekly passages from the books of Moses that are read in synagogues each week] but the only instances of the Hebrew word elohim in Acharei Mot (Leviticus 16:1-18:30) and Kedoshim (Leviticus 19:1-20:27) are &#1488;&#1457;&#1500;&#1465;&#1492;&#1461;&#1497;&#1499;&#1462;&#1469;&#1501; [eloheikem&nbsp;- \"your G-d\"] in the second person possessive.\r\n\r\nBut then ani eloheikem wouldn&#39;t calculate to 153 would it? \r\n\r\nJohn 21 (where the 153 fishes are found) isn&#39;t even in parashah Acharei Mot or Kedoshim according to TorahPortions.org or Psalm11918.org so the whole thing seems made up!\r\n\r\n&nbsp;\r\n\r\nNow... what about the 153 in John 21:11?\r\n\r\nThe folks at one website found Cyrille of Alexandria saw 153 as the symbol of G-d and the Church.\r\n\r\nThe guys at another website found that BOTH benei elohim [sons of G-d] and the Greek word for fishes calculate out to 153!\r\n\r\nThe peeps at yet a third website found all kinds of associations with 153 which weren&#39;t ani elohim or fishes.\r\n\r\n&nbsp;\r\n\r\nOh, by the way... the last letter of ani elohim is not a &#1502; [mem], it is &#1501; [mem-sophit - the form of a letter used when ending a word].&nbsp; Mem-sophit doesn&#39;t doesn&#39;t equal 40, it equals 600, so the correct gematria of ani elohim = 713!\r\n\r\nHumans are great at pattern matching and we find patterns in almost everything. The question isn&#39;t \"what patterns can we find in the Bible that tickles our brains?\"&nbsp;The question is \"what is the message sent by the Message Giver?\"&nbsp;Answering that question requires discipline, study, and the work of the Holy Spirit... not gematria.\r\n\r\n... but what do I know about it?&nbsp;;)\r\n\r\n&nbsp;\r\n\r\nShabbat shalom!\r\n\r\n&lt;&gt;&lt;\r\n\r\n&nbsp;\r\n\r\nBrady on Google Plus"
    }, {
      "category": "",
      "topics": [

      ],
      "ID": "1570",
      "postedDate": "1429132440",
      "title": "Be Quiet and Be Quiet",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
      "authorThumbnailAltText": "Melissa Church",
      "averageRating": "",
      "authorName": "Melissa Church",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "~~Does your local Christian radio station do these random acts of kindness days where you pay for the guy behind you in the drive-through and then you call in to tell about it?? Yeah. I hate those things. Is there anything less random than that? Is there anything more boastful? &ldquo;Hello. Yes, I just did a really nice thing for the people in the car behind me. Aren&rsquo;t I special? Please praise my generosity on your radio broadcast.&rdquo; One blogger and best-selling author that I (used to) follow, quietly bought dinner in her local restaurant for a huge family, then shot a selfie showing them at the table behind her and posted it on Facebook. Ugh. We really do this. (And why we do not call this out for the sin it is, is beyond me!)\r\n\r\nThis is one of those posts I have debated for days. To write or not to write, that has been the question. I&rsquo;ve sung this song before, first verse, second verse, and chorus. But it&rsquo;s an issue that continues to perplex me, and because the song is on a continuous loop in my head, it&rsquo;s one that I&rsquo;m sure I&rsquo;m not seeing clearly. You let me know.\r\n\r\nI&rsquo;m going to confuse the issue even more by trying to grab hold of those wisps of thoughts that just brush across your mind like a hair across your face, tickling and unspecific, but irksome anyway in their connectedness. Can you bear with me while I try to catch the strands and make sense of them?\r\n\r\nFirst, I&rsquo;m in the middle of a short but intensive look at the Tabernacle. You know, the worship center the Israelites carried on their backs for 40 years in the desert? What struck me most in my study yesterday was something Pastor Armstrong says in the second part of his Tabernacle teaching from Exodus 27\/28. I&rsquo;ll put it in my own less-eloquent words. It was ugly on the outside. Or at least it was very plain. But the inside! Whoa! The inside was nothing less than resplendent as far as tents go. Pastor Armstrong reminded us that this is a shadow of our Savior (as is the whole Tabernacle). It made me wonder as I tried to apply those two truths to a New Testament lesson if maybe on the outside we should be plain, but on the inside, we should be stunning! And I&rsquo;m not talking biology. Nothing we can do with that hand if we&rsquo;re dealt the ugly card. I&rsquo;m talking about &ldquo;the show&rdquo;; the performance we put on for man, forgetting entirely about the one that God is watching.\r\n\r\nSo there&rsquo;s that whole thing. Then there&rsquo;s this. There is a new movement among young Christian women right now that I call (with all due respect, as I cautiously watch from a distance!) the movement of discontent. Here is a quote from an attendee at their latest national gathering: \"I hear enough people telling me how to be a good Christian mom. I don&#39;t need that,\" \"This is a call for revival and unity, and it lined up with what&#39;s in my heart right now.\"(Huffington) I wonder then if she&rsquo;s as good a &ldquo;Christian mom&rdquo; as she can be? I wonder if what&rsquo;s in her heart aligns with God&rsquo;s heart? I wonder if she has forsaken her ministry at home for a &ldquo;spiritual calling&rdquo; that&rsquo;s just a tad more glamourous and exciting than the one that she is already in the midst of. And I&rsquo;m wondering if the leaders of this movement aren&rsquo;t fanning the flames of her discontent? I&rsquo;m just wondering.\r\n\r\nLast night a friend copied me a link that she &ldquo;knew would get me riled up&rdquo;. (Gotta love friends that will poke the bear with a stick.) One of the local mega-churches is hosting the tour of a speaker who has gained international attention in recent years for his breakout book on radical service (naming no names!). The marketing material calls this a gathering that &ldquo;challenges you to leverage your life in a way that counts for the kingdom.&rdquo; And claims a &ldquo;God-sized vision&rdquo; that &ldquo;awakens and empowers you to know that your life on mission matters.&rdquo; My life on mission matters. My life on mission counts for the kingdom. Apparently, I&rsquo;ve been asleep all this time and powerless to do anything worthwhile. Maybe that&rsquo;s carrying it a bit too far, but I&rsquo;m really thinking not (having read the book).\r\n\r\nFinally, a bit closer to home, I&rsquo;m reminded of a friend who left her church recently because she felt that the work she was doing for them was going unappreciated. She admittedly misses her church family there, but refuses to go back. She won&rsquo;t call that pride. She won&rsquo;t call it sin. She just keeps looking for a church that will give her props.&nbsp;\r\n\r\nYou know what? I know that we&rsquo;re supposed to do good things. I know James says that faith without works is no faith at all. I know that. I get that. But I also know a barrage of other scripture too like when Jesus says, &ldquo;Be careful not to practice your righteousness in front of others to be seen by them. If you do, you will have no reward from your Father in heaven. So when you give to the needy, do not announce it with trumpets, as the hypocrites do in the synagogues and on the streets, to be honored by others. Truly I tell you, they have received their reward in full. But when you give to the needy, do not let your left hand know what your right hand is doing, so that your giving may be in secret. Then your Father, who sees what is done in secret, will reward you.&rdquo; (Matthew 6:1-4) I&rsquo;m guessing that eliminates radio broadcasts too.\r\n\r\nI also remember Paul writing about the difference between trying to please man and God (in serving the Gospel) and about working with integrity when no one is watching, knowing that we work for God and not for man.\r\n\r\nI remember too that Paul tells Timothy to teach &ldquo;sound doctrine&rdquo; (this one is gonna really get your hackles up), and goes on to say that sound doctrine includes teaching &ldquo;&hellip;the older women to be reverent in the way they live, not to be slanderers or addicted to much wine, but to teach what is good. Then they can urge the younger women to love their husbands and children, to be self-controlled and pure, to be busy at home, to be kind, and to be subject to their husbands, so that no one will malign the word of God.&rdquo; (Titus 2) I guess you could call this being a good &ldquo;Christian mom&rdquo;, and I don&rsquo;t know about any of you, but I&rsquo;m not there yet!!!\r\n\r\nAnd I guess therein is my complaint. Why is somewhere else so much better than here? Why doesn&rsquo;t my mission at home count for the kingdom? If I focus on quietly serving my family and community, does that mean I haven&rsquo;t leveraged my life effectively? If I am about my Father&rsquo;s work of learning &ndash; struggling &ndash; to be obedient to His word at home, will I find a community out there that lines up with my heart? Not today, I won&rsquo;t. They&rsquo;re all too busy looking for their own &ldquo;God-sized&rdquo; vision and convincing the rest of us that we don&rsquo;t matter unless we get on board and start punching our card! Or they&rsquo;re waiting on hold for the radio host to answer their call so they can trumpet their good-deeding for the day.&nbsp;\r\n\r\nHere&rsquo;s my response. GO! Be on mission somewhere else! Take others with you and post it on social media! But don&rsquo;t forget that we already have callings on our lives, and they are our first priority. We already have one Master, and He is our first stop for affirmation. Anyone can get on a plane and fly to Guatemala for a week of rocking babies in orphanages. Not everyone can do the work of serving God faithfully, obediently, day in and day out in quiet obscurity. That, my friends, is a God-sized mission the likes of which we rarely see (um&hellip;because it&rsquo;s done in quiet obscurity mostly).\r\n\r\nGod has not called all of us to what the world would&nbsp;characterize as&nbsp;a &ldquo;God-sized&rdquo; mission, even though the work of sanctification couldn&rsquo;t be called anything less. Even though raising the next generation of faithful men and women is tantamount to a miracle. Even though remaining in a committed marriage is an aberration even in the church. Even though integrity in the workplace is surprising. Even though the level of Biblical literacy in our churches is embarrassingly shallow and misinformed. Even though the evidence of&nbsp;unrepentant sin is on display in our ever-expanding waistbands. Even though all that&hellip;we don&rsquo;t call that work a God-sized mission that leverages our life for the kingdom. That work, apparently is the slumber from which we should awaken.\r\n\r\nSome are asking, essentially, what if God is real? (Um&hellip; &ldquo;if&rdquo;?!) Then what? Well, then He expects us to start doing what He told us to do where we are with what we have, not to be looking somewhere else for something better.(Who do you think put you where you are, anyway?) Maybe I have a cynical view of the Body of Christ (nahhhhhh&hellip;.) but in my limited experience, the average pew-sitter knows so very little of what God wants from them every day. There is zero accountability for sin. Shoot. In my experience, most believers aren&rsquo;t even aware of their own sins enough to name them. We advertise our good works all day long on every forum of social media available to us&hellip;yes, we know what garners praise&hellip;but we don&rsquo;t really want to be reminded that we didn&rsquo;t need to be in that drive-through lane to begin with.\r\n\r\nI&rsquo;m digressing. I guess what it all boils down to for me is this. We need to clean up our own yard before we move on to our neighbors&rsquo;. What good are we doing in Guatemala rocking babies, when our own teenager is at home hanging himself in his closet? Are you really done hearing about how to be a good &ldquo;Christian mom&rdquo;? A good wife. A good friend. A good employee, citizen, church-member, tax payer, volunteer. Have you got all that figured out, checked the box, and booked a flight to elsewhere? If you have, well, good for you. But could you go quietly about your business and let the rest of us get there in our own time&hellip;in God&rsquo;s time&hellip;without you breathing down our necks and good-deeding us to nausea on our local Christian radio station while we&rsquo;re driving carpool? We&rsquo;re trying to do this thing. Same as you. Only quieter.\r\n\r\nI really got worked up there at the end. I hope I haven&rsquo;t offended. But I am unapologetic if it opens a dialogue between you and God about what counts for the kingdom. It&rsquo;s His kingdom, you know, not ours. Maybe it&rsquo;s time for us to sit down with His book instead of everyone else&rsquo;s and let Him tell us what He thinks we need to be doing and then get to work quietly doing that. There won&rsquo;t be trumpets, confetti, or a parade at the end, but I&rsquo;m pretty sure that our effort will please the One who matters even if&nbsp;we can&rsquo;t write a book about it later."
    }, {
      "category": "",
      "topics": [{
        "ID": "Election",
        "topic": "Election"
      }, {
        "ID": "Tribulation",
        "topic": "Tribulation"
      }, {
        "ID": "Paul",
        "topic": "Paul"
      }],
      "ID": "1562",
      "postedDate": "1427582820",
      "title": "Completely Victorious",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_11.jpg",
      "authorThumbnailAltText": "Brady Stephenson",
      "averageRating": "",
      "authorName": "Brady Stephenson",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "Steve recently wrote about the Four Blood Moons and how they mean the Tribulation is approaching but not necessarily imminent. Several friends have expressed concern about the Tribulation, the spread of Islamism, the state of the economy,&nbsp;and how these things may potentially impact them and their families. Steve covers the Tribulation in great detail as part of his Revelation study so I won&#39;t revisit the subject but I did want to share some words of encouragement to any who might be worried about these things or any other circumstance in their lives.\r\n\r\nI can&rsquo;t claim credit for this. It was written by a brilliant Jewish scholar in the first century:\r\n\r\nIf G-d is for us, who can be against us? He who did not spare even His own son, but gave even him up on behalf of us all. Is it possible that, having given us His son, that He would not give us everything else, too?\r\n\r\nSo who will bring a charge against G-d&rsquo;s chosen people? \r\nCertainly not G-d! He is the one who causes them to be considered righteous!\r\n\r\nWho will punish them? \r\nCertainly not the Messiah Yeshua [Jesus], who died and &mdash; more than that &mdash; has been raised, is at the right hand of G-d and is actually pleading on our behalf!\r\n\r\nWho will separate them from the love of the Messiah? Will Tribulation? Hardship? Persecution? Hunger? Poverty? Danger? War? \r\nAs the Tanakh [the Hebrew name of the Old Testament] puts it: For your sake we are being put to death all day long, we are considered sheep to be slaughtered. [Psalm 44:22]\r\n\r\nNo, in all of these things we are [present tense] completely victorious through the One who has loved us. For I am convinced that neither death nor life, neither angels nor other heavenly rulers, neither what exists nor what is coming, neither powers above nor powers below, nor any other created thing will be able to separate us from the love of G-d which comes to us through the Messiah Yeshua, our Master.\r\n\r\n&nbsp;\r\n\r\nThat brilliant Jewish scholar was the man we know as Paul and the words above are from Romans chapter 8:31-39. In any and every circumstance where we find ourselves we should know that we are victorious in Messiah! Although we might not see the evidence of that victory at this exact moment, G-d sees all things and has declared it to be true and I take Him at His Word.\r\n\r\nEvery Sabbath day, the people of Israel recite certain passages of Scripture to remind themselves of G-d&#39;s promises towards them:\r\n\r\nDo not fear sudden terror, or the holocaust of the wicked when it comes. [Proverbs 3:25] Plan a conspiracy and it will be annulled; speak your piece and it shall not stand, for G-d is with us. [Isaiah 8:10] Even till your seniority, I remain unchanged; and even till your ripe old age, I shall endure.&nbsp; I created you and I shall bear you; I shall endure and rescue.&nbsp; [Isaiah 46:4]\r\n\r\n&nbsp;\r\n\r\nI&rsquo;ll finish with the words of another great Jew, Joshua, after the LORD enabled Israel to defeat her enemies:\r\n\r\nDo not fear or be dismayed! Be strong and courageous, for thus the LORD will do to all your enemies with whom you fight! (Joshua 10:25)\r\n\r\n&nbsp;\r\n\r\nShabbat shalom!\r\n\r\n&lt;&gt;&lt;\r\n\r\n&nbsp;\r\n\r\nBrady on Google Plus"
    }, {
      "category": "",
      "topics": [

      ],
      "ID": "1559",
      "postedDate": "1427140080",
      "title": "A Very Touchy Subject",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
      "authorThumbnailAltText": "Melissa Church",
      "averageRating": "",
      "authorName": "Melissa Church",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "~~This is a conversation I can&rsquo;t have in my very Republican, very conservative household. I wonder&hellip;can I have it here? Are you open-minded? Can we ask some questions, agree to pray and think and reason together without political borders limiting our Christian practice? I wonder. Here goes.\r\n\r\nA bit of background. I live in Springdale, Arkansas. If you check the Wiki page for our fair city, you will learn that 35% of our population is Hispanic, and 22% are &ldquo;Pacific Islanders&rdquo;. (Read up a bit on the tragic story of the Marshall Islands and how the US Government &ldquo;compensated&rdquo; the Island natives and you will understand. Nationwide, we have the largest population of that displaced people living among us thanks to some anthropological study done by the University of Arkansas some years ago.) I say all that so that you will understand that this topic is something I live with. It is next door to me. It is in my son&rsquo;s school. It is in my grocery store, my help-wanted ads, my doctor&rsquo;s office, my home. It is the life-breath of my small community. It is not some far-flung problem for someone &ldquo;else&rdquo;. It is not something I&rsquo;ve made judgments about from a distance. It is an on-going conversation in my soul about people &ndash; real people &ndash; that I live with every day. It&rsquo;s personal.\r\n&nbsp;\r\nA friend of mine posted something today on Facebook that troubled me. This is someone I respect immensely both as a human being, and as a Christian. A pillar of faith. The post was essentially recognizing the hypocrisy and injustice of a government that provides illegal immigrants with health insurance that is paid for by legal citizens. This is a weighty and complicated matter, but at its root, I believe, is that very American &ldquo;give-me-liberty-or-give-me-death&rdquo; mentality. We simply don&rsquo;t want to be forced to do anything. I&rsquo;m offering no solutions here to the political problem, and if you&rsquo;re looking for a debate, you won&rsquo;t get one from me. I&rsquo;m firmly straddling the fence looking both directions. However&hellip; when I have my Christian glasses on, I tend to see things very differently from when I&rsquo;m looking through my &ldquo;American&rdquo;, &ldquo;First-World&rdquo;, &ldquo;entitled&rdquo;, &ldquo;white Anglo- Saxon&rdquo; glasses. That tends to be the default view in these conversations. The whole issue rests on principle &ndash; you know, &ldquo;it&rsquo;s the principle of the thing&rdquo;. But we still see those principles through American, first-world, entitled, Anglo-Saxon glasses.\r\n\r\nSo this morning, I took off the glasses that make me feel indignant and self-righteous when I think of this problem, and I thought about Jesus. I&rsquo;m asking myself some questions. I&rsquo;m asking myself if Jesus cares about the physical (IMAGINARY) boarders between countries that represent nothing more than human conquest, or if he cares about the people on either side of the line. I&rsquo;m asking if he cares about &ldquo;principle&rdquo; or if he cares about who dies because we stand so firmly entrenched on it that we stop seeing people! I&rsquo;m asking myself a lot of things.\r\n\r\nHere&rsquo;s one. I wonder, when the thief on the cross came to heaven&rsquo;s gate if God asked him how he got there? Did he tell the man that he hadn&rsquo;t come through the proper channels? I mean, he never attended church, never tithed, and for heaven&rsquo;s sake, he couldn&rsquo;t even speak the language (that blessing is his for sure!), how could he possibly expect to benefit from the blessings of heaven? I mean, it&rsquo;s the principle of the thing!\r\n\r\nI wonder if giving insurance (or public education, or honest work, or food and housing assistance) to &ldquo;illegal aliens&rdquo; is what Jesus had in mind when he encouraged us to walk the extra mile, turn the other cheek, give our coat in addition to our shirt? In fact, I wonder if this was what He was thinking about through his whole Sermon discourse. &ldquo;Give to the one who asks you&hellip;&rdquo; &ldquo;You are the light of the world&hellip;&rdquo; &ldquo;Blessed are the merciful&hellip;&rdquo; &ldquo;Do not store up for yourselves treasure on earth&hellip;&rdquo;&nbsp; What if this is what He meant?\r\n\r\nI wonder if this is what He wanted us to understand when He told the story about the Good Samaritan. I wonder if He wanted us actually to be like that. I wonder what our answer will be when we stand at heaven&rsquo;s gate ourselves and He asks what we did with &ldquo;the least of these&rdquo;. I wonder if our principles will matter to Him then. I wonder if we will suddenly realize that all we had was ours only by His grace and was always His to use to bless the people we counted unworthy. I wonder how much treasure we will have forfeited there while we withheld those blessings here. I wonder if we will see things then less as Americans, and more as human beings sharing the planet under the same rain, sun, and blessings of God as every other human being. I wonder what that perspective will do to our entitlement. I wonder if then right will be right regardless of race, color, or immigration status. And if wrong will be wrong even when a Christian is doing it?\r\n\r\nYou know, it has always bothered me this trend in the evangelical church to dream big dreams about reaching exotic lands with the gospel of Christ, but never more than now. The poor are among us. But we don&rsquo;t like them. We don&rsquo;t want to serve them. We don&rsquo;t want to share with them from our abundance (which is maybe why the government has to force us to do it anyway!). We have judged them unworthy because they have not followed the rules. We would deny human beings&hellip;God&rsquo;s creation&hellip;the very basic levels of care because of &ldquo;principles&rdquo; based on the happy accident of our geography and the unhappy accident of theirs, and we would watch them DIE. AT. OUR. GATE. while we stand with our arms crossed demanding to know their status. We would be content to enjoy the blessings God has freely given us, and never consider sharing with a family in need who have violated our principles. And we do not even flinch in shame over it while we&rsquo;re buying our &ldquo;mission trip&rdquo; tickets to Africa. We spit in our neighbors&#39; eye by allowing their children to go to our schools&nbsp;hungry and&nbsp;barefoot&hellip;but we will travel across the world to serve more &ldquo;worthy&rdquo; people in need. Blessed assurance! Have mercy on us Lord! I hope you&rsquo;re blushing. If not, you might want to spend some time with Jeremiah, or you might want to consider one of God&rsquo;s reasons for condemning Sodom.&nbsp; &ldquo;Now this was the sin of your sister Sodom: She and her daughters were arrogant, overfed and unconcerned; they did not help the poor and needy.&rdquo; (Ezekiel 16:49)\r\n&nbsp;\r\nSo this is where I leave the conversation. In an instant, I&rsquo;ll be back wearing my political glasses and looking at things from my very entitled perspective astride this fence, tightly gripping my wallet in one hand and my flag in the other. The next financial aid meeting for Spanish speakers only that is held at my local public High School will likely tip me to the other side. The next scholarship I&nbsp;stumble across&nbsp;that is specifically for &ldquo;undocumented students&rdquo; will push me over the fence. And this is why this internal conversation is on-going for me. I have to choose whether I will suffer injustice for the sake of Christ and my fellow man, or not. It&rsquo;s really that simple. Jesus told us to weigh the cost. But ultimately the cost was his, and because He was willing to pay it (and didn&rsquo;t have to be forced to do so), we get to live on His dole forever. We get to move from a land that is not our own to a land that He will give us&hellip;no passport required, no green card necessary&hellip; so&hellip;go figure."
    }, {
      "category": "",
      "topics": [{
        "ID": "Faith",
        "topic": "Faith"
      }, {
        "ID": "Sin",
        "topic": "Sin"
      }],
      "ID": "1549",
      "postedDate": "1426465380",
      "title": "There Are No Atheists",
      "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_13.jpg",
      "authorThumbnailAltText": "Brian Smith",
      "averageRating": "",
      "authorName": "Brian Smith",
      "description": "",
      "articleThumbnailSource": "",
      "articleThumbnailAltText": "",
      "body": "For some reason, I&rsquo;ve recently been thinking about atheists.&nbsp; One online atheist I came across had a picture of a baby with a caption that read, &ldquo;We are all born atheists until someone starts telling us lies.&rdquo;&nbsp; Is this true?&nbsp; Do we only come to a belief in God (or gods) if someone tells us this?&nbsp; (Of course, this begs the question of who told the first people about God, but I digress.)&nbsp; Or, do we have an innate belief in God?&nbsp; In other words, does God make sure everyone knows He exists?\r\n\r\nThankfully, Scripture clearly addresses this.&nbsp; Romans 1 says, &ldquo;18 For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men who suppress the truth in unrighteousness, 19 because that which is known about God is evident within them; for God made it evident to them. 20 For since the creation of the world His invisible attributes, His eternal power and divine nature, have been clearly seen, being understood through what has been made, so that they are without excuse. 21 For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened. 22 Professing to be wise, they became fools, 23 and exchanged the glory of the incorruptible God for an image in the form of corruptible man and of birds and four-footed animals and crawling creatures.&nbsp; 24 Therefore God gave them over in the lusts of their hearts to impurity, so that their bodies would be dishonored among them. 25 For they exchanged the truth of God for a lie, and worshiped and served the creature rather than the Creator, who is blessed forever. Amen.&rdquo;\r\n\r\nIn particular, notice vs. 19-20.&nbsp; God has made it evident to them.&nbsp; The word evident is phaneroo, which means to make known, to declare, to make visible that which is hidden.&nbsp; What did God make evident?&nbsp; That which is known about God:&nbsp; His invisible attributes, His eternal power and divine nature.&nbsp; How did He make it evident?&nbsp; By His creation.&nbsp; Psalm 19 puts it this way:&nbsp; &ldquo;1 The heavens are telling of the glory of God; And their expanse is declaring the work of His hands.&nbsp; 2 Day to day pours forth speech, And night to night reveals knowledge.&nbsp; 3 There is no speech, nor are there words; Their voice is not heard.&nbsp; 4 Their line has gone out through all the earth, And their utterances to the end of the world.&rdquo;&nbsp; Again, notice that this is made evident without speech, without words.&nbsp; Thus, as Paul says in v. 20 above, God makes Himself known by what He has made, so that all are without excuse.&nbsp; Therefore, at judgment day, no one can say, &ldquo;If only I had known you existed God, I would have believed in you.&rdquo;&nbsp; Quite the contrary, everyone knows He exists.\r\n\r\nRomans 2 also indirectly demonstrates our knowledge of God.&nbsp; &ldquo;14 For when Gentiles who do not have the Law do instinctively the things of the Law, these, not having the Law, are a law to themselves, 15 in that they show the work of the Law written in their hearts, their conscience bearing witness and their thoughts alternately accusing or else defending them, 16 on the day when, according to my gospel, God will judge the secrets of men through Christ Jesus.&rdquo;&nbsp; Everyone has a conscience that tells us right and wrong.&nbsp; There can only be universal right and wrong if there is an absolute giver of morality, and that person is God.&nbsp; Therefore, the fact that everyone has a conscience and naturally knows right from wrong testifies to the existence of God.\r\n\r\nMany people who say they are atheists will say those who believe in God are stupid, or foolish.&nbsp; Ironically, Scripture says they are the fools.&nbsp; Professing to be wise they became fools.&nbsp; They exchanged the truth of God for a lie.&nbsp; Their foolish hearts were darkened.&nbsp; Indeed, Psalm 14:1 says, &ldquo;The fool has said in his heart, &ldquo;There is no God.&rdquo;&rdquo;\r\n\r\nSo, when you speak to someone who says he&rsquo;s an atheist, he is 1) lying, and 2) a fool.&nbsp; He is like a person who says he doesn&rsquo;t believe in gravity.&nbsp; He sees how it works, he experiences its effects, but denies it exists.&nbsp; Truly, such a person is a fool.\r\n\r\nHow do we as Christians answer the atheist?&nbsp; I have come to the conclusion that we simply tell them that they really do believe that God exists, because the Bible says they do.&nbsp; Even though they may deny it, they know in their heart that they do believe it.&nbsp; In other words, there really are no atheists.&nbsp; We tell them that they are suppressing this truth in unrighteousness, just as Scripture says.&nbsp; They may call you names, mock you, and hate you, all because you are telling them the truth.&nbsp; Most importantly, we give them the gospel.&nbsp; We should never think we are better, because God tells us &ldquo;Such were some of you; but you were washed, but you were sanctified, but you were justified in the name of the Lord Jesus Christ and in the Spirit of our God.&rdquo; (1 Corinthians 6:11)&nbsp; May the Lord grant the atheists we meet the same grace He has given us."
    }]
  }
}
