{
    "articles": [
                 {
                 "category": "",
                 "topics": [],
                 "ID": "2093",
                 "summary": "<p>I am a very practical person. I do not believe in randomness, or coincidence. I believe that God is sovereignly in control of all things. All things. All the time. And so, I have the habit of looking for the lesson in anything He allows me to experience. This time, I could not find it. Knowing that physical pain is just a consequence of living in a fallen creation makes it hard to redeem it for any spiritual purpose, I thought. Having not been tested in this way before, I could not make sense of it</p>",
                 "postedDate": 1493764980,
                 "title": "Let Me Walk In It",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/let-me-walk-in-it",
                 "body": "<p>~~The month of April 2017 has virtually disappeared for me and will remain a blank page in my calendar for all time. I began the month with a physical ailment that progressed to the point of needing a minor surgical procedure to address it. While I am attempting to keep it all in perspective, I can assure you that physically, it has been the most painful experience of my life, and has revealed a serious flaw in my spiritual life. Perhaps &ndash; I&rsquo;m believing it &ndash; that was the point of the pain.</p>\n\n<p>I am a very practical person. I do not believe in randomness, or coincidence. I believe that God is sovereignly in control of all things. All things. All the time. And so, I have the habit of looking for the lesson in anything He allows me to experience. This time, I could not find it. Knowing that physical pain is just a consequence of living in a fallen creation makes it hard to redeem it for any spiritual purpose, I thought. Having not been tested in this way before, I could not make sense of it. I felt as if Jesus was standing in a corner of the room with His arms crossed watching me struggle, and doing nothing to help. It felt like the most personal kind of betrayal. I had done nothing to bring this on myself. I had nothing in this from which to confess and repent. It was just&hellip; random, pointless suffering. And to be perfectly honest, the pain was blinding to the point that I could not reason, could not think, could not run to the Word for guidance. I was literally at the end of my ability to cope. All I could do was beg Him to help me. But He didn&rsquo;t. Not in the way I wanted Him to, and that was my error.</p>\n\n<p>When I could see through the post-surgical Vicodin haze, my questions then became something along the lines of who I believe Him to be. What do I really believe about my Savior? What have I failed to believe? What did I need Him to be that He wasn&rsquo;t? Is it enough that he is &ldquo;there&rdquo; in the valley of the shadow if He does nothing? Did He really betray me&hellip; or did my own lack of understanding? Who is this God, anyway, and what has He <em><strong>really</strong></em> promised me&hellip;and is that really, truly, enough when it is all I have but I don&rsquo;t think I can survive another minute without more?</p>\n\n<p>The Body has been faithful to listen to my heart and guide me to some hard answers. You know those hard answers? One sister in Christ gently asked me if I am faithful to remember every way God had blessed me leading up to that moment, and pointed out that it was unfair of me to call Him unfaithful when it was I who had forgotten &ldquo;all His benefits&rdquo; in my usually comfortable life. She also pointed out all the ways He had been faithful<em><strong> through </strong></em>the process, even though immediate healing was not in His plan. Another sister asked me if I had <em><strong>let</strong></em> Him help me, citing my typically capable, independent, self-reliant character (she was kind enough not to call it sin). They collectively challenged my perception of God&rsquo;s love, what I believe to be &ldquo;good&rdquo;, what I believe to be a parent&rsquo;s responsibility to their child, and what I have believed God has promised to His children. It has been a little overwhelming.</p>\n\n<p>Here&rsquo;s the small moment of clarity I&rsquo;ve gleaned in hindsight. Let me start by telling you that the surgical experience has been one of the best health-care experiences I have ever had. These people! I don&rsquo;t even have words. Having never seen me before as a patient for consult or anything else, they worked me in to the front of the surgeon&rsquo;s schedule &ndash; not the back, the front. When he saw my condition, he expressed heartfelt sympathy. He sighed heavily as he explained what he would have to do to begin the process of healing, and then immediately set about the process - with a waiting room full of people who had long-standing appointments. I was there over an hour. He never once made me feel rushed, or like an imposition. When he began his work, the surgeon&rsquo;s nurse held my hand, stroked my arm, and talked to me as a distraction. She noticed that I was not breathing and reminded me to. She was sympathetic and understood my pain and my poor attempt to joke my way through it. The surgeon meanwhile, apologized every single time he had to do something he knew would hurt. Every. Time. And I was so grateful that <em><strong>this</strong></em> pain would be productive that I did not even care. I had suffered the random pain of disease for two weeks with no relief. At least this pain would bring healing.</p>\n\n<p>Here&rsquo;s the moment of clarity I promised. God is the surgeon. Jesus and the Holy Spirt are the nurse. My God was not standing idly by with His arms crossed refusing to help me. <u><em><strong>This was the help</strong></em></u>. This was the pain that would lead to healing my broken understanding of who He is, and who I am, and who we are together. And (in hindsight) I am so grateful to have the disease exposed so healing can come. I do not want to meet Him with anything but a right understanding of His character, and our relationship. I want to <em><strong>know</strong></em> Him. If this is the way, let me walk in it.</p>\n\n<p>I haven&rsquo;t answered all those questions I mentioned (and more), but at least I&rsquo;m asking them. I didn&rsquo;t even know I needed to before now. I&rsquo;m working on it. <em><strong>We</strong></em> are working on it together. In fact, let me belabor the comparison in the hope that in your next moment of pain it will be helpful to you. Through this surgical experience, I&rsquo;ve learned that:</p>\n\n<p>Just as the surgeon made time for me, God always has time for me at the front of His schedule. No waiting required. Psalm 34:15-17, 1 Peter 5:7</p>\n\n<p>Just as the surgeon sympathized, and regretted my pain, but was willing to do the procedure in order to bring me relief, God sympathizes with my disease and longs to cure it, not to delay healing. Psalm 103, Romans 8:28</p>\n\n<p>Just as the nurse stroked my arm and held my hand, Jesus comforts me with the comfort of true understanding, having suffered just as I suffer (and far more so). Hebrews 2:9-18, 2 Corinthians 1:3-5</p>\n\n<p>Just as the nurse reminded me to breathe and used her words when I had no words, the Spirit counsels me and intercedes for me when we cannot even think how to pray. Romans 8:26-27</p>\n\n<p>So maybe the month of April, 2017 will be blank on my earthly calendar but will be full to the brim on my heavenly timeline. Appointments were met, meetings were held, and trips were made all for the purpose of making my roots grow down into God&rsquo;s love to keep me strong, so that I will eventually have the power to understand how wide, how long, how high, how deep is His love for me. Then I will be complete with all the fullness of life and power that comes from God who is able to do more for me than I could ever ask or imagine. (Ephesians 3:7-17-20)</p>\n\n<p>Let me leave you with one closing thought for that moment when you can find nothing else.</p>\n\n<p><em>\"&hellip;we are afflicted in every way, but not crushed; perplexed, but not despairing; persecuted, but not forsaken; struck down, but not destroyed; always carrying about in the body the dying of Jesus, so that the life of Jesus also may be manifested in our body. For we who live are constantly being delivered over to death for Jesus&#39; sake, so that the life of Jesus also may be manifested in our mortal flesh.</em> <em><strong>Therefore, we do not lose heart, but though our outer man is decaying, yet our inner man is being renewed day by day. For momentary, light affliction is producing for us an eternal weight of glory far beyond all comparison, while we look not at the things which are seen, but at the things which are not seen; for the things which are seen are temporal, but the things which are not seen are eternal.\" </strong></em>&nbsp;2 Corinthians 4:8-11,16-18 (emphasis mine)</p>"
                 },
                 {
                 "category": "",
                 "topics": [
                            {
                            "ID": "Judgment",
                            "topic": "Judgment"
                            },
                            {
                            "ID": "Grace",
                            "topic": "Grace"
                            }
                            ],
                 "ID": "2070",
                 "summary": "<p>Only Messiah <em>Yeshua</em> (Jesus) can resolve the apparent dissonance created by the thirteen midot (attributes) of G-d revealed in Exodus chapter 34.</p>",
                 "postedDate": 1492880640,
                 "title": "The Thirteen Midot",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_11.jpg",
                 "authorThumbnailAltText": "Brady Stephenson",
                 "authorName": "Brady Stephenson",
                 "url": "https://www.versebyverseministry.org/devotionals/the-thirteen-midot",
                 "body": "<p>The stories of G-d&#39;s interactions with Moses and the people of Israel fill the book of Exodus.&nbsp; One passage, in particular, is overflowing with G-d&#39;s revelation of Himself.&nbsp; It&#39;s the passage where G-d commands Moses to&nbsp;create two new stone tablets after the Israelites&#39; sin of the golden calf.</p>\n\n<p style=\"font-family: 'Times New Roman', Times, serif;\"><strong><em>The LORD descended in the cloud and stood there with him as he called upon the name of the LORD.&nbsp; Then the LORD passed by in front of him and proclaimed, \"The LORD, the LORD God, compassionate and gracious, slow to anger, and abounding in lovingkindness and truth; who keeps lovingkindness for thousands, who forgives iniquity, transgression and sin; yet He will by no means leave the guilty unpunished, visiting the iniquity of fathers on the children and on the grandchildren to the third and fourth generations.\"&nbsp; Moses made haste to bow low toward the earth and worship. (Exodus 34:5-8)</em></strong></p>\n\n<p>&nbsp;</p>\n\n<p>After G-d gave the commandments to the Israelites verbally and they agreed to do all He commanded (Exodus 24:3), Moses went up on the mountain to be with G-d (Exodus 24:15).&nbsp; While he was away, the Israelites fell into the sin of the golden calf (Exodus chapter 32).&nbsp; Moses then returns, sees their sin, and breaks the stone tablets of the covenant in his anger (Exodus 32:19).</p>\n\n<p>G-d reveals His compassion and mercy in the fact that He did not immediately obliterate all those who sinned in the matter of the calf.&nbsp; In fact, He calls Moses back up on the mountain to create a new set of tablets.&nbsp; It is in this context we find what are known as the thirteen <em>midot</em>: the Thirteen Attributes of G-d, also known as the&nbsp;Thirteen Attributes of Mercy. The Talmud describes these in detail in <em>Tosephot Rosh HaShanah </em>17b.</p>\n\n<p>Let&#39;s take a brief look at G-d&#39;s attributes that He reveals in this moment.</p>\n\n<p>&nbsp;</p>\n\n<p><strong><em>YHVH </em></strong>(Strong&#39;s #3068) - the special four letter name of G-d given to Moses at the burning bush.<br />\nThis name reveals G-d&#39;s covenant-keeping nature.<br />\n(The Talmud notes that G-d is merciful <strong>before </strong>a person sins.)</p>\n\n<p><strong><em>YHVH </em></strong>- stated a second time as an intensive.<br />\n(The Talmud notes that G-d is also merciful <strong>after </strong>a person sins.)</p>\n\n<p><strong><em>El </em></strong>(Strong&#39;s #410) - Hebrew for \"mighty\". <em>El</em> is also short for <em>Elohim</em> which is the Hebrew word for G-d.<br />\nThis word reveals G-d as Deity.<br />\n(The Talmud notes that G-d is all powerful.)</p>\n\n<p><strong><em>Rachum </em></strong>(Strong&#39;s #7349) - Hebrew for \"full of compassion\".&nbsp; This Hebrew word is related to the word for \"womb\" and motherlike compassion associated with womanhood.<br />\nThis adjective reveals G-d&#39;s nature as compassionate and merciful.<br />\n(The Talmud states G-d is compassionate.)</p>\n\n<p><strong><em>Channun </em></strong>(Strong&#39;s #2587) - Hebrew for \"gracious\".<br />\nThis word reveals G-d&#39;s character as the G-d of Grace.<br />\n(The Talmud states G-d is gracious.)</p>\n\n<p><strong><em>Erekh aphayyim </em></strong>(Strong&#39;s #750&nbsp;and Strong&#39;s #639) - Hebrew for \"slow to anger\" [literally \"slow nostrils\"- when someone is angry they flare their nostrils].<br />\nThis phrase reveals G-d&#39;s patient nature.<br />\n(The Talmud notes G-d is slow to anger.)</p>\n\n<p><strong><em>Rav chesed </em></strong>(Strong&#39;s #7227&nbsp;and Strong&#39;s #2617) - Hebrew for \"great in kindness\" or \"great in covenantal devotion\".<br />\nThis part reveals G-d&#39;s character as abundantly kind.<br />\n(The Talmud states G-d is abounding in kindness.)</p>\n\n<p><strong><em>Emet </em></strong>(Strong&#39;s #571) - Hebrew for \"trustworthy\" or \"truth\".- This word reveals G-d&#39;s character as \"Truth\". Yeshua said He is the Way the \"Truth\" and the Life (John 14:6).<br />\n(The Talmud states G-d is kind even after His scrutiny of our conduct.)</p>\n\n<p><strong><em>Notzer chesed lo&#39;olafim </em></strong>(Strong&#39;s #5341, Strong&#39;s #2617, and Strong&#39;s #505) - Hebrew for \"keeping covenant devotion for thousands\" [of years? generations?].<br />\nThis phrase reveals G-d&#39;s character as consistently faithful and kind.<br />\n(The Talmud states G-d&#39;s kindness extends to future generations.)</p>\n\n<p><em><strong>Nosei avon </strong></em>(Strong&#39;s #5375 and Strong&#39;s #5771) - Hebrew for \"forgiving of iniquity\" [<em>avon </em>being intentional sin: iniquity].<br />\nThis description reveals G-d&#39;s character as forgiving of iniquity.<br />\n(The Talmud states G-d forgives sins committed willfully.)</p>\n\n<p>[<em><strong>Nosei</strong></em>] <em><strong>peshah </strong></em>(Strong&#39;s #6588) - Hebrew for \"[forgiving of] transgression\" [<em>peshah </em>being rebellious sin: transgression].<br />\nThis part reveals G-d&#39;s character as forgiving of rebellious sin.<br />\n(The Talmud states G-d forgives sins committed in defiance of His will.)</p>\n\n<p>[<strong><em>Nosei</em></strong>] <strong><em>chatah </em></strong>(Strong&#39;s #2403) - Hebrew for \"[forgiving of] sin\" [<em>chatah </em>being accidental sin].<br />\nThis word reveals G-d&#39;s character as forgiving of accidental sin.<br />\n(The Talmud states G-d forgives sins committed unwittingly.)</p>\n\n<p><strong><em>V&#39;nakeh lo yanakeh </em></strong>(Strong&#39;s #5352, Strong&#39;s #3808, and&nbsp;Strong&#39;s #5352) - Hebrew for \"not leaving unpunished\" [the guilty].&nbsp;<br />\nThis phrase reveals G-d&#39;s character as the righteous judge.</p>\n\n<p>Here the Talmud states G-d acquits the <em>repentant sinner</em>, but that is <strong>not </strong>what what is written here.&nbsp; It says He will not leave the&nbsp;guilty <strong>unpunished</strong>.&nbsp; The Sages were forced to deal with the apparent conflict of this last attribute with the rest of G-d&#39;s character.&nbsp; This thirteenth attribute creates a \"dissonance\" in the pattern of what G-d just revealed. It doesn&#39;t fit with all the gracious, merciful, and compassionate character traits that came before it.</p>\n\n<p>&nbsp;</p>\n\n<p>We might understand this by way of a simile...a song in this case:</p>\n\n<p>Some songs have a dissonant chord structure just before the final chord.&nbsp; (Think about some of the old hymns that have an \"ayyyy...men\" at the end.&nbsp; The \"ay\" in that \"ayyyy...men\" is usually a dissonant chord.)&nbsp; In these chords, the middle of three notes in the chord sounds too high. It is only when that center (or 2nd note) \"comes down\" that the dissonance is resolved and the chord sounds finished and complete.</p>\n\n<p>In a similar way, it was only when the \"second note\" of the G-dhead (the Son) came down to dwell among men (John 1:14) that the apparent dissonance is resolved to a complete \"chord of grace\". For those who do not accept the arrival of that second note (the Messiah <em>Yeshua</em>) the dissonance still remains and sets their teeth on edge (Jeremiah 31:29).</p>\n\n<p>This is the \"song\" of G-d&#39;s new covenant: He has provided complete grace, compassion, and mercy to those He has chosen, even in full view of His righteous justice.&nbsp; \"Sing to the Lord a new song, Sing His praise from the end of the earth!\" (Isaiah 42:10).</p>\n\n<p>Shabbat shalom!</p>\n\n<p>&lt;&gt;&lt;</p>\n\n<p><a style=\"visibility: hidden;\" href=\"https://plus.google.com/+BradyStephenson_TX?rel=author\">Brady on Google Plus</a></p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "2048",
                 "summary": "<p>About a year ago, a friend asked me if I wanted to take part in a local charitable effort. It was something that I had always been interested in and seemed like a group doing good work, so of course I jumped at the chance. No sooner than the first email exchange concluded, I knew that I had made a terrible mistake.</p>",
                 "postedDate": 1492028400,
                 "title": "On Being Martha (It&#8217;s a Good Thing)",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/on-being-martha-its-a-good-thing",
                 "body": "<p>~~About a year ago, a friend asked me if I wanted to take part in a local charitable effort. It was something that I had always been interested in and seemed like a group doing good work, so of course I jumped at the chance. No sooner than the first email exchange concluded, I knew that I had made a terrible mistake. This group is indeed doing good, and there are many happily committed volunteers working to support it, but it is a hot mess of inefficiency, redundancy, disorganization, illogic, and waste, none of which I have any (and I mean <em><strong>any</strong></em>) tolerance for. I am exasperated beyond expression by the whole experience.</p>\n\n<p>You understand, don&rsquo;t you, that the problem is me? I am a Martha. I am Martha to the bone. I am<em><strong> happy </strong></em>to be Martha in every way, and I don&rsquo;t relate well to the Mary&rsquo;s of the world. I have a Martha response to them. Get up. Do something. And if it&rsquo;s worth doing, it&rsquo;s worth doing right, or at least well. Your lack of planning or effort or organization should not become someone else&rsquo;s burden.</p>\n\n<p>Martha always gets a bad rap, and for some reason &ndash; well for a lot of really valid reasons in a modern cultural application, but that&rsquo;s another post &ndash; we twist around the story of Luke 10 until we have demonized Martha for nothing more than serving in her gift, while lauding Mary for laying around listening to Jesus. And yes, I know He said that Mary chose the better part, but He was talking about the <em><strong>listening</strong></em>, not the laying around (read some of the Proverbs if you&rsquo;d like to argue the point). Jesus never told Martha to stop what she was doing. He never told her that she was somehow broken, that her desire to serve well was wrong, or that she needed to change who she was created by God to be. He just told her to reconsider her focus. That&rsquo;s what I realized is wrong with my service in this organization. What Luke records about Martha is true of me as well. I am distracted by my service and worried and bothered by many things.</p>\n\n<p>If you parse the Greek on those three words &ndash; distracted, worried, and bothered &ndash; you can loosely interpret that to say that Martha is being drawn away (from Jesus) by much ministry, seeking to promote her own interests, and in a tumult like a crowd that&rsquo;s all stirred up.</p>\n\n<p>What people usually fail to see is the change in Martha, evident if you follow her story throughout the gospels to where we find her in John 11 and 12. She took Jesus&rsquo; words to heart and found a way to listen <em><strong>while</strong></em> she worked. It was entirely beyond Martha&rsquo;s ability (or desire, I would guess) to change her very nature and stop serving to lounge about with the guys listening to Jesus, so she learned to serve <em><strong>and </strong></em>listen. She didn&rsquo;t contort her character or shirk her duties (see John 12), but she learned to serve <em><strong>and</strong></em> hear (even in that she is the model of efficient multi-tasking!).</p>\n\n<p>Now maybe Martha and I are the only ones here, but&hellip; I think not.&nbsp;What I came to understand today is that&nbsp;it&rsquo;s OK to be dissatisfied with the current state of affairs (God is a God of order and efficiency!) but it is not OK to become so distracted by my own agenda (chaffing against the system) that I am in such a tumult that I cannot hear Jesus over the sound of the crowd in my head! My focus while serving this group has been all wrong. There is good work being done here! Jesus is totally in it! It is work that He is blessing in spite of its messiness, and I&rsquo;m sure it&rsquo;s bearing fruit. I just haven&rsquo;t been able to appreciate all of that because every experience has for me&nbsp;been an exercise in maddening annoyance. (I&#39;m sure they feel likewise!)</p>\n\n<p>That said, I am and always will be Martha. Unlike Martha, I have a choice here. I am not compelled to continue serving in this role. Knowing that and applying wisdom tells me that it&rsquo;s time to make room for someone who can serve in this role <em><strong>and</strong></em> hear Jesus while they&rsquo;re doing it. I can&rsquo;t. I would like to say that I could stay and be refined, but I know better. There are other places where I can serve and hear Jesus (and not do harm while I&rsquo;m at it!). I am there already in more than one instance.<br />\nI think it&rsquo;s OK to know our limits, to admit our sin, and not to seek out opportunities that test the very last nerve of our tolerance level (he who would not fall down ought not to walk in slippery places!). This is the way I am wired. God created me this way, and He has good work for me to do utilizing all the gifts He has given me. I don&rsquo;t have to change the way this group operates, or even change myself to fit here. I just need to &ndash; as my son always says &ndash; get in my own lane and serve where I can still hear Jesus as I do. Being Martha. Listening.</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "2040",
                 "summary": "<p>This last week was a rather stormy season for me emotionally. Wind. Pelting rain. Thunder. Lightening. Hail. And yes, the possibly of a tornado.</p>",
                 "postedDate": 1490132280,
                 "title": "Emergency Alert",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/emergency-alert",
                 "body": "<p>~~Most of you know that I volunteer at the local Children&rsquo;s Shelter. I spend my time working for the school that&rsquo;s on-site but I&rsquo;m in a building separate from the school itself where I am typically alone. As spring approaches, and the weather that comes with it, the school is required to practice emergency weather procedures. In fact, the entire Shelter participates. When the lights and sirens sound, everyone is supposed to go to the closest safe-room and then report in by walkie-talkie to the person who is checking names off a list. Everyone on the premises must be accounted for before the lights and sirens stop.</p>\n\n<p>In the past, when we&rsquo;ve had a fire drill, I have just waited it out until the person checking my building came by to see that I was indeed fine and reported that I was accounted for. Until recently, I&rsquo;ve never been there during a weather alert. When the alert sounded, I calmly continued to work, waiting for someone to come around and check me off the list, never considering the fact that unlike in a fire situation, no one is going to be wandering around checking rooms while a tornado is bearing down on us. I know. Show me some grace. After about 20 minutes of listening to the siren blaring, I&rsquo;m starting to think something has fouled up the works. Little did I guess that it was me. That is until the teacher who had brought her kids in from the playground to the safe-room in my building came knocking on my door rather abruptly, and with less tolerance than normal told me in no uncertain terms that I needed to get into the safe-room. Now. Uttering into her walkie,&ldquo;Yeah. I&rsquo;ve got &lsquo;er.&rdquo; So, you know, color me embarrassed.</p>\n\n<p>This last week was a rather stormy season for me emotionally. Wind. Pelting rain. Thunder. Lightening. Hail. And yes, the possibly of a tornado. The storm roiled and brewed, and finally built up a towering wall cloud with a cold and mighty outflow boundary. It let loose. It caused damage. It took names. And the aftermath was destruction as far as the eye could see. The landscape was leveled. Then, as it is with all such storms, the sun broke - only to illuminate the devastation.</p>\n\n<p>Please tell me you&rsquo;ve had this experience, if only to reassure me that this is common to the human condition and not just common to my particular condition. So many things to say here. There are so many warnings in scripture. So many remedies to dry up an internal storm like the one I was brewing. Rather than heed even one, I decided to stand my own ground and ignore the warnings, and I did not seek shelter from the storm.&nbsp;</p>\n\n<p>I was only one of those affected by the damaging onslaught. While I felt relieved as the storm passed and the electricity was drained from the air, I was left with that sick feeling of dread in its wake. What had I done? Everywhere I looked, there were walking wounded&hellip; and that included me. Why? Why do I not heed the lights and sirens? Why must I insist on riding out the storm, fully convinced I have it within me to stand like the mighty oak and face it head on with no protection? Well, I have my own answers to that question and they beg a different post, but you may benefit from asking yourself the same thing if you are similarly inclined to resist seeking shelter. Are you ignoring what&rsquo;s brewing up inside you? Is it starting to gather steam? Are you seeing that cloudbank looming on the horizon? Let me help you out here...TAKE SHELTER IMMEDIATELY. Don&rsquo;t wait for someone to come &lsquo;round checking on you. GET IN THE SAFE ROOM. NOW! Cover your head with a blanket and beg for the mercy of God to make the storm pass over you harmlessly.Then rejoice in the Lord that you live another day: one without regret.</p>\n\n<p><em>For in the day of trouble He will conceal me in His tabernacle;<br />\nIn the secret place of His tent He will hide me;<br />\nHe will lift me up on a rock.<br />\nAnd now my head will be lifted up above my enemies around me,<br />\nAnd I will offer in His tent sacrifices with shouts of joy;<br />\nI will sing, yes, I will sing praises to the LORD. (Psalm 27:5-6)</em></p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "2037",
                 "summary": "<p>Many Christians are excited about the new movie, &#8220;The Shack,&#8221; but don&#8217;t be fooled&#8230;</p>",
                 "postedDate": 1489454460,
                 "title": "The Deception of The Shack",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_13.jpg",
                 "authorThumbnailAltText": "Brian Smith",
                 "authorName": "Brian Smith",
                 "url": "https://www.versebyverseministry.org/devotionals/the-deception-of-the-shack",
                 "body": "<p><em><strong>The following article was written by Dennis and Ava Shupert, friends of the ministry.&nbsp; They wrote this several years ago in response to the release of the book, \"The Shack.\" &nbsp;We offer this edited version for edification in light of the recent release of the movie by the same name.&nbsp; &ndash; Brian Smith.</strong></em><br />\n&nbsp;</p>\n\n<p>In 2007, a novel called <em>The Shack</em> was published.&nbsp; The book was written by William Paul Young, a man who claims to be a Christian.&nbsp; In 2017, the movie, based on the book, was released under the same title.&nbsp; The book/movie is about a family whose little girl is abducted and murdered.&nbsp; The father becomes overcome with sadness, and ultimately is invited by God to the shack where the girl was abducted.&nbsp; It is in the shack that the father encounters God, and from there the author paints a picture of who God is, what He is like, and how we can have a relationship with Him.&nbsp; Although this book was extremely popular with most Christians, we believe it to be a cleverly disguised, yet serious threat to the spiritual health of the church.&nbsp; What follows in this article are key heresies from the book of which we want to make Christians aware.&nbsp; Scripture tells us not to believe every spirit, but to test the spirits (1 John 4:1), and that is our aim in this article.</p>\n\n<p>An evil that is obvious is easy to avoid. As you know, our enemy, Satan, is a master of deceit and subtlety. That is why he wraps lies in pretty packages. <em>The Shack</em> is a beautiful story. Paul Young is a gifted author. He paints vivid pictures with his words and evokes deep emotional responses from his readers. But, hidden within the masterful storytelling, there are subtle lies that lead people away from the truth. Even a little poison hidden within something can cause death though it is small in comparison to the whole. (1 Cor. 5:6; Gal. 5:9) &ldquo;<em>A little leaven leavens the whole lump</em>&rdquo;.</p>\n\n<p>We feel very strongly about this danger. &nbsp;Before writing this, we spent hours in prayer asking the Lord to remove this burden from us. He has not but has instead increased the urgency and weight of it. &nbsp;We cannot dismiss the directive the Lord has given us. We must obey even at the risk of offending or angering some people who believe this book to be a great work of Christian literature.</p>\n\n<p>Let me first address the most common defense of <em>The Shack.</em> &ldquo;It&rsquo;s only fiction.&rdquo; It is interesting to note that most who defend the book with this phrase then say something like, &ldquo;It changed my life.&rdquo; There is no denying the power behind this story to affect people&rsquo;s lives, and it is this very fact that negates the argument that it is &ldquo;only fiction.&rdquo;&nbsp; Any author who addresses the eternal issues that Mr. Young addresses and calls himself a Christian is responsible to adhere to the Bible as his/her source of truth. And we, as Christ followers, are instructed to test the spirits and the teachings that we encounter. I am not judging Mr. Young as a person or even as a believer. Only God can look into a man&rsquo;s heart. I am, however, judging his teaching and the spirit behind it.</p>\n\n<p>There are dozens of ministries and notable scholars, teachers, pastors, apologists, etc. who agree that this book is unscriptural in its teaching. There are also dozens, maybe hundreds by now, of sermons and papers that have been written to address the unbiblical content of The Shack.</p>\n\n<p>I have attempted to condense the information I have read and listened to, coupled with my own study to arrive at six crucial points which I believe to be fundamental to our faith.</p>\n\n<p><u><strong>First Argument</strong></u></p>\n\n<p><em>The Shack</em>&nbsp;maintains that scripture is not always reliable or valid. Without the word of God as our foundation, God&#39;s people would&nbsp;be &ldquo;tossed to and fro by every wind of doctrine.&rdquo; If scripture cannot be trusted, then our salvation is not secure. The importance of scripture cannot be minimized.</p>\n\n<p>For example, on page 98 the book questions the words of Jesus on the cross (&ldquo;My God. My God. Why have You forsaken me?&rdquo;). The character \"Papa\" (who represents God the Father) says, &ldquo;Regardless of what He felt at that moment, I never left Him,&rdquo; and &ldquo;He found His way through it to put Himself completely into My hands.&rdquo; &nbsp;Jesus was not mistaken or lost in some emotional state at that moment. Rather He was declaring truth by directing His listeners to the prophecy written by David in Psalm 22, where the crucifixion is described in great detail although it was written hundreds of years before the Romans began using crucifixion as a form of execution.&nbsp;</p>\n\n<p>A second example on pages 67-68 finds the character \"Mack\" (father of the murdered girl) declaring, &ldquo;God&rsquo;s voice had been reduced to paper, and even that paper had to be moderated and deciphered by the proper authorities and intellects&hellip;Nobody wanted God in a box just in a book. Especially an expensive one bound in leather with gilt edges, or was that guilt edges?&rdquo; Note his disdainful attitude.</p>\n\n<p>In a&nbsp;third example on page 136, Mack says&nbsp;to the character \"Sarayu\", who represents the Holy Spirit, &ldquo;There are lots of people who think it (i,e,. the Garden of Eden, Creation) was only a myth.&rdquo; Her answer is, &ldquo;Well, their mistake isn&rsquo;t fatal. Rumors of glory are often hidden inside what many consider myths and tales.&rdquo;</p>\n\n<p>The Bible is God&rsquo;s revelation of Himself&nbsp;to us, His followers, and as such we should be defending and proclaiming the inerrancy of scripture and elevating its teaching to the place of respect it deserves as the source of absolute truth breathed out by God Himself, not casting doubt on its validity (see 2Tim. 3:16).</p>\n\n<p><u><strong>Second Argument</strong></u></p>\n\n<p>Mr. Young misrepresents the very nature of God. He portrays God in a way that is not consistent with His revelation of Himself in His Word and in His Son. I&rsquo;ll give four examples:</p>\n\n<p>On page 84 and elsewhere, God the Father is represented by a female character. God is neither male nor female as humans are, however&nbsp;in the Bible God has chosen to describe Himself as Father and with a male pronoun, never with feminine pronouns. Choosing to portray God the Father as female is clearly an attempt to counter scripture and confuses the true nature of God.</p>\n\n<p>Secondly, on page&nbsp;85 Papa&nbsp;says to Mack, &ldquo;We&rsquo;ll do things on your terms and time.\" God does not do things on our terms or time. There is a myriad of scriptures that tell us God does things according to His purpose, to fulfill His plan and His will, never ours. Ez. 36:22 tells us that God acts, &ldquo;<em>for the sake of His holy name</em>&rdquo;.</p>\n\n<p>Thirdly, on page 124 it says, speaking of the Trinity, &ldquo;We have no concept of final authority among us&hellip;You end up with some chain of command or a system of order that destroys relationship rather than promotes it&rdquo;. On page 147 &ldquo;God&rdquo; says, &ldquo;We are submitted to you in the same way&rdquo;. Mack asks, &ldquo;Why would the God of the universe want to be submitted to me?&rdquo; The answer is, &ldquo;Because We want you to join Us in Our circle of relationship&rdquo;.</p>\n\n<p>In fact, God is the author of authority, structure and order. All authority comes from Him. (Rom. 13:1) I know of no instance in the Bible where God is submitted to us in any way. And authority even exists within the Trinity. 1Cor. 15:27-28 says, &ldquo;<em>God has put all things in subjection under His feet&hellip;it is plain that He is excepted who put all things in subjection under Him. When all things are subjected to Him, then the Son Himself will also be subjected to Him&hellip;that God may be all in all</em>.\"&nbsp; In John 14:10 Jesus says, &ldquo;T<em>he words I say to you I do not speak on My own authority</em>&rdquo;. In 1Cor. 14:40 the word instructs us that, &ldquo;<em>All things should be done decently and in order</em>&rdquo;.</p>\n\n<p>Fourth, on page 122 Papa says, &ldquo;I don&rsquo;t need to punish people for sin. It&rsquo;s not My purpose to punish it&rdquo;. On page 164 the character of Wisdom says to Mack, &ldquo;I am only asking you to do something you believe God does. You believe He will condemn most&hellip;Is that not true?&rdquo; Her meaning is that the assumption that God will judge is wrong.</p>\n\n<p>But God says in His word in Isaiah&nbsp;13:11, &ldquo;<em>I will punish the world for its evil and the wicked for their iniquity</em>&rdquo;. Rom. 2:8 states, &ldquo;<em>For those who do not obey the truth, but obey unrighteousness, there will be wrath and fury</em>&rdquo;. Jesus warns us in Luke 12:5 to, &ldquo;<em>Fear Him who, after He has killed, has authority to cast into hell</em>&rdquo;. God is love, but His love is also just and holy. I Peter 1:16 says, &ldquo;<em>Be holy for I am holy</em>&rdquo;. We cannot choose to love and accept only part of God&rsquo;s nature, nor can we define God on our terms. Either He is who He says He is or He is not God at all.</p>\n\n<p><u><strong>Third Argument</strong></u></p>\n\n<p>In <em>The Shack</em> the deity and significance of Jesus is called into question. If the importance of Jesus is questionable then so is our salvation. On page 88 the character of Jesus speaks of His name as being open for debate. He says, &ldquo;Jesus? Yes. And you can call Me that if you like. After all, it has become My common name&rdquo;.</p>\n\n<p>I understand that the Hebrew word for Jesus was Yeshua and Joshua may be a closer English translation, but this statement gives the impression that the profound significance of the person and the name of Jesus is up for personal interpretation. Phil. 2:9-10 says, &ldquo;<em>God has highly exalted Him and bestowed on Him the name that is above every name, so that at the name of Jesus every knee should bow, in heaven on earth and under the earth</em>&rdquo;.</p>\n\n<p>On page 101 Papa says, &ldquo;Although He is also fully God, He has never drawn upon His nature as God to do anything&rdquo;. On page 102 it says, &ldquo;Jesus, as a human being, had no power within Himself to heal anyone&rdquo;. And &ldquo;Although I have only been limited in Jesus, I have never been limited in Myself&rdquo;.</p>\n\n<p>The implication that Jesus was somehow limited or less God because He became human is certainly not biblical. John 1:1 says, &ldquo;<em>In the beginning was the Word and the Word was with God and the Word was God&hellip;All things were made through Him and without Him was not anything made that was made</em>&rdquo;. In Matt. 9:5-6 when Jesus healed the paralytic it says it was to show that, &rdquo;<em>The Son has authority to forgive sins</em>&rdquo;, something that only God could do. And Col. 2:9 tells us, &ldquo;<em>For in Him the whole fullness of deity dwells bodily</em>&rdquo;. Finally, in Rev. 19:15 it says, &ldquo;<em>He (Jesus) will tread the winepress of the fury of the wrath of God</em>&rdquo;. That does not sound like a limited human to me.&nbsp;</p>\n\n<p><u><strong>Fourth Argument</strong></u></p>\n\n<p>The Shack passes a harsh verdict on the church. On page 95 Mr. Young uses the terms &ldquo;religious conditioning&rdquo; and &ldquo;religious stereotypes&rdquo; to define the established church. Page 125 refers to a &ldquo;system of order that destroys relationship&rdquo;, and on page 183 Mack says, &ldquo;But so many of the people I care about seem to be both in it and of it. Mack was thinking of friends, church people. He knew they loved Jesus, but he also knew they were sold out to religious activity and patriotism&rdquo;.</p>\n\n<p>Scripture teaches us that Jesus is the Head of the church, it is His Body. (Eph. 5:23) The system of order that governs the church was set up by God in the first place. (I Cor. I &amp; II Tim. Titus) It is also interesting that the author twists the scripture to say that we should be in the church but not of it, when the Bible says it is we, the church, who are to be in the world but not of it. John 17:14&amp;16 say, &ldquo;<em>They are not of this world even as I am not of this world</em>&rdquo;.</p>\n\n<p>Unfortunately man, under the influence of our enemy, has taken what God intended and corrupted it. I know too that Jesus was no fan of the religious hypocrisy of His day, nor does He approve of it today. I personally am outspoken against legalism and hypocrisy. &nbsp;However, the attitude behind Mr. Young&rsquo;s statements condemns the church and all it stands for as a whole. It leads readers to the conclusion that being involved with their local church is a bad thing.</p>\n\n<p>The Bible teaches that we should not forsake the gathering together of the brethren. There are hundreds of verses that instruct us to love our brother. In the New Testament the word translated brother means brother or sister, specifically siblings in a family. Our brother is referring to other believers, the Body of Christ, the Church. We are supposed to be known by our love for each other so let us be careful to treat our Lord&rsquo;s Body with respect.</p>\n\n<p><u><strong>Fifth Argument</strong></u></p>\n\n<p>Mr. Young consistently leads readers to the conclusion that our enemy and his followers do not exist. He never refers to Satan. Mack is the only one to speak of hell and whenever he does he is ridiculed. I&rsquo;ll cite three examples here:</p>\n\n<p>&ndash; On page 138: Papa says, &ldquo;Both evil and darkness can be understood only in relation to light and good, they do not have any actual existence&rdquo;.<br />\n&ndash; On page 192: Papa states, &ldquo;All evil flows from independence and independence is your choice. Evil is the chaos of this age that you brought to Me&rdquo;.<br />\n&ndash; On page 164: Wisdom infers the fallacy of belief in God sentencing anyone to hell.</p>\n\n<p>Jesus, Himself spoke very vividly of the reality of hell. (Luke 12:5, 16:23-24) I John 3:8 says, &ldquo;<em>Jesus came to destroy the works of the devil</em>&rdquo;. In Eph. 6:11 and I Tim. 3:7 we are warned about the schemes and snares of the devil. And in Rev. 20:15 we are told of the destiny of those whose names were not found written in the Lamb&rsquo;s book of life.</p>\n\n<p>Hell and Satan are very real. He and his followers hate us, the church, and will stop at nothing to destroy us. However, one of his favorite tactics is to lull believers into a place of false security denying that he really exists or that we are in a battle against him. I Peter 5:8 tells us, &ldquo;<em>Our adversary, the devil, prowls around like a roaring lion seeking whom he may devour</em>&rdquo;. Ephesians 6:12 warns us that we are in a battle. How can we overcome our enemy if we spend our time in emotional fantasies, sniffing flowers and drifting in canoes completely unaware or denying that we are being shot at?</p>\n\n<p>For unbelievers the denial of hell and judgment is eternally devastating. I&rsquo;d like to quote an excerpt from the famous sermon by Jonathan Edwards titled, Sinners in the Hands of an Angry God:</p>\n\n<p>&ldquo;You cannot bear the fierceness and wrath of the infinite God. Tis a great furnace of wrath, a wide and bottomless pit, full of the fire of wrath, that you are held over in the hand of that God, whose wrath is provoked and incensed as much against you as against many of the damned in hell. Consider this, you who are here present, that yet remain in an unregenerate state. When God beholds the ineffable extremity of your case, and sees your torment to be so vastly disproportionate to your strength, and sees how your poor soul is crushed and sinks down, as it were into an infinite gloom, He will have no compassion on you. He will not forbear the executions of His wrath, or in the least lighten His hand. There shall be no moderation or mercy, nor will God then at all stay His rough wind. Ez. 8:18 &ldquo;Therefore I will act in wrath, My eye will not spare, nor will I have pity, and though they cry in My ears with a loud voice, I will not hear them.&rdquo;</p>\n\n<p>For us to allow the lost to believe there is no danger of hell is unthinkable if we are to love them. This brings us to point Six:</p>\n\n<p><u><strong>Sixth Argument</strong></u></p>\n\n<p>Mr. Young embraces a form of Universalism or Universal Reconciliation. He has said as much (albeit in his typically elusive manner) in interviews which can be found on-line. There are several instances in <em>The Shack</em> where this belief surfaces.</p>\n\n<p>Papa states on page 225 &ldquo;In Jesus, I have forgiven all humans for their sins against me, but only some choose relationship.&rdquo;&nbsp;&nbsp; On page 93 Papa refers to all people as &ldquo;Her kids&rdquo;. On page 164 the author calls all people God&rsquo;s children and implies that God will not send anyone to eternal torment. On page 192 Papa states that, &ldquo;the chaos of this age will not have the final say even though it touches everyone whom Papa loves, those who follow and those who don&rsquo;t&rdquo;.</p>\n\n<p>We are not all God&rsquo;s children. We are all His creations to do with as He pleases, but John 1:12 tells us, &ldquo;<em>All who did receive Him, who believed in His name; to them He gave the right to become children of God</em>&rdquo;. The Bible does refer to others. In Eph. 5:6 God refers to the &ldquo;<em>children of disobedience</em>&rdquo; and in Matt. 13:38 Jesus teaches, in the parable of the wheat and tares, &ldquo;<em>that the good seed is the children of the kingdom and the weeds are the sons of the evil one</em>&rdquo;.</p>\n\n<p>His purpose will be fulfilled, but it is not for everyone to be saved. Romans 9:22-24 says, &ldquo;<em>What if God, desiring to show His wrath and to make known His power, has endured with much patience vessels of wrath prepared for destruction in order to make known the riches of His glory for vessels of mercy which He has prepared beforehand for glory-even us whom He has called</em>&rdquo;. And Eph. 3:10, &ldquo;<em>So that through the church the manifold wisdom of God might now be made known to the rulers and authorities in the heavenly places</em>&rdquo;. There is more going on here than we can fathom, but it is not universalism.</p>\n\n<p>On pages 193-194 there is a conversation between Papa and Mack where Mack asks what Jesus accomplished by dying. The answer Papa gives is, &ldquo;Through His death and resurrection I am now fully reconciled to the world&rdquo;. (This is backward incidentally!) Mack replies, &ldquo;The whole world? You mean those who believe in You right?&rdquo; To which Papa replies, &ldquo;The whole world, Mack&rdquo;.</p>\n\n<p>On page 121 Papa says to Mack, &ldquo;I&rsquo;m not asking you to believe anything&rdquo;. And on page 184 Jesus says, &ldquo;Who said anything about being a Christian?&rdquo;</p>\n\n<p>If not a Christian, then what? The Bible says, &ldquo;<em>Those who do not believe are condemned already</em>&rdquo;. John 3:18 and John 8:23 says, &ldquo;<em>Unless you believe you will die in your sins</em>&rdquo;.</p>\n\n<p>In the few places where the perfect opportunity to share the Gospel arises there is instead a mass of ambiguous, flowery words that miss the mark entirely.</p>\n\n<p>On page 149 when Mack asks Jesus if there is any way out of this (declaring what is good and evil and trying to determine our own destiny) Jesus answer is, &ldquo;by returning. By turning back to Me. By giving up your ways of power and manipulation and just coming back to Me. (as if we were already saved, we just forgot for a little while)</p>\n\n<p>This next passage may very well be the most critical of heresies in the whole book. Here, in two short sentences, is &ldquo;the gospel&rdquo; of <em>The Shack</em>.</p>\n\n<p>On page 180 when Mack asks how to become a part of the church, Jesus replies, &ldquo;It&rsquo;s all about relationships and simply sharing life. What we are doing right now, (talking in the forest) just doing this and being open and available to others around us&rdquo;.</p>\n\n<p>On page 184 Jesus says, &ldquo;Those who love Me have come from every system that exists&hellip;Buddhists, Mormons, Baptists, Muslims, Democrats, Republicans&hellip;Jews, Palestinians. I have no desire to make them Christian&rdquo;. Mack asks, &ldquo;Does that mean that all roads lead to You?&rdquo; &ldquo;Not at all&rdquo;, Jesus replies, &ldquo;Most roads don&rsquo;t lead anywhere&rdquo;.</p>\n\n<p>In John 14:6 Jesus says, &ldquo;<em>I am the way the truth and the life, no one comes to the Father but through Me</em>&rdquo;. Matt. 7:13-14 says, &ldquo;<em>The gate is wide and the way is easy that leads to destruction, many enter by it. The gate is narrow and the way is hard that leads to life, few find it</em>&rdquo;. Any road except Jesus leads to destruction. If there is no hell then Jesus died in vain.</p>\n\n<p>Finally, on page 226 Papa tells Mack, &ldquo;For you to forgive this man (the man who murdered his daughter) is for you to release him to Me and allow Me to redeem him.&rdquo; and &ldquo;But he too is My son&rdquo;.</p>\n\n<p>Certainly God can redeem anyone, but it has nothing to do with us releasing them. It has to do with them believing in the finished work of Christ on the cross and confessing with their mouth that He is their Lord. Forgiveness is for our benefit, for us to be free from bitterness and resentment, and to remove ourselves from the place of judge. Only God is a perfectly just judge. He says, &ldquo;<em>Vengeance is Mine, I will repay</em>&rdquo;.&nbsp;</p>\n\n<p>In Romans 3:25 and I John 2:2 Jesus is called the Propitiation for our sins by His blood. The word propitiation means to appease. It was the holy and righteous wrath of God that Jesus was appeasing by His suffering and death. Is. 53:10 tells us that, &ldquo;<em>It was the will of God to crush Him</em>&rdquo;. He suffered immeasurably to fulfill the requirement of God&rsquo;s just judgment. How can we gaze into the eyes of our Savior and deny the import of what He did for us? This is nothing more than pure unadulterated blasphemy. Nor can we turn our backs on the lost and allow them to die in their sins. Again I will quote from Sinners in the Hands of an Angry God:</p>\n\n<p>&ldquo;We know not who they are, or in what seats they sit, or what thoughts they now have: it may be they are now at ease, and hear all these things without much disturbance, and are now flattering themselves that they are not the persons, promising themselves that they shall escape. If we knew who it was, what an awful sight would it be to see such a person! How might all the rest of the congregation lift up a lamentable and bitter cry over him! But alas! Instead of one, how many is it likely will remember this discourse in hell.&rdquo;</p>\n\n<p>How can we claim to love God and the thousands of people who flock through the doors of churches every week seeking to know God if we tolerate and even promote teaching that blasphemes our Lord and leads people away from the truth? &nbsp;Why would Christians buy a book that causes such confusion?&nbsp; They should not.&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n<p>In closing, let us be reminded of the warning in 2 Timothy 4:3-4, &ldquo;<em>The time is coming when people will not endure sound teaching&hellip;but will accumulate teachers to suit their own passions and turn away from the truth and wander into myths</em>&rdquo;. Galatians 1:6-10 also gives a warning, &ldquo;<em>I am astonished that you are so quickly deserting Him who called you in the grace of Christ, and are turning to a different gospel - not that there is another one, but there are some who trouble you and want to distort the gospel of Christ. But even if we or an angel from heaven should preach to you a gospel contrary to the one we preached to you, let him be accursed. As we have said before, so now I say again: if anyone is preaching to you a gospel contrary to the one you received, let him be accursed. For am I now seeking the approval of man, or of God? Or am I trying to please man? If I were still trying to please man, I would not be a servant of Christ</em>&rdquo;.</p>\n\n<p>We have a responsibility to teach and proclaim the word of God and to uphold the truth to the glory of God Almighty. If we tolerate anything that deviates from what God has revealed to us in His word, we risk falling down the Slippery Slope (an article by Charles Spurgeon) of heresy into an abyss of lies.</p>\n\n<p>Finally, as lengthy as this article is&nbsp;it is by no means exhaustive!&nbsp; There are many other places <em>The Shack</em> strays from sound doctrine or implies errant theology.&nbsp; A whole book could (and probably should) be written to expose its &ldquo;truth claims&rdquo; compared to Biblical Truth.&nbsp; We have only addressed what we consider to be the most critical areas.</p>\n\n<p>Obviously, the message of <em>The Shack</em> has found a receptive audience, but it is not the message the apostles proclaimed and for which they died. The theology of <em>The Shack</em> more closely resembles that of the Emergent Church than that of Holy Scripture.</p>\n\n<p>On a lighter, humorously ironic note, we noticed (in light of Ephesians 4:14; so that we may no longer be children, tossed to and fro by the waves and carried about by every wind of doctrine.) that the publisher of the book, appropriately, is Windblown Media! Does God have a sense of humor, or what?</p>\n\n<p>We hope and pray all Christians will receive this humble appeal in the spirit and attitude that is intended. Not as a rebuke but rather, as an exhortation and plea as fellow workers in Christ, standing together in this great Cosmic Battle, fighting as one united Body against our common enemy and the lies and illusions of the world, the flesh, and the devil; working together toward the common goal of building up and equipping the Body of Christ and helping those far from God to become fully devoted followers of Christ.</p>"
                 },
                 {
                 "category": "",
                 "topics": [
                            {
                            "ID": "Sin",
                            "topic": "Sin"
                            },
                            {
                            "ID": "Obedience",
                            "topic": "Obedience"
                            },
                            {
                            "ID": "Sovereignty",
                            "topic": "Sovereignty"
                            },
                            {
                            "ID": "Faith",
                            "topic": "Faith"
                            }
                            ],
                 "ID": "2025",
                 "summary": "<p>Are you a worrier? Has anyone just told you flat out that worry is a sin? Worry is a great tool for our enemy. He keeps us so wrapped around the axel that we cant see which way is up for imaging what might happen if we take our eyes off the imaginary balls were juggling. Stop for just a second and let your worry creep in See how easy it is suddenly to lose sight of God?</p>",
                 "postedDate": 1487516520,
                 "title": "Creep",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/creep",
                 "body": "<p>~~Just a few years ago we had my son&rsquo;s bathroom remodeled and as is the course with those things, there are decisions we&rsquo;d probably make differently given the opportunity for a do-over. I was checking the bathroom status before my son came home for Christmas break and pulled back the shower curtain to discover one of those decisions staring at me in all its glory. Mold. The drywall at the edge of the shower was soggy wet and starting to mold. We already have a handy-man list a mile long with no man handy. This will have to go on the list. Sigh.</p>\n\n<p>This morning I was awake too early, and lying there convincing myself to go back to sleep, I began to think of that mold. How it crept up there while no one was watching. How, even now, it was probably growing back behind that wall, creeping, creeping into a lung-choking mass that will inevitably cause the house to be condemned, after which we will lose our investment and every earthly blessing, leaving us homeless or living in our son&rsquo;s basement while his nagging wife thinks of ways to get rid of us&hellip; I did eventually fall asleep, but fitfully.&nbsp;&nbsp;&nbsp;<br />\n&nbsp;<br />\nThis morning I had to laugh at myself. Although this is my way and it isn&rsquo;t really funny, my mind works exactly like that imagined mold. I mean really, the moldy spot was about an inch and a quarter at most. I scraped it off and taped the shower curtain closed until we can deal with it. Problem solved right? Right. Except. Except for the creep. The creep of my mind which hops from one infinitesimal &ldquo;problem&rdquo; to world destruction.</p>\n\n<p>Are you a worrier? Has anyone just told you flat out that worry is a sin? I don&rsquo;t actually think of myself as a worrier, but I suppose it&rsquo;s self-evident that I am one. Not to the degree of some. Some people make an art of worry. They have mastered the skill, and practice it ad nauseum, as if they have complete mind-control over everything in the universe and by just imagining the worst, they can somehow save the planet and everyone on it. OK. Maybe I&rsquo;m a bit like that. But I&rsquo;m quiet about it. Most people who know me would not call me a worrier. If they heard what my head often sounds like they would think I&rsquo;m pathological. What I really think is that it&rsquo;s easier to create fiction from fact than it is to surrender control. Here&rsquo;s what God says:&nbsp;</p>\n\n<p><em>For though we walk in the flesh, we do not war according to the flesh, for the weapons of our warfare are not of the flesh, but divinely powerful for the destruction of fortresses. We are destroying speculations and every lofty thing raised up against the knowledge of God, and we are taking every thought captive to the obedience of Christ, and we are ready to punish all disobedience, whenever your obedience is complete. You are looking at things as they are outwardly. (2 Corinthians 10:3-7a)</em></p>\n\n<p>Worry is a great tool for our enemy. He keeps us so wrapped around the axel that we can&rsquo;t see which way is up for imaging what might happen if we take our eyes off the imaginary balls we&rsquo;re juggling. I mean, the world depends on us! Stop for just a second in reading this and let your worry creep in&hellip; See how easy it is suddenly to lose sight of God? Our prayers become superstitious mantras that we repeat until we&rsquo;ve made them idols. Our faith becomes self-focused and independent of its object. We have, in one lazy moment of unchecked thought-creep, unseated the Lord from His throne. And this is what our enemy wants. This is the way he wages war against us.</p>\n\n<p>I can&rsquo;t search the scripture for a problem with mold (although it occurs to me that there&rsquo;s a portion of Leviticus maybe that might be helpful&hellip;) but I can trace the roots of my fear as revealed by where my thoughts ended up. Because fear is the root of worry. You know this, right? That&rsquo;s why it&rsquo;s a sin. Fear is the enemy of faith. It is its contradiction. It&rsquo;s like thumbing your nose at God. So, what&rsquo;s at the root of my worry about that mold? Security. And where have I placed my security &ndash; where have I built my fortress? In my home and my earthly provisions. Wrong. Answer. That thought needs to be taken captive and made obedient to what Christ says about it. Otherwise the enemy is going to eat my lunch over it!</p>\n\n<p>Do you know how many times &ldquo;I AM&rdquo; appears in the bible? 719 times. 508 times in the Old Testament, 211 in the New. I&rsquo;m pretty sure there&rsquo;s a place where God has said, &ldquo;I AM your provision.&rdquo; No one in history needed to know that more than Abraham did when we see him in Genesis 22 where he first names God, Jehovah Jireh&hellip; the Lord Will Provide.&nbsp;</p>\n\n<p>And then there are Jesus&rsquo; own words, <em>&ldquo;Look at the birds of the air, that they do not sow, nor reap nor gather into barns, and yet your heavenly Father feeds them. Are you not worth much more than they? And who of you by being worried can add a single hour to his life?&rdquo; (Matthew 6:26-27)</em></p>\n\n<p>These are my truths. This is how I will take my thoughts captive. When I let the creep of worry take me&nbsp;from mold to the destruction of life as we know it, with these I will draw my mind and my heart back to the One who provides all things, in whom I trust. Your truths will be different if you&rsquo;re brave enough to get to the root of your worry and find the words that stop the creep. As for me, I will take those creeping thoughts captive and make them obedient to the words of Truth, and like bleach (or a putty knife) to mold, I will wage war with an effective weapon! Take <em><strong>that</strong></em>!</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "2016",
                 "summary": "<p>In my own kitchen, I have a very particular way about things. I also have a method when I cook or bake that involves making a hot slinging mess across every conceivable surface. Sometimes my husband wants to come in to the middle of the slinging and begin to help. Can I just tell you how insane it makes me? Do you need me to explain, ladies? Sometimes it&#8217;s hard to know when to help and when to get out of the way, but I find that as in the temporal so in the spiritual.</p>",
                 "postedDate": 1485793020,
                 "title": "Big Helper",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/big-helper",
                 "body": "<p>~~My son was waxing nostalgic a few days before Thanksgiving, his favorite holiday of the year. I asked him what he was most looking forward to and typical of men (sorry guys, this one is going to be decidedly gender biased) he mentioned something along the lines of the days of rest and relaxation ahead. I snorted and said something along the lines of &lsquo;must be nice&rsquo;, to which he raised an eyebrow. Ladies, you&rsquo;re with me here, right? November hits and our destiny is the kitchen. Mind, I&rsquo;m not complaining. It&rsquo;s my favorite time of year too. I love food. I love to eat and I love to feed my family. The holidays are my joy and my bane. In my husband&rsquo;s extended family there is an unwavering pattern to Thanksgiving day. The women cook, schelp, serve, and then we clean up. The men&hellip; well they find a comfy recliner or a soft sofa and settle in to let the turkey coma commence. It used to infuriate me. Now I know that we women have the better part of the day because of what happens when we are all together in the kitchen. And I realize that sometimes &ldquo;help&rdquo; is not all that helpful.&nbsp;&nbsp;&nbsp;</p>\n\n<p>In my own kitchen, I have a very particular way about things. (I know you cannot imagine that about me!) I have certain drawers for certain utensils, certain cabinets for certain baking pans etc&hellip; I am very very organized (I can bake an entire cake without moving from in front of one open cabinet and one drawer!). I also have a method when I cook or bake that involves making a hot slinging mess across every conceivable surface, <em><strong>but</strong></em>, I clean as I go, so between every dish my kitchen returns to sparkling order. It is my way. Sometimes my husband wants to come in to the middle of the slinging and begin to &ldquo;help&rdquo;. Can I just tell you how insane it makes me? Do you need me to explain, ladies? He means well. He&rsquo;s a great guy who sees a need and wants to fill it. But I don&rsquo;t need &ldquo;help&rdquo;. He doesn&rsquo;t understand my method, doesn&rsquo;t know my &ldquo;rules&rdquo;, doesn&rsquo;t know where things belong, so &ldquo;help&rdquo; turns into a major source of&hellip; well&hellip; not help. We&rsquo;ve come to a good place on this mostly. He asks what he can do, and I ask him to please sit across the bar and keep me company.&nbsp;</p>\n\n<p>Some of you have &ldquo;big helpers&rdquo; called children or grandchildren, and we don&rsquo;t even need to explain that kind of &ldquo;help&rdquo; in the kitchen! It&rsquo;s a delightful sort of help from which afterward we need true deliverance!</p>\n\n<p>So you get my point. I was finding a spark of gratitude deep in my troubled mind when my husband began to &ldquo;help&rdquo; unasked as I was cooking for Christmas day today, and I heard the Lord&rsquo;s words, <em>&ldquo;For My thoughts are not your thoughts, Nor are your ways My ways,&rdquo; declares the LORD.&rdquo;</em> (Isaiah 55:8) I actually had to bite the inside of my cheek to keep from saying them aloud (in a strident and surely unpleasant tone)! I think that for the first time I may actually have a glimmer of true understanding about this verse. I used to think it meant that God is mysterious, incomprehensible, and bigger than my imagination can fathom. But maybe it simply means that He doesn&rsquo;t need my help. I don&rsquo;t understand what He&rsquo;s doing, or how He will do it. I don&rsquo;t know the recipe or the ingredients, so I don&rsquo;t know what to put away and what to leave on the counter. I don&rsquo;t know when the mixing has just begun or is about to conclude. I don&rsquo;t know if the trash needs to be emptied or if this is just the tip of that iceberg. I have no comprehension, and jumping into the middle only makes more inconvenience and creates new problems to solve. I am sure that on occasion He has wanted to give Himself a good head smack over my attempt to &ldquo;help&rdquo;. Or give me one!</p>\n\n<p>Can you think of the last thing you &ldquo;helped&rdquo; God with? My way usually begins with prayer and telling God how I want Him to solve some minor problem I&rsquo;m having. (Uh&hellip;if I know how to solve it, why do I need Him?) Or I&rsquo;m trying to rescue someone from His sovereign plan for their lives. Or I see what I think is His plan in the starting gate so I duck under the bar and run like the wind. I always have good intentions when I pitch in to &ldquo;help&rdquo; God just like my husband does when he helps me, but do I ask first? Do I stand back and watch, at the ready, but out of the way? Do I praise His execution as He whips out a masterpiece? Do I ever just sit in silence and watch Him work, in awe that He works for me? Nope. I just can&rsquo;t sit still. I feel <em><strong>compelled </strong></em>to help. It feels lazy and irresponsible to just sit by while He works. I feel that<em><strong> surely</strong></em>, I must be needed and I have to jump in uninvited and foul up the works, making messes He has to clean up. I&rsquo;m pretty sure that I don&rsquo;t even warrant the affectionate pat on the head and the designation &ldquo;big helper&rdquo;. I&rsquo;m pretty sure He just wants me to let Him do what He does best, in His own kitchen, in His own way, without my &ldquo;help&rdquo;.</p>\n\n<p>Admittedly, it&rsquo;s sometimes hard to know when to help and when to get out of the way, but I find that as in the temporal so in the spiritual, asking goes a long way. Just ask. And then wait to be invited into the process, willing to do whatever He asks, not what you think He needs. Then if you make a mess, it will be because you really were a &ldquo;big helper&rdquo;.</p>"
                 },
                 {
                 "category": "",
                 "topics": [
                            {
                            "ID": "Obedience",
                            "topic": "Obedience"
                            },
                            {
                            "ID": "Israel",
                            "topic": "Israel"
                            }
                            ],
                 "ID": "2005",
                 "summary": "<p>Merriam-Webster&#8217;s Word of the Day was circumlocution-the use of an unnecessarily large number of words to express an idea.&nbsp; There are some situations, however, where using more words is helpful&#8230;or even holy.</p>",
                 "postedDate": 1484596500,
                 "title": "Words for Thought- Circumlocution",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_11.jpg",
                 "authorThumbnailAltText": "Brady Stephenson",
                 "authorName": "Brady Stephenson",
                 "url": "https://www.versebyverseministry.org/devotionals/words-for-thought-circumlocution",
                 "body": "<p>Recently, Merriam Webster&#39;s Word of the Day was <em>circumlocution</em>:</p>\n\n<blockquote>1: the use of an unnecessarily large number of words to express an idea<br />\n2: evasion in speech</blockquote>\n\n<p>&nbsp;</p>\n\n<p>Although M-W&#39;s definition specifies \"the use of an <em><strong>unnecessarily</strong> </em>large number of words,\" there are some situations where it is helpful...or even holy.</p>\n\n<hr id=\"system-readmore\" />\n<p>In Leviticus 22:32, G-d commanded: \"You shall not profane [treat as common] My holy name, but I will be sanctified among the sons of Israel.\"&nbsp; When they heard this command, the Israelites&nbsp;wondered <strong>how</strong> they were supposed to obey it.&nbsp; They decided to use&nbsp;circumlocutions and evasive synonyms to avoid directly using G-d&#39;s Names or titles.&nbsp; If G-d&#39;s Name were written on something that was thrown in the trash, burned, or otherwise defiled, then His Name would be mistreated and profaned!</p>\n\n<p>G-d also commands Israel to talk about Him and His ways frequently: \"You shall speak of them when you sit in your house and when you walk by the way and when you lie down and when you rise up.\" (Deuteronomy 6:6-7)&nbsp; But using G-d&#39;s Name that often would make it part of their ordinary, every-day speech. How were they do obey <em>this </em>commandment <strong>and</strong> the one from Leviticus not to profane His Name?&nbsp; Even in their daily discussions, Jews sanctify G-d&#39;s special Name. For millennia, they have avoided speaking the sacred Name of G-d and instead say HaShem\" (Hebrew for \"The Name\").</p>\n\n<p>After Israel&#39;s return from the Babylonian Exile in the sixth century BCE, Ezra, Nehemiah, and the men of the Great Assembly firmly established circumlocutions as the rule.&nbsp; As a consequence, the Septuagint (the Jewish translation of the Hebrew Scriptures into Greek during the third century BCE) frequently replaces the sacred four-letter Name of G-d with <em>Kurios</em> (\"Lord\"). This replacement is the reason why we often see <em>Yeshua</em> (Jesus) and the disciples referring to G-d as \"the Lord.\"&nbsp; Although the Hebrew Scriptures contain a few circumlocutions (most notably in the Psalms), the New Testament records the Master and the disciples using them regularly.</p>\n\n<p>The most notable circumlocution in the New Testament is \"Father.\" Although the Old Testament never uses \"Father\" to refer to G-d, <em>Yeshua</em> frequently refers to Him as \"your Father who is in heaven\" (Matthew 5:16) or \"your heavenly Father\" (Luke 11:13) and uses other similar paternal evasions.&nbsp; He is the first to use this label and does so to distinguish between Himself and the One Who sent Him. Yeshua came <em>from</em> the Father (John 16:28) and during His time on Earth was <em>subordinate</em> to the Father (John 6:38, Hebrews 10:7, John 14:28, etc.).&nbsp; His first-century audience would have clearly understood the picture of a \"Father\" and \"Son\" origin/subordination but \"Father\" is only used metaphorically.&nbsp; There was no disembodied spirit-father-and-spirit-mother-give-birth-to-a-son scenario since no other deity/\"goddess\" has ever existed (see Isaiah 45:5 and others). Unbelievers have frequently mistaken this metaphor as the New Testament writers importing pagan or Greco-Roman religion in which gods and goddesses often mate and produce offspring.&nbsp; That&#39;s not the case.&nbsp; Messiah simply uses \"Father\" to describe a relationship metaphorically.</p>\n\n<p>The New Testament also records \"Heaven\" as a circumlocution for G-d&#39;s Name.&nbsp; In Luke&#39;s Gospel&mdash;written to a Gentile audience&mdash;Messiah says: \"he who is least in the kingdom of <em><strong>G-d</strong></em> is greater than he.\" (Luke 7:28)&nbsp; However, Matthew&#39;s Gospel&mdash;written to a Jewish audience&mdash;records the same event but the Master&#39;s words are \"the one who is least in the kingdom of <em><strong>heaven</strong> </em>is greater than he.\" (Matthew 11:11)&nbsp; The prodigal son, upon his return to his father&#39;s house in disgrace, declares: \"I have sinned against heaven and against you.\" (Luke 15:21)&nbsp; Did the prodigal son sin against the sky or the stars?&nbsp; No, \"Heaven\" was a typical first-century circumlocution referring to G-d.</p>\n\n<p>Believers today often pray to our \"Heavenly Father\" and encourage one another to seek the \"Kingdom of Heaven\".&nbsp; If we speak in these ways, we sanctify G-d&#39;s Name, follow the example of Scripture, and echo the words of our Lord and Savior.&nbsp; Blessed be His Name.</p>\n\n<p>&nbsp;</p>\n\n<p>&lt;&gt;&lt;</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "1985",
                 "summary": "<p>Ive been reading a book lately that is way above my pay scale, but Im plowing through. From the first chapter it has been all up in my business and Ive had to put it aside several times while I simmer down. It has held a mirror up to a corner of my life that I thought was a non-issue. I am deeply convicted. And deeply conflicted.</p>",
                 "postedDate": 1481230800,
                 "title": "Dragged",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/dragged",
                 "body": "<p>~~It&rsquo;s cold! Really really cold for December in Arkansas. It won&rsquo;t last, but we&rsquo;ve gotten spoiled, and a bitter blast like this unseats us a bit and we whine. I was at the library yesterday watching a young mom with three little ones bundle up after story time to head for home. The littlest one, barely old enough to have more than one word, but knowing it well, began to holler, &ldquo;No!&rdquo; &ldquo;Noooooooooo!!!!&rdquo; &ldquo;Noooo Noooo Noooo!!!!&rdquo; The unfortunate thing for him was that as he skidded into full buck mode and locked the brakes, his mama just lifted him up by the arm until his feet no longer touched the floor and out they went into the brrrrrr. I couldn&rsquo;t say I blamed him. And bless it, he kept it up all the way down the sidewalk without giving an inch except what he was powerless to. I smiled a little to myself remembering those days as a mom and sympathizing with the little one&rsquo;s sentiment when I heard in my head, <em>&ldquo;&hellip;you will stretch out your hands, and someone else will dress you and lead you where you do not want to go.&rdquo; (John 21:18)</em></p>\n\n<p>I&rsquo;ve been reading a book lately that is way above my pay scale, but I&rsquo;m plowing through. From the first chapter it has been all up in my business and I&rsquo;ve had to put it aside several times while I simmer down. It has held a mirror up to a corner of my life that I thought was a non-issue. It&rsquo;s a place that no one in the church has ever mentioned even in passing in all (the few) years I&rsquo;ve been there. And it&rsquo;s sin. Plain and simple. I am deeply convicted. And deeply conflicted. This is one of those things that is easily justified and argued (which is why the church has abdicated its voice), and I believe that if I brought my confusion to anyone else I personally know to be a Christian (with one exception) they would poo-poo it away and tell me to press on undeterred. That&rsquo;s not the answer I need, but it&rsquo;s the one I want, because I am in full buck mode. &lsquo;No! I do not want to go there! I do not want to do that! It&rsquo;s uncomfortable, and I&rsquo;m scared, and I do not trust You to lead me through this!&rsquo; Followed by crushing shame and a heart the longs to repent, but doesn&rsquo;t really know how. (Oh&hellip;I <em><strong>know</strong></em> how&hellip;I just&nbsp;can&#39;t seem to&nbsp;get my mind from a tantrum-level &lsquo;No&rsquo; to a full-on submitted &lsquo;Yes&rsquo;.)</p>\n\n<p>Here&rsquo;s the thing. God never said following Him would be without cost. He said,<em> \"If anyone wants to become my follower, he must <strong>deny himself, take up his cross</strong>, and follow me. For whoever wants to save his life will lose it, but whoever loses his life for my sake will find it. For what does it benefit a person if he gains the whole world but forfeits his life? Or what can a person give in exchange for his life?&rdquo; (Matthew 16:24-26 &ndash; emphasis mine)</em> Well, the cross is an instrument of torture and death, isn&rsquo;t it? What do I expect? It&rsquo;s gonna be hard some days. It&rsquo;s gonna be scary. It&rsquo;s gonna hurt a little (lot), and it may even kill me. So. What? So, what, Melissa?! That&rsquo;s where the rubber meets the road. That &ldquo;what&rdquo; is sadly pretty big to me still when I take its measure, and I&rsquo;ve come to a place in my Christian walk where I expect to be able to keep my &ldquo;what&rdquo; and still call myself God&rsquo;s child. I am a double-minded man.</p>\n\n<p>I&rsquo;ve experienced this before, having a divided mind over a truly simple matter (from God&rsquo;s perspective), my sin nature in full out war with my spiritual nature. I confessed this condition to a friend once when we were driving and she threatened to pull the car over before we got struck by lightning. I absolutely feel <em><strong>torn</strong></em> over this issue, but I&rsquo;ve never known God to abandon His efforts to make me holy when I&rsquo;m in a dither like this. Though I have failed Him in countless ways with compounded interest, and broken His heart by refusing His gifts, He has always brought me to a place where I <em><strong>could</strong></em> repent. I&rsquo;m counting on that mercy again now.</p>\n\n<p>What I want you to hear is that unwaveringly, God is good in the small things, in the big things, and in the monumental things where we are literally at war with ourselves with no hope of Nato intervention. I know you&rsquo;ve been there. Here&rsquo;s what we can both remember,&nbsp;&ldquo;<em>Therefore, since we have so great a cloud of witnesses surrounding us, let us also lay aside every encumbrance and the sin which so easily entangles us, and let us run with endurance the race that is set before us, fixing our eyes on <strong>Jesus, the author and perfecter of faith</strong>, who for the joy set before Him endured the cross, despising the shame, and has sat down at the right hand of the throne of God.&rdquo; (Hebrews 12:1-2 &ndash; emphasis mine)</em> It doesn&rsquo;t take Him by surprise when we find ourselves here, and He knows where we are going and how to get there. We just need to move. Forward. Obediently. Sacrificially, if that&rsquo;s what He asks. Trusting Him with everything we leave behind and everything we face ahead. It&rsquo;s so simple to <em><strong>say</strong></em>, isn&rsquo;t it? Then we actually have to go out into the cold, swinging by one arm as we are led where we do not want to go. Such is the life of faith. But it would be simpler for everyone if we would go without having to be dragged.</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "1958",
                 "summary": "<p>Sometimes when I walk, my husband walks with me. (See my last article for how that goes. Hes a runner. He has very quick pace. Need I say more?) I walk head down, literally, because I cant see much without my glasses and I need to concentrate! He walks head up looking around, noticing things. He often gives me the play-by-play about the morning dog party, what bird is singing, what neighbor is traveling, and yard maintenance. One thing we both notice is a squirrel plummet.</p>",
                 "postedDate": 1475679720,
                 "title": "Squirrel Plummet",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/squirrel-plummet",
                 "body": "<p>~~Sometimes when I walk, my husband walks with me. (See my last article for how that goes. He&rsquo;s a runner. He has very quick pace. Need I say more?) I walk head down, literally, because I can&rsquo;t see much without my glasses and I need to concentrate! He walks head up looking around, noticing things. He often gives me the play-by-play about the morning dog party, what bird is singing, what neighbor is traveling, and yard maintenance. One thing we both notice is a squirrel plummet. Maybe you&rsquo;ve never experienced this. It begins with a frantic scrabbling sound in the trees, followed by a shower of leaves, more desperate clawing sounds, and then a thump as the squirrel plummets from the tree onto the ground.</p>\n\n<p>We always feel so embarrassed for the poor little thing. I mean, it&rsquo;s a squirrel&rsquo;s job to climb a tree. When it goes so terribly wrong, you just hate to draw attention to the failure, you know? They always survive. I&rsquo;ve seen squirrels plummet a <em><strong>very</strong></em> long way to the ground and they always get up, shake their heads a bit, and then go back to work. But it&rsquo;s awkward.</p>\n\n<p>I&rsquo;ve often wondered what the precipitating factor is in causing a squirrel plummet. It could be anything from poor execution to over-reaching. What I really think is that they just take their eye off the goal. I mean, they&rsquo;re squirrels, right? Oh look! There&rsquo;s a nut! And so the plummet begins. I find this so devastatingly true of people too. Life happens. Distractions hit us right in the middle of a double somersault and suddenly we find ourselves on our backs, sucking wind, looking up at the sky wondering what on earth just happened.</p>\n\n<p>This is where you roll your eyes a bit, because what I have to say here is nothing new, nothing foundation shattering. It&rsquo;s what you already know: you have to keep your eye on the goal in order to reach it. That means, in your spiritual life, you have to have your nose in The Book. You have to zero in on the branch you&rsquo;re reaching for, concentrate on the launch, the reach, the grasp, and the landing. You cannot be looking around at all the other nuts you&rsquo;re missing. You have to pick the limb&hellip;and leap!</p>\n\n<p>OK, so you&rsquo;re not a squirrel. Here is what I mean. I have a lot of &ldquo;issues&rdquo;. I struggle with a lot of besetting sins. So many, that I can easily get overwhelmed with the thought of trying to conquer them all as opposed to letting them conquer me, steal my joy, wreck my testimony, dishonor my God, and end my life prematurely. If I choose <em><strong>one</strong></em>, however, and focus on that one, looking at it closely through the magnifying glass of scripture, I can reach my goal. If I get distracted by all the others, or by the much easier and more hedonistically pleasing world around me, I will miss and plummet to the ground in an awkward heap of arms and legs and good intentions. Oh how many times I&rsquo;ve been there, picking myself up, shaking my head, grateful that everyone is pretending not to have noticed.</p>\n\n<p>I&rsquo;d like to say that if I hear you scrabbling for purchase in your tree that I will come to your aid, but usually it&rsquo;s a nearly instantaneous event occurring without warning except for a shower of leaves. It just takes a slight glance to the left and suddenly your mouth is saying things it surely should not be, or your credit card is buying something it surely should not be, or your eyes are looking at something they surely should not be, or your mind is wandering down paths it ought not to take. One momentary loss of focus. And suddenly there is desperate clawing to regain your hold on the branch, the tree, the bark&hellip;anything that will save you from the plummet. I might see your desperation a second or two before the fall, but it will be too late for me to save you. You have to keep your eye on the goal. Only you can do it. Only I can do it.</p>\n\n<p>I think, however, that we can encourage each other in the moments of safety. Something sadly lacking in the squirrel kingdom. When things are going well and life is pretty smooth, that is the time to say to each other, &ldquo;I see you&rsquo;re doing really well with&hellip;&rdquo; and name it. We should tell one another &ldquo;Bravo!&rdquo; &ldquo;Brava!&rdquo; &ldquo;Well done!&rdquo; &ldquo;I see your struggle to maintain your balance on that very small branch to reach that very pretty nut! You&rsquo;re doing so well! Keep it up!&rdquo; Don&rsquo;t you think that would help? Wouldn&rsquo;t you like for someone to notice you doing well, rather than trying to avoid eye-contact after your plummet? I would! So I&rsquo;m going to determine to do just that. I promise to notice you more for your effort to maintain focus, and for your flawless execution. And maybe instead of walking by whistling after noticing you in a heap of defeat, I&rsquo;ll stop to help you untangle yourself, pick the twigs out of your hair, and give you a boost back up in the tree where you belong. It&rsquo;s what we should do for one another, not being actual squirrels and all, and knowing that in turn we&rsquo;d like for someone to come alongside us who also has sucked wind and won&rsquo;t make a big deal about ministering to us in our heap of a fall. Besides, it&rsquo;s never a fatal fall, just a momentary slip that&rsquo;s cushioned by grace&hellip;and a pile of leaves.&nbsp;&nbsp;</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "1951",
                 "summary": "<p>I walk every morning. Every single morning. I cant remember a day that I skipped. I will skip many things, but I dare not skip my walk or I might never get started again  a body in motion and all. I have a love hate relationship with my walk. But what I really hate about the walk is when there are other people out walking at the same time.</p>",
                 "postedDate": 1473694020,
                 "title": "Walk Your Walk",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/walk-your-walk",
                 "body": "<p>~~I walk every morning. Every single morning. I can&rsquo;t remember a day that I skipped. I will skip many things, but I dare not skip my walk or I might never get started again &ndash; a body in motion and all. I have a love hate relationship with my walk. I&rsquo;ve learned that I prefer the blazing sun and 90% humidity to cold, for example. And by cold I mean below 55 degrees. I will walk in the rain without a care, but I will not walk in the snow. I walk on the treadmill with a book in the winter but I try to make myself read non-fiction just as an added layer of self-punishment. Because really, I don&rsquo;t like the walk. I&rsquo;m old. I&rsquo;m tired. I would prefer to be in my bed. But what I really hate about the walk is when there are other people out walking at the same time.</p>\n\n<p>I&rsquo;ve never thought of myself as a competitive person. In fact, I played tennis in high school. Well, at least I tried to. And I love the sport! But if I got down a set to what I knew was a better player I would quietly call them to the net and cede the match. I just didn&rsquo;t care enough to keep playing when I knew I wouldn&rsquo;t win. What&rsquo;s the point? Just end the agony and let&rsquo;s go get a Coke! So it&rsquo;s somewhat surprising to me to find that when other people are out walking at the same time I am, I start to measure my pace to exceed theirs. In fact, I can&rsquo;t walk and listen to music because I will begin to walk in tempo, and that&rsquo;s a bad thing for 50-year-old feet and calf muscles. I guess when I&rsquo;m alone I don&rsquo;t feel the need to prove anything, but when I think someone&rsquo;s watching I will push myself to the point of needing emergency care to prove that I can do more than keep up&hellip;I can beat them! It&rsquo;s ridiculous.</p>\n\n<p>Funny thing, though. I do the same thing in life. Something, again, that comes as a bit of a surprise, but on self-examination, I know is true. When it&rsquo;s just me, I&rsquo;m pretty comfortable with the choices I&rsquo;ve made and the order to my life, but put me in the room with someone else and I start measuring. Not them, mind you. Me. I measure me. And usually I find me lacking.</p>\n\n<p>I have a friend who has three children between kindergarten and junior high ages. She&rsquo;s involved in everything known to exist, from PTA to book clubs. She&rsquo;s on the leadership board at church and works with the local schools providing clothes to kids in need. Oh, and she&rsquo;s adopting. Watching her exhausts me, but I find myself picking up the pace a bit even though I know I can&rsquo;t possibly keep up and honestly don&rsquo;t want to. There&rsquo;s just something in me that continues to push. \"More, Melissa. More, Melissa. More, Melissa. More!!&rdquo; Like the blessed little engine that could!&nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n<p>You too? I think it&rsquo;s a common enough phenomenon. The opposite reaction is to throw up your hands and cede the match, and I think that&rsquo;s pretty common too. We know we can&rsquo;t keep up, so we don&rsquo;t try at all. I&rsquo;d like to tell you that the answer to both is to stop comparing, but you already know that, and if you&rsquo;re able&hellip;well then you should be the one writing here! Since we can&rsquo;t seem to stop comparing, maybe we could find a healthy in-between: not giving up, but not racing each other to the finish line either. What I&rsquo;ve tried to do on my morning walks is just tell myself to walk my walk. &ldquo;Walk <em><strong>your</strong></em> walk, Melissa. <em><strong>Your</strong></em> walk. Not <em><strong>their</strong></em> walk.&rdquo; I think that works pretty well for life and faith too if you can grasp the metaphor. God has called us each to a different pace, to different work, to different lives and relationships. He has given us different gifts, and focus, and tender spots in our hearts. He has asked us to carry different burdens, to shoulder different pain, to endure different hardships. Only He knows the true extent of our effort and determination and success, because He is the one who called us to it. That person walking 4.5 miles per hour might be doing it with absolutely no effort at all because God has given them the ability. While you and your three seemingly&nbsp;measly miles per hour is actually the full expression of every ounce of&nbsp;resolute effort you can give Him. It&#39;s <em><strong>your</strong></em> walk. Not <em><strong>their</strong></em> walk. &nbsp;&nbsp;&nbsp;&nbsp;</p>\n\n<p>No one else is walking your walk. No one else knows how hard it is just to get out there. No one else knows about that charley horse that woke you in agony at two this morning, and the residual fiery pain it left behind that you&rsquo;re limping through. No one knows that you really are going your top speed with your finger on the auto-dial for 911, and that you&rsquo;re out here out of sheer determination that you WILL NOT LAY DOWN AND DIE, but you&rsquo;re giving her all she&rsquo;s got! There isn&rsquo;t any more. If the last stretch up the hill does not do you in, you will consider the battle won for another day. And you will determine to rise again tomorrow to walk&hellip;<em><strong>your</strong></em>&hellip;walk.&nbsp;&nbsp;</p>\n\n<p>If I see you out there and I don&rsquo;t look up, don&rsquo;t take it personally. Head down. Arms pumping. Sweat rolling. Feet moving. I&rsquo;m concentrating. Just trying to walk <em><strong>my</strong></em> walk. It may not set any records, but it&#39;s mine. All mine.</p>"
                 },
                 {
                 "category": "",
                 "topics": [
                            {
                            "ID": "Sin",
                            "topic": "Sin"
                            },
                            {
                            "ID": "Salvation",
                            "topic": "Salvation"
                            }
                            ],
                 "ID": "1901",
                 "summary": "<p>Last month, we pondered life and death from a Biblical perspective but there were some lingering questions about the &#8220;neshamah&#8221; G-d breathed into Adam.</p>\n\n<p>The Hebrew language has two words (neshamah and nephesh) that are translated as &#8220;soul&#8221; in English and both of these are distinct from &#8220;spirit&#8221; (ruach).</p>",
                 "postedDate": 1464738180,
                 "title": "Life and Death- Part 2",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_11.jpg",
                 "authorThumbnailAltText": "Brady Stephenson",
                 "authorName": "Brady Stephenson",
                 "url": "https://www.versebyverseministry.org/devotionals/life-and-death-part-2",
                 "body": "<p>Last month, we pondered life and death from a Biblical perspective&hellip; but there were some lingering questions about the \"<em>neshamah</em>\" G-d breathed into Adam.</p>\n\n<p>The Hebrew language has two words (<em>neshamah</em> and <em>nephesh</em>) that are translated as \"soul\" in English and both of these are distinct from \"spirit\" (<em>ruach</em>).</p>\n\n<p>&nbsp;</p>\n\n<h2>Nephesh</h2>\n\n<p>Here is the first time <em>nephesh</em> is found in the Bible:</p>\n\n<p style=\"font-family: 'Times New Roman', Times, serif;\"><strong><em>Then G-d said, \"Let the waters teem with swarms of living <span style=\"color:red\">creatures</span>, and let birds fly above the earth in the open expanse of the heavens.\" (Genesis 1:20)</em></strong></p>\n\n<p>&nbsp;</p>\n\n<p><em>Nephesh</em> is first translated as \"soul\" several chapters later:</p>\n\n<p style=\"font-family: 'Times New Roman', Times, serif;\"><strong><em>Isaac said, \"Behold now, I am old and I do not know the day of my death. Now then, please take your gear, your quiver and your bow, and go out to the field and hunt game for me; and prepare a savory dish for me such as I love, and bring it to me that I may eat, so that my <span style=\"color:red\">soul</span> may bless you before I die.\" (Genesis 27:2-4)</em></strong></p>\n\n<p>&nbsp;</p>\n\n<p>In some Hebrew texts the <em>nephesh</em> has been called the \"engine of life\". Animals also have <em>nephesh</em> souls (see Genesis 1:20 above). The difference between a <strong>dead</strong> animal and a <strong>live</strong> animal is usually very obvious (possums not withstanding). The \"engine\" is not \"running\" in something that is dead. The <em>nephesh</em> is also sometimes called the \"lower soul\". It is the part of humanity that drives us towards self-preservation and self-enhancement as regards to our physical drives and desires. In human beings this is much like an \"animal instinct\" or \"natural instinct\". As such this \"lower soul\" in humans is also sometimes referred to as the \"animal soul\". For all of you New Testament Greek scholars out there, the equivalent word in Greek is <em>psuche</em>.</p>\n\n<p>I mention all this about the nephesh in order to distinguish it from the <em>neshamah</em>.</p>\n\n<p>&nbsp;</p>\n\n<h2>Neshamah</h2>\n\n<p>In Genesis 2:7, we find that G-d breathed the breath of life ( &#1504;&#1460;&#1513;&#1473;&#1456;&#1502;&#1463;&#1514; &#1495;&#1463;&#1497;&#1468;&#1460;&#1497;&#1501;, <strong><em>nishemat</em></strong> <em>chayyom</em> in Hebrew) into Adam&rsquo;s body that he became a living being&nbsp;( &#1500;&#1456;&#1504;&#1462;&#1508;&#1462;&#1513;&#1473;&nbsp;&#1495;&#1463;&#1497;&#1468;&#1464;&#1492;, l&rsquo;nephesh chayah). In the Hebraic way of thinking, the <em>neshamah</em> is viewed as the \"higher soul\" (versus the <em>nephesh</em>/\"lower soul\"). Animals, too, have a <em>neshamah</em>:</p>\n\n<p style=\"font-family: 'Times New Roman', Times, serif;\"><strong><em>All flesh that moved on the earth perished, birds and cattle and beasts and every swarming thing that swarms upon the earth, and all mankind; <span style=\"color:red\">of all that was on the dry land, all in whose nostrils was the breath [<em>neshamah</em>] of the spirit [ruach] of life, died</span>. (Genesis 7:21-22)</em></strong></p>\n\n<p>&nbsp;</p>\n\n<p>Sometimes we see a \"nobler\" side in mammals than we do in fish, birds, and reptiles. Dogs, horses, dolphins, and other animals at times exhibit behavior that is above their animal nature.</p>\n\n<p>Humans, too, can act in a manner above our base, sinful&nbsp;state via this \"higher soul\" because it is pure and created by G-d and allows us to connect with Him. The morning prayers of Jews from ancient times (including the disciples and likely Christ, Himself) include this:</p>\n\n<p><strong>My G-d, the soul [<em>neshamah</em>] which you have placed within me is pure. You have created it, you have formed it, and you have breathed it into me. You preserve it within me and one day you will take it from me and restore it to me in the awaited future.</strong></p>\n\n<p>&nbsp;</p>\n\n<p>Imagine the umbilical cord that connects a mother&rsquo;s womb to her unborn child. It is the channel through which life flows from the life-giver to the child. In a similar fashion the <em>neshamah</em> connects us with G-d. Life flows from the Life-Giver to the child of G-d. But in our sinful state, that link has been severed and the connection no longer exists. Yes, we still have life via our <em>nephesh</em> but our <em>neshamah</em> is broken. It is only if we are \"born again\" or \"born of the Spirit\" (as Messiah says in John 3) that our <em>neshamah</em> is restored in Christ that we \"may have life, and have it abundantly\" (John 10:10).</p>\n\n<p>So let&rsquo;s recap: the life G-d created in Adam included a direct connection with G-d (<em>neshamah</em>) between Adam&rsquo;s flesh and G-d&rsquo;s Spirit but that connection was broken as a result of sin. Humanity cannot fix this broken connection on our own so Christ paid the price for our sin and the Holy Spirit restores that connection. \"For the wages of sin is death, but the free gift of God is eternal <strong>life</strong> in Christ Jesus our Lord.\" (Romans 6:22) &ndash; We have a restored and eternal connection with G-d&hellip; in Christ Jesus.</p>\n\n<p style=\"font-family: 'Times New Roman', Times, serif;\"><strong><em>For while I was passing through and examining the objects of your worship, I also found an altar with this inscription, &#39;TO AN UNKNOWN GOD.&#39; Therefore what you worship in ignorance, this I proclaim to you. The G-d who made the world and all things in it, since He is Lord of heaven and earth, does not dwell in temples made with hands; nor is He served by human hands, as though He needed anything, since He Himself gives to all people<span style=\"color:red\"> life and breath</span> and all things; and He made from one man every nation of mankind to live on all the face of the earth, having determined their appointed times and the boundaries of their habitation, that they would seek G-d, if perhaps they might grope for Him and find Him, though He is not far from each one of us;<span style=\"color:red\"> for in Him we live and move and exist</span>, as even some of your own poets have said, &#39;For we also are His children.&#39; (Acts 17:23-28)</em></strong></p>\n\n<p style=\"font-family: 'Times New Roman', Times, serif;\"><strong><em>&#8203; </em></strong></p>\n\n<p>May we all live and move and exist in a way that acknowledges our connection to the King and honors Him, the Holy One, blessed be He.</p>\n\n<p>&nbsp;</p>\n\n<p>&lt;&gt;&lt;</p>\n\n<p>&nbsp;</p>\n\n<p><a href=\"https://plus.google.com/+BradyStephenson_TX?rel=author\" style=\"visibility: hidden;\">Brady on Google Plus</a></p>"
                 },
                 {
                 "category": "",
                 "topics": [
                            {
                            "ID": "False+Teachers",
                            "topic": "False Teachers"
                            }
                            ],
                 "ID": "1882",
                 "summary": "<p>The Bible speaks a lot about false teachers.&nbsp; The Lord gives us ways to spot them, but here&#8217;s a more recent one you may not have considered.</p>",
                 "postedDate": 1463292660,
                 "title": "Warning Signs",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_13.jpg",
                 "authorThumbnailAltText": "Brian Smith",
                 "authorName": "Brian Smith",
                 "url": "https://www.versebyverseministry.org/devotionals/warning-signs",
                 "body": "<p style=\"text-align: justify;\">I&rsquo;ve always liked the comic strip The Far Side, by Gary Larson.&nbsp; In one of his comics, he shows how God (he calls it nature) provides warnings signs for things we should not touch (pictured).</p>\n\n<p style=\"text-align: justify;\"><img alt=\"\" src=\"https://s-media-cache-ak0.pinimg.com/736x/96/1c/f7/961cf793b432ebf66286ad5b98d55dc0.jpg\" style=\"width: 350px; height: 440px; float: right; margin: 15px;\" /></p>\n\n<p style=\"text-align: justify;\">False teachers are not always so easy to spot.&nbsp; As we read in 2 Corinthians 11:</p>\n\n<p style=\"text-align: justify;\">&ldquo;<em>12 But what I am doing I will continue to do, so that I may cut off opportunity from those who desire an opportunity to be regarded just as we are in the matter about which they are boasting. 13 For such men are false apostles, deceitful workers, disguising themselves as apostles of Christ. 14 No wonder, for even Satan disguises himself as an angel of light. 15 Therefore it is not surprising if his servants also disguise themselves as servants of righteousness, whose end will be according to their deeds</em>.&rdquo;</p>\n\n<p style=\"text-align: justify;\">Unlike a cat with an arched back, false teachers come as an &ldquo;angel of light&rdquo;, seeking to deceive believers to have them follow them.&nbsp; While difficult to detect, God does give us ways to determine if a person is a false teacher.&nbsp; As in the passage above, we will know them by their deeds.</p>\n\n<p style=\"text-align: justify;\">Perhaps you have noticed, however, that there seems to be another warning sign to which we should pay attention, one I believe God has given us.&nbsp; In addition to their deeds, have you noticed that false teachers tend to name their ministries after themselves?&nbsp; I have not done an exhaustive search, so I&rsquo;m sure there are some exceptions.&nbsp; Still, it&rsquo;s hard to deny this.</p>\n\n<p style=\"text-align: justify;\">Why would false teachers do this?&nbsp; It&rsquo;s to draw you away after themselves, and not the Lord.&nbsp; Acts 20 says, &ldquo;<em>29 I know that after my departure savage wolves will come in among you, not sparing the flock; 30 and from among your own selves men will arise, speaking perverse things, to draw away the disciples after them</em>.&rdquo;&nbsp; Paul also speaks about this in 1 Corinthians 1:</p>\n\n<p style=\"text-align: justify;\">&ldquo;<em>10 Now I exhort you, brethren, by the name of our Lord Jesus Christ, that you all agree and that there be no divisions among you, but that you be made complete in the same mind and in the same judgment. 11 For I have been informed concerning you, my brethren, by Chloe&rsquo;s people, that there are quarrels among you. 12 Now I mean this, that each one of you is saying, &ldquo;I am of Paul,&rdquo; and &ldquo;I of Apollos,&rdquo; and &ldquo;I of Cephas,&rdquo; and &ldquo;I of Christ.&rdquo; 13 Has Christ been divided? Paul was not crucified for you, was he? Or were you baptized in the name of Paul</em>?&rdquo;</p>\n\n<p style=\"text-align: justify;\">We are to be unified as the body of Christ.&nbsp; True teachers will preach the word and will not bring the focus of their ministry on themselves, for it is by the preaching of the word that we are made complete in the same mind and the same judgment.&nbsp; False teachers, on the other hand, lead you away from Christ.&nbsp; Their focus is on themselves, as we read in Jude:</p>\n\n<p style=\"text-align: justify;\">&ldquo;<em>10 But these men revile the things which they do not understand; and the things which they know by instinct, like unreasoning animals, by these things they are destroyed. 11 Woe to them! For they have gone the way of Cain, and for pay they have rushed headlong into the error of Balaam, and perished in the rebellion of Korah. 12 These are the men who are hidden reefs in your love feasts when they feast with you without fear, caring for themselves; clouds without water, carried along by winds; autumn trees without fruit, doubly dead, uprooted; 13 wild waves of the sea, casting up their own shame like foam; wandering stars, for whom the black darkness has been reserved forever</em>.&rdquo;</p>\n\n<p style=\"text-align: justify;\">So, the next time you come across a ministry named after the person, beware!&nbsp; Consider that a warning sign the Lord has provided.&nbsp; Again, while this is not always the case, you should be on the alert, making sure this is a teacher who wants to help you grow in the grace and knowledge of our Lord and Savior, Jesus Christ.</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "1832",
                 "summary": "",
                 "postedDate": 1460398920,
                 "title": "Join us for the next chapter",
                 "authorThumbnailSource": "",
                 "authorThumbnailAltText": "VBVM Staff",
                 "authorName": "VBVM Staff",
                 "url": "https://www.versebyverseministry.org/devotionals/join-us-for-the-next-chapter",
                 "body": "<p><span style=\"line-height: 1.6em;\">Nearly thirteen years ago, I&nbsp;accidentally&nbsp;founded&nbsp;<a href=\"http://www.vbvmi.org\" target=\"_blank\">Verse By Verse Ministry International.</a>&nbsp;</span><br />\n<br />\n<span style=\"line-height: 1.6em;\">In 2003, I was teaching verse-by-verse Bible studies when a member of my class asked for a copy of my teaching. I wasn&rsquo;t yet in the habit of making&nbsp;notes, so I offered to record my teaching on a CD. I bought a cheap microphone&nbsp;and&nbsp;was soon distributing handfuls of CDs to members of the class.&nbsp;</span><br />\n<br />\n<span style=\"line-height: 1.6em;\">I continued to make CDs for a year or so until the volume of requests became too great for me to handle comfortably. In 2004, I decided to build a small website where I could host my recordings online for students to download. At that point, my online audience consisted only of those students who also attended my class.&nbsp;</span><br />\n<br />\n<span style=\"line-height: 1.6em;\">After two years, I began to notice&nbsp;<strong>people around the world visiting my website and downloading content in increasing volumes.&nbsp;</strong>Though mystified by this trend, I responded by building a newer, better website to handle the traffic, which led the online audience to grow even more. Soon, listeners began asking how to&nbsp;support&nbsp;the &ldquo;ministry&rdquo; financially. When checks began to show up in the mail, I finally recognized that my little classroom website had become something much bigger.&nbsp;Verse By Verse Ministry International&nbsp;was born.</span><br />\n<br />\n<span style=\"line-height: 1.6em;\"><strong>God has an amazing way of magnifying our meager, unplanned efforts into something well beyond our imagination.</strong>&nbsp;I never planned to run an international Bible teaching ministry, and I certainly had no qualifications to pursue such an ambitious goal. I was merely a husband and father who had only recently come to faith in Jesus Christ himself. During those early years, I was preoccupied with living a middle class lifestyle attending church on Sundays while working to support my family. I certainly gave no thought to the prospect of full-time ministry.&nbsp;The Lord had a different plan.</span><br />\n<br />\n<span style=\"line-height: 1.6em;\"><strong>After a few years, I found myself pastoring a small church, running a growing nonprofit ministry, teaching several Bible studies weekly and traveling monthly to distant countries &ndash; all while still working full time to support my family.&nbsp;</strong>Juggling these demands for the past decade has been difficult, but the experience has taught me valuable lessons of diligence, sacrifice, persistence and self-discipline.&nbsp;<strong>The Lord has grown my faith and my understanding of His word while revealing the true cost of discipleship.</strong></span><br />\n<br />\n<span style=\"line-height: 1.6em;\">These years have been my seminary, my missionary training and my wilderness wandering, and while I am grateful for what I&rsquo;ve learned, it&rsquo;s time to take the next step in following the Lord.&nbsp;<strong>I&rsquo;m pleased to announce I&rsquo;ve stepped away from corporate employment to work full time for VBVMI.</strong> I&rsquo;m overjoyed for the opportunity to devote all my time and energy to the work of this ministry and to serving as pastor of my church (to say nothing of serving my family).</span><br />\n<br />\n<span style=\"line-height: 1.6em;\">Thank you all for your devotion to His holy word and the prayers and support you&#39;ve offered along the way. I anticipate the Lord will take this step of faith and magnify it to His glory, and I can&rsquo;t wait to see where it leads.&nbsp;<strong>I hope you will continue on this journey with me, because He can do so much with even a small step of faith.</strong>&nbsp;</span><br />\n<br />\n<span style=\"line-height: 1.6em;\">With eternal thanks, your fellow servant in Christ,</span></p>\n\n<p>Steve</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "1824",
                 "summary": "<p>Ive been  is meditating too New Age to say  ruminating on my last article and the fact that I believe its truth but I still cant do it effectively. Im trying. Im really determined to let God accomplish some things in me, and thats a biggie.</p>",
                 "postedDate": 1459967160,
                 "title": "Termite Infestation",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/termite-infestation",
                 "body": "<p>~~I looked up from just having snuggled my head down into my pillow and saw a dark spot on the wall opposite me. I told my husband to kill that bug. I only thought it was a bug. I can&rsquo;t actually see that far. He gave it some inspection (always quick to save from a merciless death sentence any poor creature foolish enough to wander into my home) and declared, &ldquo;It&rsquo;s not a bug. I don&rsquo;t know what it is.&rdquo; He gave it a swipe with a tissue and we turned off the light.</p>\n\n<p>Next morning, there it is again. Now the geek goggles come out along with the stepladder and eventually a pair of tweezers to pinch the head of&hellip; a termite. I am not even kidding. I can&rsquo;t even tell you... By 10 am the exterminator was in my house.</p>\n\n<p>I&rsquo;ve been &ndash; is meditating too New Age to say &ndash; ruminating on my last article and the fact that I believe it&rsquo;s truth but I still can&rsquo;t do it effectively. I&rsquo;m trying. I&rsquo;m really determined to let God accomplish some things in me, and that&rsquo;s a biggie. Here&rsquo;s the thing: most of the time I <em><strong>seem</strong></em> like I&rsquo;ve got it together on the outside, but there are termites on the inside wreaking havoc.</p>\n\n<p>Termites are easy to ignore because you can&rsquo;t see them. That is, until they start looking for an escape hatch (Let&rsquo;s <em><strong>not</strong></em> ruminate on <em><strong>that</strong></em>!), or until they&rsquo;ve done so much damage that it begins to make little ripples in the flesh of the wood. (OK, ICK!) Truth is, sin is doing the same work in me, and even if no one else can see it, I know it&rsquo;s in there eating away at all I&rsquo;ve labored to build into a strong spiritual structure. Eventually, and it probably won&rsquo;t take much time or pressure, that damage will become evident to even the most casual observer and all I&rsquo;ve worked to keep under wraps will come pouring out. I can patch and paint my drywall and pretend like those nasty little buggars aren&rsquo;t behind the cosmetics, but that doesn&rsquo;t mean they&rsquo;re gone. It only means I&rsquo;m ignoring them to my own detriment. Same with sin. And that escape hatch they need?? Confession.</p>\n\n<p>I think mutual confession is the terminator of all pests in our spiritual life. If you&rsquo;ve never tried it, I can heartily recommend it. Once you make confession to a trusted (and that is key!) brother or sister in Christ, it&rsquo;s like opening up that infested wall and letting all the critters out into the room for stomping. (OK, ICK AGAIN!) And it allows you to begin to repair and rebuild what has been destroyed. Besides, when you&nbsp;confess your termite infestation, and you demonstrate the humility of asking for prayer, help, and accountability, the other person will feel safe to do the same, and voila&hellip;dead termites and restored strength times two!</p>\n\n<p>I think that&rsquo;s clear enough. And it didn&rsquo;t even cost you $1250. Sigh. Anyone in the market for a nice three-bedroom?</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "1823",
                 "summary": "<p>What is life?&nbsp; What is death?&nbsp; We should have a Biblically-based understanding of these things.</p>",
                 "postedDate": 1459907520,
                 "title": "Life and Death",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_11.jpg",
                 "authorThumbnailAltText": "Brady Stephenson",
                 "authorName": "Brady Stephenson",
                 "url": "https://www.versebyverseministry.org/devotionals/life-and-death",
                 "body": "<p>A few weeks ago our Sabbath dinner conversation turned to deep questions: What is life? What is death?</p>\n\n<p>I didn&rsquo;t have a solid answer readily at hand. As a believer, I know we should have a Biblically-based understanding of such things, so I started at the beginning of Scripture&hellip; with Adam.</p>\n\n<p style=\"font-family: 'Times New Roman', Times, serif;\"><strong><em>Then the Lord God formed man of dust from the ground, and breathed into his nostrils the breath of life; and man became a living being. (Genesis 2:7)</em></strong></p>\n\n<p>Consider those unique moments of Creation when Adam was made. In the time between the formation of Adam&rsquo;s flesh and when G-d breathed into his nostrils, his body was 100% human and 100% flawless, undefiled, and uncorrupted&hellip; and yet not fully alive. It was only <em>after </em>G-d breathed the breath of life ( &#1504;&#1460;&#1513;&#1473;&#1456;&#1502;&#1463;&#1514; &#1495;&#1463;&#1497;&#1468;&#1460;&#1497;&#1501;, <em>nishemat chayyom </em>in Hebrew) into Adam&rsquo;s body that he became a living being ( &#1500;&#1456;&#1504;&#1462;&#1508;&#1462;&#1513;&#1473; &#1495;&#1463;&#1497;&#1468;&#1464;&#1492;, <em>l&rsquo;nephesh chayah</em>).</p>\n\n<p>I think of it like a basic algebra equation: the body + the breath of life = a living being.</p>\n\n<p>A+B=C&hellip; simple, right?</p>\n\n<p>It is as if G-d zippered the body and the breath together in order to create a living being. Perhaps this is what King David meant when he wrote \"You knit me together in my mother&rsquo;s womb.\" (Psalm 139:13). Someone who is alive has both a body and the breath of life. If you are missing one or the other then you aren&rsquo;t alive.</p>\n\n<p>At the other end of the Good Book, we find the story of the two witnesses who will prophesy for the Lord and then be slain by the beast that comes up out of the abyss (Revelation 11:7). They are dead for three and a half days and then that same \"breath of life\" from G-d restores them to life (Revelation 11:11).</p>\n\n<p>We find throughout Scripture that most individuals die of disease, injury, or old age. In all of these situations, the \"body\" side of the zipper is damaged and cannot stay zippered together. In other situations, we find otherwise healthy individuals who die because G-d takes their life (for example, Ananias and Sapphira in Acts 5). The two parts of their zipper were in good condition&hellip; G-d just \"unzips\" them because of their sin against the Spirit.</p>\n\n<p>What is this \"neshamah\" that G-d breathed into Adam? Is it the same \"breath of life\" that the animals of Noah&rsquo;s ark had (Genesis 7:15)? Is it <em>physical </em>breath or <em>spiritual</em>? What happens if we hold our breath? Are we temporarily \"dead\" until we breathe again?</p>\n\n<p>We&rsquo;ll take a look at those questions next month.&nbsp; Shalom!</p>\n\n<p>&lt;&gt;&lt;</p>\n\n<p>&nbsp;</p>\n\n<p><a href=\"https://plus.google.com/+BradyStephenson_TX?rel=author\" style=\"visibility: hidden;\">Brady on Google Plus</a></p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "1816",
                 "summary": "<p> You cant know the weight of the arguments, the strength of the resistance, the hatred and narrow-mindedness and reverse-bigotry behind this young cultural movement for tolerance. Its so far more than anything we faced when we were 18. The message is that you will be tolerant, or you will be silenced, and if you cant be silenced, well, then, you can die. The ironic hypocrisy would be funny, except that its scary, and its coming from intelligent people with powerful voices whose arguments sound like, we should all love one another, but is really, conform, or else.</p>",
                 "postedDate": 1459266960,
                 "title": "Speak To Be Heard",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/speak-to-be-heard",
                 "body": "<p>~~My son has been writing for a national online college newspaper. I&rsquo;m so proud of him finding his voice and the courage to make it heard. He&rsquo;s a college student; what first year college student has a shortage of opinions? I can remember the thing I was most passionate about for the short time it dominated the news when I was a college freshman was Miss America&rsquo;s scandalous photos. That was a different age, for sure.</p>\n\n<p>Today Wil experienced his first rejection. Here&rsquo;s the irony: he was writing about how society has told him that his Christian, cisgendered (you&rsquo;ll have to look that one up&hellip;I just can&rsquo;t even&hellip;), white male opinion is bigotry, plain and simple, and he is not entitled to have a voice in response to the culture he lives in. His editors confirmed that by calling his article &ldquo;hate speech&rdquo;. Ah yes&hellip;censorship at its finest.</p>\n\n<p>&nbsp;You can&rsquo;t know the weight of the arguments, the strength of the resistance, the <em><strong>hatred </strong></em>and narrow-mindedness and reverse-bigotry behind this young cultural movement for &ldquo;tolerance&rdquo;. It&rsquo;s so far more than anything we faced when we were 18. The message is that you<em><strong> will </strong></em>be tolerant, or you will be silenced, and if you can&rsquo;t be silenced, well, then, you can <em><strong>die</strong></em>. I&rsquo;m not even kidding. (You can google the words &ldquo;die cis scum&rdquo; if you are interested, and if you dare.) The ironic hypocrisy would be funny, except that it&rsquo;s scary, and it&rsquo;s coming from intelligent people with powerful voices whose arguments sound like, &lsquo;we should all love one another&rsquo;, but is really, &lsquo;conform, or else&rsquo;.</p>\n\n<p>I know I&rsquo;m mostly preaching to the choir here, but in case I&rsquo;m not, here are some things to consider. If you don&rsquo;t like someone calling you ugly names, don&rsquo;t call them ugly names. If you want your voice to be heard, then be willing to hear someone else&rsquo;s (even if you disagree&hellip;that&rsquo;s allowed&hellip;it doesn&rsquo;t even make you a militant extremist!). If you don&rsquo;t want someone to generalize, marginalize, and gag &ldquo;your people&rdquo;, then don&rsquo;t do it to other people, categorizing them into groups and denouncing them as bigots, haters, oppressors, or whatever, and telling them to shut up. Really, it&rsquo;s as simple as that. By doing anything different, by closing yourself off to the dialogue, you become what you deride.</p>\n\n<p>I counseled my son to pray before he implemented his hasty threat to quit writing for the publication and decide whether he still has a voice that can affect his readers for the Kingdom. He sees revision and rewriting as compromising his own voice, and I agree, but I think there&rsquo;s a way to speak to be heard even in the face of enmity. He just has to find it. And there it is: so do we.</p>\n\n<p>Hear me now&hellip;<em><strong>this is the hardest thing for me</strong></em>!! I understand on an intellectual level that my &ldquo;enemy&rdquo; is lost, blinded, and under the control of our enemy. I get it. But that does not make me love them&hellip;I so wish it did. I am far too much like Jonah, deciding from a place of hurt and fear and self-defense that they are not <em><strong>deserving</strong></em> of Christ&rsquo;s sacrifice, but God&rsquo;s grace is for all. If it is for me (seriously!), it is for them. I cannot withhold the answer to a problem they can&rsquo;t even perceive because I&rsquo;m angry about the characterization I will acquire as a result of sharing it. I can&rsquo;t sit on a hill outside the city and wait for them to burn. I should not even want to. Heaven help me.</p>\n\n<p>I know I&rsquo;m not alone in my dichotomous feelings because the Spirit is losing to the flesh in the push / pull we all experience as we attempt to live in a manner worthy of our calling. I know that because of what I see and hear around me. Christians react to this conflict of &ldquo;tolerance&rdquo; with ugly rhetoric and diatribes that are beyond the understanding of &ldquo;those who are perishing&rdquo;. We feel like my son, that the compromise inherent in &ldquo;loving&rdquo; our enemy means that we must condone their sin, validate their beliefs, and sacrifice our own, and so we react instead with anger and defensiveness. We behave as if dissension is a threat to our faith. It may be a threat to our <em><strong>practice</strong></em>, but only we can forfeit what we believe. So if there is only perceived threat, why the rage? We&rsquo;ve all read the end of the book&hellip;right? This particular turn of events should not surprise us. It should perhaps even move us to rejoice that surely the coming of the Lord is near! Instead, we stew, and we cocoon, and we rant while hiding behind our social media shield because we know that we&rsquo;re right in theory, but we&rsquo;re afraid.</p>\n\n<p>Before you can throw out righteous anger as an argument, I will respond by saying preemptively that the only person who can demonstrate that in true holiness is Christ. When we support our sin with that foundation, as if we are justified for our bad behavior and hatred toward our enemies, it only solidifies their argument and proves their characterization.</p>\n\n<p>And let&rsquo;s get real here&hellip;shoot&hellip;we can&rsquo;t even offer <em><strong>scriptural</strong></em> correction<em><strong> in the church </strong></em>anymore for fear of being labeled &ldquo;judgmental&rdquo;. If <em><strong>we</strong></em> can&rsquo;t accept correction according to our own tenents&hellip;how can we offer it, or expect it to be received by a world that does not even share what we <em><strong>claim</strong></em> is truth?<br />\nTalk about hypocrisy.</p>\n\n<p>So how do we learn to speak to be heard? I think it&rsquo;s the age old answer of humility. &ldquo;But for the grace of Christ, go I.&rdquo; Who is the worst sinner you know? The answer should be staring at you from the mirror. You know you better than you know anyone else. If you can examine your own heart and not find the blackest spot of sin, not understand that the whip and the hammer were in <em><strong>your</strong></em> hand, then you are not ready to engage this culture with truth&hellip;because you haven&rsquo;t found it. It&rsquo;s a daily thing, this personal wrecking, and if you believe you&rsquo;re going to say something the world will listen to without doing that work first, you&rsquo;re bound to be disappointed. And they are bound to label you a self-righteous bigot.</p>\n\n<p>See, I believe that success in this cultural conversation begins somewhere at the intersection of true brokenness and love, where we understand ourselves well enough to find love for one another. What I want for myself, I should pursue for my friend, my enemy&hellip;at all personal cost. Bearing all offense. Taking on the very nature of Christ &ndash; a slave to the salvation and <em><strong>freedom</strong></em> of men, emptied of my self, my voice, my message, my agenda &ndash; filled with the purpose of the Kingdom: to plead for reconciliation with God.</p>\n\n<p>Tall orders, but from here we can speak to be heard. Only from here.</p>\n\n<p>Am I there yet? Well, if you could hear a snort on paper it would be here. I am still a resounding gong and a clanging cymbal. I&rsquo;m still angry and defensive and afraid. I&rsquo;m still full of pride and self-stuff. I&rsquo;m hopeful, however, that since the Lord has shown me the way, He will also conform me to this image as I choose moment by moment to release to Him the stuff cluttering up my heart and trust Him with the outcome of seizing the opportunity to speak to be heard.</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "1812",
                 "summary": "<p>Does Israel need to hear the gospel, or has God already saved them under a different covenant?&nbsp; The Catholic church (and even some Protestants) believes the latter.&nbsp; What do the Scriptures say?</p>",
                 "postedDate": 1458612300,
                 "title": "The Catholic Churchs Denial that the Gospel is for the Jews",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_13.jpg",
                 "authorThumbnailAltText": "Brian Smith",
                 "authorName": "Brian Smith",
                 "url": "https://www.versebyverseministry.org/devotionals/the-catholic-churchs-denial-that-the-gospel-is-for-the-jews",
                 "body": "<p style=\"text-align: justify;\">&ldquo;<em>15 &ldquo;Beware of the false prophets, who come to you in sheep&rsquo;s clothing, but inwardly are ravenous wolves. 16 You will know them by their fruits.&nbsp; Grapes are not gathered from thorn bushes nor figs from thistles, are they?&nbsp; 17 So every good tree bears good fruit, but the bad tree bears bad fruit.&nbsp; 18 A good tree cannot produce bad fruit, nor can a bad tree produce good fruit.&nbsp; 19 Every tree that does not bear good fruit is cut down and thrown into the fire.&nbsp; 20 So then, you will know them by their fruits</em>.&rdquo; (Matthew 7)</p>\n\n<p style=\"text-align: justify;\">Our Lord warned us about false prophets, a warning we should take very seriously.&nbsp; The false prophets of the Old Testament would twist God&rsquo;s word, or claim God said something He did not.&nbsp; Similarly, today&rsquo;s false prophets do the same.&nbsp; One issue that has been around for a while is how will God save the Jews, His people Israel.&nbsp; There are those who falsely claim that God has saved the Jews and we do not need to evangelize to them.&nbsp; An example is a <a href=\"http://www.nowtheendbegins.com/pages/deception/john-hagee-and-dual-covenant-theology.htm\">well known mega-church pastor who teaches such falsehoods</a>.&nbsp; In an interview in the Houston Chronicle, he said this about Israel:</p>\n\n<p style=\"text-align: justify;\">&ldquo;The Jewish people have a relationship to God through the law of God as given through Moses. &nbsp;I believe that every Gentile person can only come to God through the cross of Christ. I believe that every Jewish person who lives in the light of the Torah, which is the word of God, has a relationship with God and will come to redemption.&nbsp; The law of Moses is sufficient enough to bring a person into the knowledge of God until God gives him a greater revelation. &nbsp;And God has not.&nbsp; Trying to convert Jews is a waste of time. &nbsp;The Jewish person who has his roots in Judaism is not going to convert to Christianity. &nbsp;There is no form of Christian evangelism that has failed so miserably as evangelizing the Jewish people. &nbsp;They (already) have a faith structure.&nbsp; Everyone else, whether Buddhist or Baha&#39;i, needs to believe in Jesus. &nbsp;But not Jews. &nbsp;Jews already have a covenant with God that has never been replaced by Christianity.&rdquo;</p>\n\n<p style=\"text-align: justify;\">This teaching is clearly un-Biblical and therefore false.&nbsp; Such is the fruit of false teachers.&nbsp; Not surprisingly, the Catholic church teaches almost the identical falsehoods about Israel.&nbsp; We should expect this, since it&rsquo;s the same enemy behind each of these false teachers.</p>\n\n<p style=\"text-align: justify;\">In December, 2015 the Catholic church published a <a href=\"http://www.vatican.va/roman_curia/pontifical_councils/chrstuni/relations-jews-docs/rc_pc_chrstuni_doc_20151210_ebraismo-nostra-aetate_en.html\">report</a> called &ldquo;<em>THE GIFTS AND THE CALLING OF GOD ARE IRREVOCABLE:&nbsp; A REFLECTION ON THEOLOGICAL QUESTIONS PERTAINING TO CATHOLIC&ndash;JEWISH RELATIONS ON THE OCCASION OF THE 50TH ANNIVERSARY OF \"NOSTRA AETATE\" (NO.4)</em>&rdquo;.&nbsp; The report discusses several things about Catholic-Jewish relations, but most importantly, they discuss how they believe the Jews will be saved.&nbsp; The way the Catholic church views the Jewish people is confused at best.&nbsp; While the report says some things about the Jews that are accurate from a Biblical perspective, they have it completely wrong on the most important thing, not only for Jews, but for all people:&nbsp; salvation.&nbsp; As we&rsquo;ll see below, the Catholic church is a false teacher, just like others who teach falsely about Jewish salvation, as we saw above.</p>\n\n<p style=\"text-align: justify;\">The Catholic report was written on the 50th anniversary of something the Vatican wrote at Vatican II about the Jewish people.&nbsp; Part of the reason for that document, and this one as well in my view, was to help repair the Catholic church&rsquo;s generally bad historical treatment of Jews.&nbsp; Sadly, many Jews even today are against Christianity due to things the Catholic church did to the Jewish people, not realizing that Catholicism is not true Christianity.</p>\n\n<p style=\"text-align: justify;\">Nonetheless, as mentioned above, the report does get some things correct.&nbsp; Yet, they confuse other things about Israel.&nbsp; A good example is the following paragraph:</p>\n\n<p style=\"text-align: justify;\">&ldquo;The Church is called the new people of God (cf. \"Nostra aetate\", No.4) but not in the sense that the people of God of Israel has ceased to exist. The Church \"was prepared in a remarkable way throughout the history of the people of Israel and by means of the Old Covenant\" (\"Lumen gentium\", 2). The Church does not replace the people of God of Israel, since as the community founded on Christ it represents in him the fulfilment of the promises made to Israel. This does not mean that Israel, not having achieved such a fulfilment, can no longer be considered to be the people of God. \"Although the Church is the new people of God, the Jews should not be presented as rejected or accursed by God, as if this followed from the Holy Scriptures\" (\"Nostra aetate\", No.4).&rdquo;</p>\n\n<p style=\"text-align: justify;\">Scripture does not call the church the &ldquo;new people of God&rdquo;.&nbsp; There is only \"people of God\" in God&rsquo;s plan of redemption, and all are saved solely by faith in Christ.&nbsp; Consider for example, Abel.&nbsp; Hebrews 11:4 says Abel was righteous &ldquo;by faith&rdquo;; clearly, Abel lived well before God brought forth the people of Israel.&nbsp; Likewise, Noah found favor with God (Genesis 6:8), again by faith (Hebrews 11:7).&nbsp; Indeed, all through human history, God has built His church by divinely electing those whom He has given faith to believe in Him.&nbsp; This includes all who lived before Israel, certain people of Israel, as well as Gentiles.</p>\n\n<p style=\"text-align: justify;\">However, they do get it right when they say the church does not replace Israel.&nbsp; The fundamental flaw in their logic, ironically, is that they separate how God will save the church and Israel the nation.&nbsp; They do this by referring to Romans 11:29, which in context says:</p>\n\n<p style=\"text-align: justify;\">&ldquo;<em>25 For I do not want you, brethren, to be uninformed of this mystery&mdash;so that you will not be wise in your own estimation&mdash;that a partial hardening has happened to Israel until the fullness of the Gentiles has come in; 26 and so all Israel will be saved; just as it is written, &ldquo;The Deliverer will come from Zion, He will remove ungodliness from Jacob.&rdquo;&nbsp; 27 &ldquo;This is My covenant with them, When I take away their sins.&rdquo;&nbsp; 28 From the standpoint of the gospel they are enemies for your sake, but from the standpoint of God&rsquo;s choice they are beloved for the sake of the fathers; <strong>29 for the gifts and the calling of God are irrevocable</strong>.&nbsp; 30 For just as you once were disobedient to God, but now have been shown mercy because of their disobedience, 31 so these also now have been disobedient, that because of the mercy shown to you they also may now be shown mercy. 32 For God has shut up all in disobedience so that He may show mercy to all</em>.&rdquo; (my emphasis added)</p>\n\n<p style=\"text-align: justify;\">It&rsquo;s true that God has promised to save &ldquo;all Israel&rdquo;, and one day He will (see our Revelation study for details).&nbsp; But, this does not mean that God will save or has saved every Jewish person that has ever lived.&nbsp; Consider Ishmael, Esau, and Judas.&nbsp; These did not receive God&rsquo;s promise of salvation.&nbsp; Although they refer to Paul&rsquo;s teaching in Romans 9-11 as the basis for this report, the Catholic church ignores the explanation Paul gives in Romans 9.</p>\n\n<p style=\"text-align: justify;\">We have Romans 9-11 because Paul had to explain the situation of God&rsquo;s people Israel.&nbsp; Up through Romans 8, Paul had talked about how salvation is by faith and not works, and how salvation is permanent.&nbsp; Given this teaching, the (implied) questions Paul raises are, &ldquo;If what you said is true that salvation cannot be lost because of God&rsquo;s promises, then what about the Jews?&nbsp; God made promises to the Jews, yet most of the nation rejected their Messiah.&nbsp; Did God change His mind about His promises to the Jews?&rdquo;</p>\n\n<p style=\"text-align: justify;\">To answer that, Paul begins Romans 9 by explaining that, &ldquo;<em>6 But it is not as though the word of God has failed.&nbsp; For they are not all Israel who are descended from Israel; 7 nor are they all children because they are Abraham&rsquo;s descendants, but: &ldquo;through Isaac your descendants will be named.&rdquo;&nbsp; 8 That is, it is not the children of the flesh who are children of God, but the children of the promise are regarded as descendants</em>.&rdquo;&nbsp; He then gives examples of Jews God did and did not choose for salvation (Isaac not Ishmael; Jacob not Esau).&nbsp; Therefore, we see that God&rsquo;s promises were not to all <em>physical</em> Israel.&nbsp; They were to <em>spiritual</em> Israel, those upon whom God would show mercy (Romans 9:15).</p>\n\n<p style=\"text-align: justify;\">Indeed, God has always had a remnant He preserved.&nbsp; A great example of this is found in Elijah in 1 Kings 19:&nbsp; &ldquo;<em>14 Then he said, &ldquo;I have been very zealous for the Lord, the God of hosts; for the sons of Israel have forsaken Your covenant, torn down Your altars and killed Your prophets with the sword. &nbsp;And I alone am left; and they seek my life, to take it away</em>.&rdquo;&nbsp; Here is Elijah, running for his life, thinking he alone is the only believer left on earth, with no believing Jews remaining.&nbsp; Yet the Lord answers him:&nbsp; &ldquo;<em>18 Yet I will leave 7,000 in Israel, all the knees that have not bowed to Baal and every mouth that has not kissed him</em>.&rdquo;&nbsp; There were always unbelieving Jews, but God always preserved a remnant of believers.&nbsp; So again, not all physical Israel is the true, spiritual Israel.</p>\n\n<p style=\"text-align: justify;\">But, God <em>will</em>, one day, save <em>all</em> physical Israel.&nbsp; Indeed, this is a promise He made to the fathers of Israel, and His gifts and calling are irrevocable.&nbsp; This will occur in the last days, at the end of tribulation, when He pours out His Spirit on all the Jews alive at that time and they <em>all</em> call on the name of the Lord, at which point Jesus will return.&nbsp; They will not be saved by the Old Covenant.&nbsp; Rather, they will all call on Jesus by faith.&nbsp; Again, you can learn about this in our Revelation study.</p>\n\n<p style=\"text-align: justify;\">Despite the fact that God will one day save all Israel, the Catholic church gets this confused with physical Israel now.&nbsp; Their view is that Jews will be saved by the Mosaic Covenant.&nbsp; For example, they say,</p>\n\n<p style=\"text-align: justify;\">&ldquo;Whoever observes the Torah has life in its fullness (cf. Pirqe Avot II, 7). By observing the Torah the Jew receives a share in communion with God. In this regard, Pope Francis has stated: \"The Christian confessions find their unity in Christ; Judaism finds its unity in the Torah. Christians believe that Jesus Christ is the Word of God made flesh in the world; for Jews the Word of God is present above all in the Torah. Both faith traditions find their foundation in the One God, the God of the Covenant, who reveals himself through his Word. In seeking a right attitude towards God, Christians turn to Christ as the fount of new life, and Jews to the teaching of the Torah.\" (Address to members of the International Council of Christians and Jews, 30 June 2015).&rdquo;</p>\n\n<p style=\"text-align: justify;\">This sounds very similar to the mega-church pastor&rsquo;s false teaching as shown above.&nbsp; It is obviously false, as it directly contradicts Scripture.&nbsp; The Torah refers to the Old Testament.&nbsp; In John 5, Jesus says this to the Jews:&nbsp; &ldquo;<em>39 You search the Scriptures because you think that in them you have eternal life; it is these that testify about Me; 40 and you are unwilling to come to Me so that you may have life</em>.&rdquo;&nbsp; Clearly, there is only one way to have life, and that is by coming to Jesus.&nbsp; Yet the Catholic church is teaching here that Jews are saved by Torah observance.</p>\n\n<p style=\"text-align: justify;\">In Romans 3 we read:&nbsp; &ldquo;<em>19 Now we know that whatever the Law says, it speaks to those who are under the Law, so that every mouth may be closed and all the world may become accountable to God; 20 because by the works of the Law no flesh will be justified in His sight; for through the Law comes the knowledge of sin</em>.&rdquo;&nbsp; No one, Jew or Gentile, will have communion with God by works of the Law.&nbsp; That is because no one can obey the Law.&nbsp; The Law gives us knowledge of our sin.&nbsp; The Law was given as a tutor to lead us to Christ (Galatians 3:24).&nbsp; Communion with God can only come by faith in Christ.&nbsp; Indeed, Romans 3 goes on to say:&nbsp; &ldquo;<em>21 But now apart from the Law the righteousness of God has been manifested, being witnessed by the Law and the Prophets, 22 even the righteousness of God through faith in Jesus Christ for all those who believe; for there is no distinction</em>.&rdquo;&nbsp; Righteousness can only be obtained by faith in Christ, never by following the Law.</p>\n\n<p style=\"text-align: justify;\">Demonstrating confusion that can only come from a false teacher, the report goes on to try to say that there is only one path of salvation, and that is through Christ.&nbsp; To reconcile this contradiction with the paragraph above, they try to equate the Jew&rsquo;s view of the Torah with Christ:</p>\n\n<p style=\"text-align: justify;\">&ldquo;Therefore there are not two paths to salvation according to the expression \"Jews hold to the Torah, Christians hold to Christ\". Christian faith proclaims that Christ&rsquo;s work of salvation is universal and involves all mankind. God&rsquo;s word is one single and undivided reality which takes concrete form in each respective historical context.&nbsp; In this sense, Christians affirm that Jesus Christ can be considered as &lsquo;the living Torah of God&rsquo;. Torah and Christ are the Word of God, his revelation for us human beings as testimony of his boundless love. For Christians, the pre-existence of Christ as the Word and Son of the Father is a fundamental doctrine, and according to rabbinical tradition the Torah and the name of the Messiah exist already before creation (cf. Genesis Rabbah 1,1)&hellip; In the rabbinical literature, however, we find the identification of the Torah with Moses. Against this background, Christ as the &lsquo;new Moses&rsquo; can be connected with the Torah. Torah and Christ are the locus of the presence of God in the world as this presence is experienced in the respective worship communities. The Hebrew dabar means word and event at the same time &ndash; and thus one may reach the conclusion that the word of the Torah may be open for the Christ event.&rdquo;</p>\n\n<p style=\"text-align: justify;\">Confusing, no?&nbsp; Again, Jesus our Lord did not see things this way. &nbsp;In John 8, we read:</p>\n\n<p style=\"text-align: justify;\">&ldquo;<em>33 They answered Him, &ldquo;We are Abraham&rsquo;s descendants and have never yet been enslaved to anyone; how is it that You say, &lsquo;You will become free&rsquo;?&rdquo;&nbsp; 34 Jesus answered them, &ldquo;Truly, truly, I say to you, everyone who commits sin is the slave of sin.&nbsp; 35 The slave does not remain in the house forever; the son does remain forever.&nbsp; 36 So if the Son makes you free, you will be free indeed.&nbsp; 37 I know that you are Abraham&rsquo;s descendants; yet you seek to kill Me, because My word has no place in you.&nbsp; 38 I speak the things which I have seen with My Father; therefore you also do the things which you heard from your father&hellip;44 You are of your father the devil, and you want to do the desires of your father.&nbsp; He was a murderer from the beginning, and does not stand in the truth because there is no truth in him.&nbsp; Whenever he speaks a lie, he speaks from his own nature, for he is a liar and the father of lies.&nbsp; 45 But because I speak the truth, you do not believe Me.&nbsp; 46 Which one of you convicts Me of sin?&nbsp; If I speak truth, why do you not believe Me?&nbsp; 47 He who is of God hears the words of God; for this reason you do not hear them, because you are not of God</em>.&rdquo;</p>\n\n<p style=\"text-align: justify;\">Just as Paul said in Romans 9, being descended physically from Abraham does not guarantee a person salvation.&nbsp; Jesus makes clear that these unbelieving Jews are of their father &ndash; the devil!&nbsp; Furthermore, Jesus says that these Jews do not hear God&rsquo;s word (the Torah at that time), because they are not of God.&nbsp; Therefore, being a physical Jew and observing the Torah do not make a person a child of God; in fact, just the opposite.&nbsp; Becoming a child of God is done through a supernatural act by God alone, when He causes a person to be born again and is given faith to believe in His Son.</p>\n\n<p style=\"text-align: justify;\">Their confusion gets even worse.&nbsp; In paragraph 35 of the report (not repeated here for its length), the Catholic church essentially says that there is only one path to salvation and that is Christ.&nbsp; Yet in paragraph 36, they say:</p>\n\n<p style=\"text-align: justify;\">&ldquo;From the Christian confession that there can be only one path to salvation, however, it does not in any way follow that the Jews are excluded from God&rsquo;s salvation because they do not believe in Jesus Christ as the Messiah of Israel and the Son of God. Such a claim would find no support in the soteriological understanding of Saint Paul, who in the Letter to the Romans not only gives expression to his conviction that there can be no breach in the history of salvation, but that salvation comes from the Jews (cf. also Jn 4:22)&hellip; That the Jews are participants in God&rsquo;s salvation is theologically unquestionable, but how that can be possible without confessing Christ explicitly, is and remains an unfathomable divine mystery.&rdquo;</p>\n\n<p style=\"text-align: justify;\">Actually, this is no mystery whatsoever.&nbsp; Once again, this is in direct contradiction to Scripture, which is what we would expect to see from a false teacher.&nbsp; Consider John 3:&nbsp; &ldquo;<em>He who believes in Him is not judged; he who does not believe has been judged already, because he has not believed in the name of the only begotten Son of God</em>.&rdquo;&nbsp; This really can&rsquo;t be stated any clearer, can it?&nbsp; No one can be saved, Jew or Gentile, apart from faith in Jesus Christ.</p>\n\n<p style=\"text-align: justify;\">What about Paul in Romans, to which they refer?&nbsp; Romans 10 says, &ldquo;<em>1 Brethren, my heart&rsquo;s desire and my prayer to God for them is for their salvation.&nbsp; 2 For I testify about them that they have a zeal for God, but not in accordance with knowledge. &nbsp;3 For not knowing about God&rsquo;s righteousness and seeking to establish their own, they did not subject themselves to the righteousness of God. &nbsp;4 For Christ is the end of the law for righteousness to everyone who believes&hellip; 9 that if you confess with your mouth Jesus as Lord, and believe in your heart that God raised Him from the dead, you will be saved; 10 for with the heart a person believes, resulting in righteousness, and with the mouth he confesses, resulting in salvation.&nbsp; 11 For the Scripture says, &ldquo;Whoever believes in Him will not be disappointed.&rdquo;&nbsp; 12 For there is no distinction between Jew and Greek; for the same Lord is Lord of all, abounding in riches for all who call on Him; 13 for &ldquo;Whoever will call on the name of the Lord will be saved</em>.&rdquo;</p>\n\n<p style=\"text-align: justify;\">Over and over, Scripture makes clear that there is but one way of salvation, for both Jews and Greeks (i.e., Gentiles, or non-Jews), and that is by faith in Christ.&nbsp; This faith must be confessed, which comes from a heart belief, such that whoever calls on the name of the Lord will be saved.&nbsp; Yet the Catholic church falsely claims that &ldquo;it does not in any way follow that the Jews are excluded from God&rsquo;s salvation because they do not believe in Jesus Christ as the Messiah of Israel and the Son of God.&rdquo;&nbsp; It does follow, not only for Jews but also for Greeks.</p>\n\n<p style=\"text-align: justify;\">The Catholic church&rsquo;s main confusion appears to be centered on their belief that God has not revoked the Old Covenant with the Jews.&nbsp; Although they do not explicitly state what they mean by Old Covenant, from the report it seems clear that they mean the Mosaic Law.&nbsp; But, as shown above, the Mosaic Law never guaranteed salvation unless you obeyed it perfectly.&nbsp; And we know that it was given not for obedience (for God knew the Jews could not obey it, nor anyone for that matter); rather, God gave it to show us our sin, and as a tutor to lead us to Christ (see above).</p>\n\n<p style=\"text-align: justify;\">Now, because of their faulty view of this covenant not being revoked, the Catholic church believes that all Jews will be saved.&nbsp; Therefore, they teach that there is no need to evangelize to the Jews:</p>\n\n<p style=\"text-align: justify;\">&ldquo;The Church is therefore obliged to view evangelisation to Jews, who believe in the one God, in a different manner from that to people of other religions and world views. &nbsp;In concrete terms this means that the Catholic Church neither conducts nor supports any specific institutional mission work directed towards Jews. &nbsp;While there is a principled rejection of an institutional Jewish mission, Christians are nonetheless called to bear witness to their faith in Jesus Christ also to Jews, although they should do so in a humble and sensitive manner, acknowledging that Jews are bearers of God&rsquo;s Word, and particularly in view of the great tragedy of the Shoah.&rdquo;</p>\n\n<p style=\"text-align: justify;\">Again, very similar to the mega-church pastor&rsquo;s false teaching above.&nbsp; Yet, Scripture knows of no such thing as not evangelizing the Jews.&nbsp; If what both of these false teachers say is true, then why did Jesus say &ldquo;<em>you shall be My witnesses both in Jerusalem, and in all Judea and Samaria, and even to the remotest part of the earth</em>&rdquo;? (Acts 1:8)&nbsp; Why did the apostles witness to Jews (e.g., Acts 2)?&nbsp; Why did Paul go to the Jew first in each town he visited? (Romans 1:16, Acts 17)&nbsp; We are commanded to share the gospel with all peoples, including the Jews, because &ldquo;<em>there is salvation in no one else; for there is no other name under heaven that has been given among men by which we must be saved</em>.&rdquo; (Acts 4)</p>\n\n<p style=\"text-align: justify;\">The fruit of a false teacher is teaching that contradicts the word of God.&nbsp; As we have seen here regarding the salvation of Israel, the Catholic church has false teaching that strives to not share the gospel with the Jewish people.&nbsp; Rather than listen to this wolf in sheep&rsquo;s clothing, let&rsquo;s share the gospel not only with the Jews, but with Catholics also.&nbsp; They desperately need to hear it, as do all peoples.</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "1810",
                 "summary": "<p>While Ive been on this brief hiatus Ive been busy learning and listening and contemplating, and just trying to hear something besides my own voice for a while. Its been good, I think, though less than profound. Normal is part of the Christian life as well as mountaintops and valleys low. Doing life is sometimes where the best work is done.</p>",
                 "postedDate": 1458511860,
                 "title": "Blinds for the Un-seeing",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_10.jpg",
                 "authorThumbnailAltText": "Melissa Church",
                 "authorName": "Melissa Church",
                 "url": "https://www.versebyverseministry.org/devotionals/blinds-for-the-un-seeing",
                 "body": "<p>~~So, hey! It&rsquo;s been a while! Glad to be back and to have something to say!</p>\n\n<p>While I&rsquo;ve been on this brief hiatus I&rsquo;ve been busy learning and listening and contemplating, and just trying to hear something besides my own voice for a while. It&rsquo;s been good, I think, though less than profound. Normal is part of the Christian life as well as mountaintops and valleys low. Doing life is sometimes where the best work is done.</p>\n\n<p>I&rsquo;ve been traveling a lot with my husband since his corporate offices and my son&rsquo;s university are both in Little Rock. We have our own room at the hotel there &ndash; the same room every time. It gives me a false security that the germs are all just ours. I choose to live in that reality. Anyway, because my husband is usually there with other coworkers from out of town, I&rsquo;ve gotten an opportunity to meet most of them and chat them up about their parts of the world. One of my husband&rsquo;s co-workers is a great guy whom I enjoy very much,&nbsp;and who is not a believer. He&rsquo;s from California.</p>\n\n<p>One evening while we were comparing notes about kids and schools and etc&hellip;he said that his kids attend a &ldquo;progressive&rdquo; private school and that it&rsquo;s kind of &ldquo;inner-city&rdquo;, meaning that there is a homeless community right across the street. I was waiting for the anticipated follow up about how the school has embraced that opportunity to teach the kids to serve, and the recounting of activities they&rsquo;ve embarked on to do that. Instead, what he told me is that the school has decided to put up blinds on the front of the building so the kids don&rsquo;t have to &ldquo;look at that&rdquo; all day. Doesn&rsquo;t help with drop off and pick up apparently, and the conversations that ensue coming and going are largely about how each person chooses their own lifestyle and it&rsquo;s not our place to try to change that.&nbsp;</p>\n\n<p>It was a startlingly different approach from what I expected. I&rsquo;ve mulled it over for months now.</p>\n\n<p>Another thing I&rsquo;ve been doing while on hiatus is church shopping&hellip;again. I&rsquo;ve settled for now in the church that hosts my Bible study group. They are a warm and welcoming little church whose commitment to service is impressive for a group its size. They have found practical ways to serve the community every single month since they&rsquo;ve been in existence and they don&rsquo;t limit themselves because of what they think a church of less than 100 can do. They just do what they can with what they have where they are. I really like that. They don&rsquo;t look for the glamorous; they just serve the needs they become aware of.</p>\n\n<p>One of the women who leads there, and coincidentally is in my Bible study and has become a close friend, also subs at her kids&rsquo; elementary school. Because our community population is 25% Hispanic and almost 10% Marshallese immigrants, there are unique challenges in the schools here. And lots of need. My friend, in her work at the school, stumbled across a community of transient homeless families with kids living in a local pay-by-the-week run down motel. Instead of putting up blinds so she couldn&rsquo;t see that&hellip;she brought that need to the church.</p>\n\n<p>Today is the Sunday of Spring Break week. This is a week when kids with food insecurity will go hungry because they can&rsquo;t get two hot meals at school. It&rsquo;s a scary week for them, and a stressful week for their parents. So this little church chipped in and packed 60 bags of groceries today during church services. No&hellip;<em><strong>instead</strong></em> of church services. We all got to <em><strong>be</strong></em> The Church instead of <em><strong>doing</strong></em> church today. Anyone who would normally attend service got the opportunity to pitch in to pack bags and make deliveries. Outside the walls of our building. On a Sunday. Worshipping through obedience. Together. The Body, doing its work. It was a marvelous thing. A simple thing. An ordinary thing. A practical thing. Something that won&rsquo;t change the world, but was motivated by love and obedience and gratitude. Something truly profound. I would have been privileged to watch, but I was blessed to help.</p>\n\n<p>Now I know all that sounds like a brag bag, but it&rsquo;s not. It&rsquo;s a call to open your blinds. It&rsquo;s simple really; this thing God wants us to do. We don&rsquo;t need a lot of people to do it. It doesn&rsquo;t have to be glamorous. It&rsquo;s really just about looking across the street and seeing the need that exists there. Need that you&rsquo;ll miss if you shutter your windows. And let there be no mistake, The Church is as guilty of that as anyone in the world, especially on a Sunday morning. (Can you even <em><strong>see </strong></em>out your church windows?)<br />\nOK. You get the point. Don&rsquo;t wait for someone else. Don&rsquo;t wait until you get bigger. Don&rsquo;t wait until you can solve the problem. Just do what you can with what you have where you are. That&rsquo;s Teddy Roosevelt, by the way. Maybe it would be better in closing, to quote Jesus:</p>\n\n<p>&ldquo;<em>Then the King will say to those on his right, &lsquo;Come, you who are blessed by my Father; take your inheritance, the kingdom prepared for you since the creation of the world. For I was hungry and you gave me something to eat, I was thirsty and you gave me something to drink, I was a stranger and you invited me in, I needed clothes and you clothed me, I was sick and you looked after me, I was in prison and you came to visit me.&rsquo;</em></p>\n\n<p><em>&ldquo;Then the righteous will answer him, &lsquo;Lord, when did we see you hungry and feed you</em>, <em>or thirsty and give you something to drink? When did we see you a stranger and invite you in, or needing clothes and clothe you? When did we see you sick or in prison and go to visit you?&rsquo;</em></p>\n\n<p><em>&ldquo;The King will reply, &lsquo;Truly I tell you</em>, <em>whatever you did for one of the least of these brothers and sisters of mine, you did for me</em>.&rsquo;&rdquo; Matthew 25:34-40</p>"
                 },
                 {
                 "category": "",
                 "topics": [],
                 "ID": "1808",
                 "summary": "<p>Our God is a God of resurrection. He brings dead things back to life. Have you overlooked the power of this truth?</p>",
                 "postedDate": 1458345540,
                 "title": "Our God of Resurrection",
                 "authorThumbnailSource": "https://www.versebyverseministry.org/images/member_photos/photo_2.jpg",
                 "authorThumbnailAltText": "Stephen Armstrong",
                 "authorName": "Stephen Armstrong",
                 "url": "https://www.versebyverseministry.org/devotionals/our-god-of-resurrection",
                 "body": "<p>Our God is a God of resurrection. He brings dead things back to life.&nbsp;</p>\n\n<p><a href=\"http://www.pbs.org/wgbh/pages/frontline/shows/religion/story/death.html\" target=\"_blank\">Paula Fredriksen</a>, a historian&nbsp;and professor of religion (though not a Christian), was asked the following question about the Gospel accounts of Jesus&rsquo; resurrection:</p>\n\n<h5><em>Q: \"As a historian, what do you make of this ... the resurrection, of this shared conviction that Jesus had come back from the&nbsp;dead?\"</em></h5>\n\n<h5><em>A; \"The stories about the Resurrection in the gospels make two very clear points. First of all, that Jesus really, really was dead. And secondly,&nbsp;that his disciples really and with absolute conviction saw him again </em><em>afterwards</em><em>. The gospels are equally clear that it&#39;s not a ghost. I mean,&nbsp;even though, the raised Jesus walks through a shop door in one of the gospels, there he suddenly materializes in the middle of a&nbsp;conference his disciples are having, he&#39;s at pains to assure them, \"Touch me, feel me, it&#39;s bones and flesh.\" In </em><em>Luke</em><em> he eats a piece of fish.&nbsp;Ghosts can&#39;t eat fish. So what these traditions are </em><em>emphasizing again and again</em><em> is that it wasn&#39;t a vision. It wasn&#39;t a waking dream. It was&nbsp;Jesus raised.&rdquo;</em></h5>\n\n<p>Dr. Fredriksen recognizes the key message of the resurrection accounts, that Jesus truly died and lived again. Unfortunately, she doesn&rsquo;t seem to appreciate the implications of her own conclusion. What does it mean for us if Jesus truly died and came back to life&nbsp;as His disciples testified?</p>\n\n<p>In calling the eyewitness accounts &ldquo;traditions,&rdquo; Dr. Fredriksen&nbsp;implies that the disciples&rsquo; accounts of Jesus&#39; resurrection aren&#39;t trustworthy or believable. Her&nbsp;decision to dismiss these accounts out of hand&nbsp;is unfortunate, because&nbsp;the ramifications of the disciples&#39;&nbsp;testimony &ndash; no matter how skeptical we may be &ndash;&nbsp;demand more thoughtful consideration.&nbsp;<img alt=\"\" src=\"https://www.versebyverseministry.org/images/uploads/Resurrection-Religious-Stock-Photo.jpg\" style=\"width: 400px; height: 272px; margin: 20px 15px; float: right;\" /></p>\n\n<p>Many men have laid claim to power over death, but their own deaths silenced those claims and revealed their deception. And among the few who have returned from death themselves (like Lazarus), none predicted their own resurrection in advance nor claimed to possess the power to repeat it.</p>\n\n<p>Only Jesus&nbsp;demonstrated the power to resurrect the dead as He taught in the Galilee while also promising to raise Himself. Later, He proved Himself trustworthy with an empty tomb confirmed by eyewitnesses.</p>\n\n<p>So who has the power to bring a dead body back to life? Even more, Who can accomplish that for Himself? Is it not the Creator alone? At the very least, the Creator must consent to such an act, which implies that He approves of the One Who receives such power. After all, would we expect the Creator to restore life to a person who misrepresented Himself as God? Surely not, and, therefore, Jesus&rsquo; resurrection from the dead validates His claims. &nbsp;</p>\n\n<p>So let&rsquo;s consider Jesus&rsquo; claims. Jesus said:</p>\n\n<h6>John 6:38&nbsp;&ldquo;For I have come down from heaven, not to do My own will, but the will of Him who sent Me.<br />\nJohn 6:39&nbsp;&ldquo;This is the will of Him who sent Me, that of all that He has given Me I lose nothing, but raise it up on the last day.<br />\nJohn 6:40&nbsp;&ldquo;For this is the will of My Father, that everyone who beholds the Son and believes in Him will have eternal life, and I Myself will raise him up on the last day.&rdquo;</h6>\n\n<h6>John 9:35&nbsp; Jesus heard that they had put him out, and finding him, He said, &ldquo;Do you believe in the Son of Man?&rdquo;<br />\nJohn 9:36&nbsp;He answered, &ldquo;Who is He, Lord, that I may believe in Him?&rdquo;&nbsp;<br />\nJohn 9:37&nbsp;Jesus said to him, &ldquo;You have both seen Him, and He is the one who is talking with you.&rdquo;<br />\nJohn 9:38&nbsp;And he said, &ldquo;Lord, I believe.&rdquo; And he worshiped Him.&nbsp;</h6>\n\n<h6>Luke 24:44&nbsp; Now He said to them, &ldquo;These are My words which I spoke to you while I was still with you, that all things which are written about Me in the Law of Moses and the Prophets and the Psalms must be fulfilled.&rdquo;<br />\nLuke 24:45&nbsp;Then He opened their minds to understand the Scriptures,&nbsp;<br />\nLuke 24:46&nbsp;and He said to them, &ldquo;Thus it is written, that the Christ would suffer and rise again from the dead the third day,<br />\nLuke 24:47&nbsp;and that repentance for forgiveness of sins would be proclaimed in His name to all the nations, beginning from Jerusalem.</h6>\n\n<p>As we approach our annual celebration of Easter, the day we remember the resurrection of our Lord, pay attention to the claims of One Who possesses power over death. Note that He declared Himself to be God, to be our means to&nbsp;eternal life and our eventual return from the dead. Most importantly, He declared that He was prepared to forgive us of our sins by faith in His claims alone. Given His resurrection, we should pay close attention to Jesus&#39; claims and then respond to Him in the only reasonable way. To quote Jesus again:</p>\n\n<h6>Luke 12:4&nbsp; &ldquo;I say to you, My friends, do not be afraid of those who kill the body and after that have no more that they can do.<br />\nLuke 12:5&nbsp;&ldquo;But I will warn you whom to fear: fear the One who, after He has killed, has authority to cast into hell; yes, I tell you, fear Him!</h6>\n\n<p>Our God is a God of resurrection. He brings dead things back to life. He can raise your soul to eternal life through faith in Jesus Christ. He will one day raise your mortal body, and for those who confess Jesus as Lord, that will be a glorious day indeed. If you&#39;re ready to acknowledge Jesus&#39; claims, then consider Paul&#39;s teaching:</p>\n\n<h6>Rom. 10:8 But what does it say? &ldquo;The word is near you, in your mouth and in your heart&rdquo; &mdash; that is, the word of faith which we are preaching,<br />\nRom. 10:9 that if you confess with your mouth Jesus as Lord, and believe in your heart that God raised Him from the dead, you will be saved; Rom. 10:10 for with the heart a person believes, resulting in righteousness, and with the mouth he confesses, resulting in salvation.&nbsp;</h6>"
                 }
                 ]
}
