{
    "answers": [
                {
                "topics": [
                           {
                           "ID": "Millennial+Kingdom",
                           "topic": "Millennial Kingdom"
                           },
                           {
                           "ID": "priests",
                           "topic": "priests"
                           },
                           {
                           "ID": "Temple",
                           "topic": "Temple"
                           },
                           {
                           "ID": "holy+of+holies",
                           "topic": "holy of holies"
                           }
                           ],
                "ID": "2178",
                "postedDate": 1514323080,
                "title": "In the Millennial Kingdom will all believers be priests and see Jesus in His Temple?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/in-the-millennial-kingdom-will-all-believers-be-priests-and-see-jesus-in-hi",
                "body": "<p><strong><em>Q: In the VBVMI <a href=\"/bible-studies/revelation_2011\">Revelation Study</a>, Pastor Armstrong mentions &lsquo;White Throne Judgement&rsquo;, I think #20D, that the average person living in the Millennial Kingdom has never seen Jesus in his Temple because they are not priests, and only priests can go into the &lsquo;Holy of Holies&rsquo;. But doesn&#39;t John call all believers, in faith, priests?</em></strong></p>\n\n<p>A:&nbsp;All believers in the church today are called priests, as you said, because our bodies collectively are the temple of God (1Cor 6:19). Christ dwells among men on earth by His Spirit dwelling in the bodies of believers. In the Kingdom to come on earth, however, the temple will no longer be our physical bodies.&nbsp;Instead, a new physical temple building will be constructed for the Kingdom period, according to Ezekiel and Isaiah, and the Lord will inhabit that building as He once did in Israel&rsquo;s past.&nbsp;<br />\nThe best description of Jesus entering the Kingdom temple is given in Ezekiel 43. The prophet was shown a vision of the future temple (which Ezekiel calls the&nbsp;&ldquo;house&rdquo; of the Lord) as the Lord enters to reign:</p>\n\n<h5>Ezek. 43:1&nbsp;Then he led me to the gate, the gate facing toward the east;&nbsp;<br />\nEzek. 43:2&nbsp;and behold, the glory of the God of Israel was coming from the way of the east. And His voice was like the sound of many waters; and the earth shone with His glory.&nbsp;<br />\nEzek. 43:3&nbsp;And it was like the appearance of the vision which I saw, like the vision which I saw when He came to destroy the city. And the visions were like the vision which I saw by the river Chebar; and I fell on my face.&nbsp;<br />\nEzek. 43:4&nbsp;And the glory of the Lord came into the house by the way of the gate facing toward the east.&nbsp;<br />\nEzek. 43:5&nbsp;And the Spirit lifted me up and brought me into the inner court; and behold, the glory of the Lord filled the house.&nbsp;<br />\nEzek. 43:6&nbsp; Then I heard one speaking to me from the house, while a man was standing beside me.&nbsp;<br />\nEzek. 43:7&nbsp;He said to me, &ldquo;Son of man, this is the place of My throne and the place of the soles of My feet, where I will dwell among the sons of Israel forever. And the house of Israel will not again defile My holy name, neither they nor their kings, by their harlotry and by the corpses of their kings when they die,&nbsp;<br />\nEzek. 43:8&nbsp;by setting their threshold by My threshold and their door post beside My door post, with only the wall between Me and them. And they have defiled My holy name by their abominations which they have committed. So I have consumed them in My anger.&nbsp;<br />\nEzek. 43:9&nbsp;&ldquo;Now let them put away their harlotry and the corpses of their kings far from Me; and I will dwell among them forever.&nbsp;</h5>\n\n<p>Notice that in the Kingdom, Jesus will appear as the SHechinah glory of God, not as a man as in the days He first walked the earth. Furthermore, the Lord declares He will never leave His throne in the house of the Lord again. Therefore, in order for Jesus to be seen during the Kingdom, a person must have access to the Holy of Holies or some other part of the Millennial Temple. You may find the <a href=\"/bible-studies/ezekiel\">Ezekiel</a> Study helpful.</p>\n\n<p>Furthermore, during the time of the Kingdom, the Lord institutes a new Kingdom Law. The Kingdom law brings with it a new priesthood (see Heb 7:12). The requirements of the Kingdom law are given in Ezekiel 44-46, and in Ezekiel 40-43 we learn that Levitical priests will once again live around and officiate in the Kingdom temple.&nbsp;<br />\nIsaiah tells us that all the Kingdom nations will have the opportunity to witness the glory of Christ in the temple:</p>\n\n<h5>Is. 66:18&nbsp;&ldquo;For I know their works and their thoughts; the time is coming to gather all nations and tongues. And they shall come and see My glory.&nbsp;<br />\nIs. 66:19&nbsp;&ldquo;I will set a sign among them and will send survivors from them to the nations: Tarshish, Put, Lud, Meshech, Tubal and Javan, to the distant coastlands that have neither heard My fame nor seen My glory. And they will declare My glory among the nations.&nbsp;<br />\nIs. 66:20&nbsp;&ldquo;Then they shall bring all your brethren from all the nations as a grain offering to the Lord, on horses, in chariots, in litters, on mules and on camels, to My holy mountain Jerusalem,&rdquo; says the Lord, &ldquo;just as the sons of Israel bring their grain offering in a clean vessel to the house of the Lord.&nbsp;<br />\nIs. 66:21&nbsp;&ldquo;I will also take some of them for priests and for Levites,&rdquo; says the Lord.&nbsp;<br />\nIs. 66:22&nbsp;&ldquo;For just as the new heavens and the new earth which I make will endure before Me,&rdquo; declares the Lord,&nbsp;&ldquo;So your offspring and your name will endure.&nbsp;<br />\nIs. 66:23&nbsp;&ldquo;And it shall be from new moon to new moon and from sabbath to sabbath, all mankind will come to bow down before Me,&rdquo; says the Lord.&nbsp;</h5>\n\n<p>Notice Isaiah says that all nations will see Him in the temple, and the Lord will take some of the people of these nations as His priests. Therefore, priests will include Gentiles in this period. If we are selected to be a priest in the temple, then we will have access to the glory of Christ in a regular way. Otherwise, our access will be more limited as a worshipper.&nbsp;</p>\n\n<p>Therefore, we know the nations will see Christ&rsquo;s glory in some limited fashion, but what they experience will not be what the first-century disciple experienced. The world will see the glory of Christ in ways similar to how Israel saw the Shechinah glory of God in the Old Testament. Periodically and in a limited fashion.</p>\n\n<p>In summary, the Church saints are priests today, because the temple of God resides in our bodies, but in the Kingdom, the temple changes as does the law, and therefore the priesthood changes as well.<br />\n&nbsp;</p>"
                },
                {
                "topics": [
                           {
                           "ID": "time",
                           "topic": "time"
                           },
                           {
                           "ID": "Heaven",
                           "topic": "Heaven"
                           },
                           {
                           "ID": "Hell",
                           "topic": "Hell"
                           },
                           {
                           "ID": "eternity",
                           "topic": "eternity"
                           },
                           {
                           "ID": "unbeliever",
                           "topic": "unbeliever"
                           }
                           ],
                "ID": "2177",
                "postedDate": 1514320560,
                "title": "Will time still exist in Heaven? Will hell be for eternity for unbelievers?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/will-time-still-exist-in-heaven-will-hell-be-for-eternity-for-unbelievers",
                "body": "<p><strong><em>Q: Will time still exist in heaven? In Revelation, it talks about trees bearing fruit every month which seems to suggest time still exists. Can humans even exist outside of time like God does?&nbsp;Second, is hell eternal or will it be a punishment for a set time (1000 years) and then completely destroyed?</em></strong></p>\n\n<p>A:&nbsp;Regarding time, the Creation will also exist in a place of time and space, since this is in keeping with our nature. Only God is omnipresent and without a beginning. Timekeeping in the New Eternal Order will be done in months only, not in years. So we will know a pattern of life (i.e., twelve repeating months), but we will not know a counting of years since there is no end.&nbsp;</p>\n\n<p>Finally, Hell is not the eternal abode of the unbelieving. Rather, the Lake of Fire is their eternal home, and it will last for eternity, as Jesus says:</p>\n\n<h5>Matt. 25:41&nbsp; &ldquo;Then He will also say to those on His left, &lsquo;Depart from Me, accursed ones, into the eternal fire which has been prepared for the devil and his angels;<br />\nMatt. 25:42&nbsp;for I was hungry, and you gave Me nothing to eat; I was thirsty, and you gave Me nothing to drink;<br />\nMatt. 25:43&nbsp;I was a stranger, and you did not invite Me in; naked, and you did not clothe Me; sick, and in prison, and you did not visit Me.&rsquo;<br />\nMatt. 25:44&nbsp;&ldquo;Then they themselves also will answer, &lsquo;Lord, when did we see You hungry, or thirsty, or a stranger, or naked, or sick, or in prison, and did not take care of You?&rsquo;<br />\nMatt. 25:45&nbsp;&ldquo;Then He will answer them, &lsquo;Truly I say to you, to the extent that you did not do it to one of the least of these, you did not do it to Me.&rsquo;<br />\nMatt. 25:46&nbsp;&ldquo;These will go away into eternal punishment, but the righteous into eternal life.&rdquo;</h5>\n\n<p>Notice, Jesus compares eternal punishment to eternal life. Just as we live forever in glory, the unbeliever lives forever in punishment. You can read more about the reasons for eternal punishment in this related article \"<a href=\"/bible-answers/why_didnt_jesus_have_to_stay_in_hell_longer\">Did Jesus have to stay in hell longer</a>?\"</p>"
                },
                {
                "topics": [
                           {
                           "ID": "Judgment",
                           "topic": "Judgment"
                           },
                           {
                           "ID": "Sin",
                           "topic": "Sin"
                           },
                           {
                           "ID": "Sovereignty",
                           "topic": "Sovereignty"
                           },
                           {
                           "ID": "Righteousness",
                           "topic": "Righteousness"
                           }
                           ],
                "ID": "2176",
                "postedDate": 1514318940,
                "title": "Why is judgment delayed if sin can&#8217;t exist in the presents of God?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/why-is-judgment-delayed-if-sin-cant-exist-in-the-presents-of-god",
                "body": "<p><strong><em>Q: We were listening to the VBVMI <a href=\"/bible-studies/genesis_2011\">Genesis Study</a>,&nbsp;</em></strong><strong><em>discussing 3C and 3D; you state in 3C, &ldquo;To come face to face with God while in a state of sin means death (eternal judgment) because God is compelled by His own perfect nature to judge sin and not ignore it.&rdquo; You said God would have been forced to destroy Adam and Eve if they hadn&#39;t hidden from Him. I take that to mean (and maybe this is a mistaken assumption) sin can&#39;t exist in the presence of such a holy God. If that is the case, how is sin allowed to exist? Are we not always in the presence of God? Why is judgment delayed (or ignored) if a perfect, holy God can&#39;t even allow sin in his presence? To me, that suggests either God&#39;</em></strong><strong><em>s&nbsp;</em></strong><strong><em>holiness isn&#39;t completely present or sin doesn&#39;t offend Him enough to destroy it.</em></strong></p>\n\n<p>A:&nbsp;First, God is holy and just, therefore He will judge sin perfectly in the end, but in His forbearance.&nbsp;</p>\n\n<h5>Rom. 3:25&nbsp;whom God displayed publicly as a propitiation in His blood through faith. This was to demonstrate His righteousness, because in the forbearance of God He passed over the sins previously committed;&nbsp;</h5>\n\n<p>Paul explains in <a href=\"/bible-studies/romans-2017\">Romans</a> that&nbsp;in the course of discussing the sin of mankind that God passed over the sins previously committed because He intended to demonstrate His righteousness in Christ. Though God could have destroyed all sin on earth in the first moment, He demonstrated forbearance Paul says. Forbearance means waiting patiently for what is due or refraining from exercising a legal right. God has every right to judge sin &ndash; and one day He will do it &ndash; but for now, He is being patient so He may demonstrate His righteousness to the world.</p>\n\n<p>Nevertheless, if men came face-to-face with God, judgment for sin in instantaneous because God can no long forebear what enters into His presence. &nbsp;As the Lod Himself explained to Moses:</p>\n\n<h5>Ex. 33:17&nbsp; The Lord said to Moses, &ldquo;I will also do this thing of which you have spoken; for you have found favor in My sight and I have known you by name.&rdquo;&nbsp;<br />\nEx. 33:18&nbsp;Then Moses said, &ldquo;I pray You, show me Your glory!&rdquo;&nbsp;<br />\nEx. 33:19&nbsp;And He said, &ldquo;I Myself will make all My goodness pass before you, and will proclaim the name of the Lord before you; and I will be gracious to whom I will be gracious, and will show compassion on whom I will show compassion.&rdquo;&nbsp;<br />\nEx. 33:20&nbsp;But He said, &ldquo;You cannot see My face, for no man can see Me and live!&rdquo;&nbsp;</h5>\n\n<p>And Paul says likewise concerning Christ:</p>\n\n<h5>1Tim. 6:13&nbsp;I charge you in the presence of God, who gives life to all things, and of Christ Jesus, who testified the good confession before Pontius Pilate,&nbsp;<br />\n1Tim. 6:14&nbsp;that you keep the commandment without stain or reproach until the appearing of our Lord Jesus Christ,&nbsp;<br />\n1Tim. 6:15&nbsp;which He will bring about at the proper time &mdash; He who is the blessed and only Sovereign, the King of kings and Lord of lords,&nbsp;<br />\n1Tim. 6:16&nbsp;who alone possesses immortality and dwells in unapproachable light, whom no man has seen or can see. To Him be honor and eternal dominion! Amen.&nbsp;</h5>\n\n<p>In the same way that we cannot avoid judgment when we go before a judge in a court of law, neither can we avoid judgment for sin if we appear before God in sin. Consequently, the Lord has made a way for us to be made righteous through faith in Christ so that when we appear before the Lord in glory, we won&rsquo;t receive judgment. Meanwhile, we cannot see Him face to face.&nbsp;</p>\n\n<p>In our present situation, we have the Spirit of God in us, but this is not the same thing as seeing God face-to-face. Notice in Paul&rsquo;s passage from 1Timothy that Paul describes in v.13 how Jesus stood in Pilate&rsquo;s presence while at the same time Paul says in v.16 that Jesus dwells in unapproachable light. Clearly, the Lord can present Himself to mankind when He desires in ways that do not threaten our existence, while at other times He dwells in His full glory which we cannot approach in sin.<br />\n&nbsp;</p>"
                },
                {
                "topics": [
                           {
                           "ID": "Jesus",
                           "topic": "Jesus"
                           },
                           {
                           "ID": "Holy+Spirit",
                           "topic": "Holy Spirit"
                           },
                           {
                           "ID": "Healing",
                           "topic": "Healing"
                           },
                           {
                           "ID": "gods+work",
                           "topic": "gods work"
                           },
                           {
                           "ID": "miracles",
                           "topic": "miracles"
                           }
                           ],
                "ID": "2175",
                "postedDate": 1514317860,
                "title": "Who is Jesus referring to when he says &#8216;We&#8217; in John 9:4?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/who-is-jesus-referring-to-when-he-says-we-in-john-94",
                "body": "<p><strong><em>Q: In the <a href=\"/bible-studies/the-gospel-of-john\">John&nbsp;Study</a> on the VBVMI website, y</em></strong><strong><em>ou said that the &ldquo;we&rdquo; referred to the combined effort of both Jesus and the Holy Spirit.&nbsp;</em></strong><strong><em>My difficulty with this interpretation is the context of the entire verse which uses &ldquo; we&rdquo;.&nbsp;</em></strong><strong><em>The 4th&nbsp;verse quoted in its entirety from the NIV reads as follows: &nbsp;&ldquo;As long as it is day, we must do the work of him who sent me. Night is coming when no one can work.&rdquo;&nbsp;</em></strong><strong><em>How do you reconcile the phrase &ldquo;night is coming, when no one can work.&rdquo;?&nbsp;</em></strong><strong><em>I concede we are living in dark days, but really when no one can work?&nbsp;&nbsp; If you believe \"we\" means both the Holy Spirit and Jesus, then how do you reconcile &ldquo;when no one can work?&rdquo; &nbsp;These might be difficult days but are these really the days when no one can work?&nbsp;</em></strong><strong><em>John 14:12 implies we will do greater things than Jesus.&nbsp; If we really believe that then how do you reconcile the &ldquo;We&rdquo; in John 9:4?</em></strong></p>\n\n<p>A:&nbsp;In John 9 we read:</p>\n\n<h5>John 9:3&nbsp;Jesus answered, &ldquo;It was neither that this man sinned, nor his parents; but it was so that the works of God might be displayed in him.<br />\nJohn 9:4&nbsp;&ldquo;We must work the works of Him who sent Me as long as it is day; night is coming when no one can work.<br />\nJohn 9:5&nbsp;&ldquo;While I am in the world, I am the Light of the world.&rdquo;</h5>\n\n<p>To interpret Jesus&rsquo; words properly, we must remain constrained by the text. In v.3 Jesus introduces the idea of works in relationship to the blind man&rsquo;s condition. Specifically, Jesus says this man was born blind (i.e., made to be blind by God) so that his healing could become a means of glorifying Christ.&nbsp;</p>\n\n<p>Notice in v.3 Jesus says the &ldquo;word of God&rdquo; will be displayed in this man&rsquo;s healing. This statement means that the &ldquo;works&rdquo; mentioned in this passage are the works that God alone can do. More specifically, Jesus is referring to the works that God does through men. In this case, God made a man blind so He could heal him by means of a Man (i.e., Jesus).</p>\n\n<p>The next thing Jesus says is&nbsp;&ldquo;We must work the works of Him who sent Me.&rdquo; The question then becomes who did Jesus mean when He said &ldquo;we?&rdquo; The widely held view is that Jesus meant men+Jesus. In this case, Jesus was saying that He and His disciples must do the works of God (the Father).&nbsp;</p>\n\n<p>The other possible answer is Jesus meant Jesus+Spirit (as Pastor Armstrong taught). In this case, Jesus was saying He and the Spirit are working to heal blind men (and other miracles) to serve a purpose the Father ordained in the Messiah&rsquo;s arrival. As long as the Messiah is in the world, He must accomplish these miracles (in partnership with the Holy Spirit), for this is how the Messiah is to be known and glorified. For this reason, the blind man was born blind.&nbsp;</p>\n\n<p>How do we know which answer is correct? Jesus gives us the answer by what He says next.</p>\n\n<p>Jesus said that the work of &ldquo;we&rdquo; can continue only until &ldquo;night.&rdquo; In the darkness, no one can work. Then Jesus defines Himself as the Light (i.e., the day). In other words, Jesus says that His presence in the world makes this work possible, but when He departs these works must stop. Notice Jesus doesn&rsquo;t indicate they will begin again. Once the Messiah is gone from the earth, this work will stop.&nbsp;</p>\n\n<p>Therefore, we must conclude that the&nbsp;&ldquo;we&rdquo; refers to the unique and temporary works that the Messiah and the Spirit accomplished during His earthly life. These works served a special purpose and were limited to the Messiah himself. While others were permitted to perform miracles as well (e.g., the apostles), nevertheless those opportunities were never equal to the work Jesus and the Spirit accomplished during his three years of earthly ministry.&nbsp;</p>\n\n<p>Obviously, this statement doesn&rsquo;t preclude the body of Christ performing many other&nbsp;&ldquo;works&rdquo; and even miracles to a limited degree, but Jesus wasn&rsquo;t addressing these works. He was speaking specifically of the unique works that He and the Spirit would accomplish together invalidating His claims. He made this comment in response to the disciples&rsquo; questioning of this man&rsquo;s condition, and Jesus was explaining that this man&rsquo;s condition was a necessity for the&nbsp;demonstration&nbsp;of the Messiah in His day.&nbsp;<br />\n&nbsp;</p>"
                },
                {
                "topics": [
                           {
                           "ID": "doubt",
                           "topic": "doubt"
                           },
                           {
                           "ID": "blasphemy",
                           "topic": "blasphemy"
                           },
                           {
                           "ID": "Word+of+God",
                           "topic": "Word of God"
                           },
                           {
                           "ID": "deutero+isaiah",
                           "topic": "deutero isaiah"
                           }
                           ],
                "ID": "2174",
                "postedDate": 1514232900,
                "title": "How does someone deal with doubt towards God?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/how-does-someone-deal-with-doubt-towards-god",
                "body": "<p><b><i>Q:&nbsp;How do I stop the enemy from making me doubt the Word of God? I am very sorry towards God because the enemy often tries to sneak doubt in my mind and it really saddens me. Also, the enemy has often tried to use a tactic to make me doubt the Word of God. What the enemy would do is, tell me that &ldquo;the book of Isaiah was only half inspired&rdquo; and he uses liberal scholars who cling to the heresy of &ldquo;deutero-Isaiah theory&rdquo;, (multiple authors).</i></b></p>\n\n<p>A: It sounds as if you are already aware that your doubts are unfounded and that they are the product of Satan. As such, then the scriptures teach what to do:</p>\n\n<h5>James 4:6&nbsp;But He gives a greater grace. Therefore it says, &ldquo;God is opposed to the proud, but gives grace to the humble.&rdquo;&nbsp;<br />\nJames 4:7&nbsp;Submit therefore to God. Resist the devil and he will flee from you.&nbsp;<br />\nJames 4:8&nbsp;Draw near to God and He will draw near to you. Cleanse your hands, you sinners; and purify your hearts, you double-minded.&nbsp;<br />\nJames 4:9&nbsp;Be miserable and mourn and weep; let your laughter be turned into mourning and your joy to gloom.&nbsp;<br />\nJames 4:10&nbsp;Humble yourselves in the presence of the Lord, and He will exalt you.&nbsp;</h5>\n\n<p>And the writer of <a href=\"/bible-studies/hebrews\">Hebrews</a> echoes this when he writes:</p>\n\n<h5>Heb. 12:4&nbsp;You have not yet resisted to the point of shedding blood in your striving against sin;&nbsp;<br />\nHeb. 12:5&nbsp; and you have forgotten the exhortation which is addressed to you as sons,&nbsp;&ldquo;My son, do not regard lightly the discipline of the Lord,&nbsp;Nor faint when you are reproved by Him;&nbsp;<br />\nHeb. 12:6&nbsp;For those whom the Lord loves He disciplines,&nbsp;And He scourges every son whom He receives.&rdquo;&nbsp;<br />\nHeb. 12:7&nbsp;It is for discipline that you endure; God deals with you as with sons; for what son is there whom his father does not discipline?&nbsp;</h5>\n\n<p>These writers are reminding us that we must learn to resist such things and that the Lord allows the enemy to tempt us in this way to strength us and mature us just as our earthly fathers disciplined us for our own good. Rather than wish your trials gone, we recommend you take the opportunity to strengthen your will and mind by focusing on Christ and His word. As you do this, you will be better prepared to serve others.</p>\n\n<p>Since you have a large following, the Lord will be particularly interested in strengthening you spiritually. You cannot gain this strength without enduring trials. Christ endured much greater than you, so you cannot complain about such things (since a slave is not greater than his Master). Pride is an ever-present concern for those who serve Christ, and even Paul required a &ldquo;thorn in his side&rdquo; to contend with his pride. Therefore, accept these trials of doubt and work to overcome them through the application of spiritual disciplines.&nbsp;</p>\n\n<p>With respect to the specific doubts, you feel to God&rsquo;s word, you will find that as you study scripture more, you will doubt it less. For example, have you taken our Isaiah Bible study online? If you take the study, we are confident you will have plenty of reason to cease doubting, for the text itself testifies to its accuracy and trustworthiness.&nbsp;</p>\n\n<p>Lastly, you cannot commit blasphemy of the Holy Spirit, since that could only be committed by Israel. You can learn why this is true in the<a href=\"/videos/play/153/\"> Verse by Verse Ministry video teaching.</a><br />\n<br />\n<br />\n</p>"
                },
                {
                "topics": [],
                "ID": "2173",
                "postedDate": 1514232540,
                "title": "Did God create life/ Aliens on other planets?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "vbvmadmin",
                "authorName": "vbvmadmin",
                "url": "https://www.versebyverseministry.org/bible-answers/did-god-create-life-aliens-on-other-planets",
                "body": ""
                },
                {
                "topics": [
                           {
                           "ID": "sacred+name",
                           "topic": "sacred name"
                           },
                           {
                           "ID": "False+Teachers",
                           "topic": "False Teachers"
                           },
                           {
                           "ID": "Jesus",
                           "topic": "Jesus"
                           },
                           {
                           "ID": "Salvation",
                           "topic": "Salvation"
                           }
                           ],
                "ID": "2172",
                "postedDate": 1514230620,
                "title": "Is Jesus a pagan name? Are &#8216;Sacred Name&#8217; followers, believers?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/is-the-name-jesus-a-pagan-name-are-sacred-name-followers-believers",
                "body": "<p><strong><em>Q:&nbsp;&nbsp;My coworker is a member of the House of Yahweh.&nbsp;I have observed are a mixture of Judaism and Christianity. except they believe that Jesus is a pagan name and that the real savior&#39;s name was Yeshua. The question that I have is that it appears to me that God uses different names all throughout scripture to describe himself so is the name so important that it would be a matter of salvation? I also am curious about whether or not The House of Yahweh should be viewed as a group of believers that just binds themselves to Gods old law (meaning I should not try to convince him of our liberation from Gods law), or are they, unbelievers and I should continue to try and speak of the good news)?</em></strong></p>\n\n<p>A:&nbsp;The group you mentioned is part of a larger movement outside the church called the &ldquo;Sacred Name&rdquo; movement.&nbsp;Sacred Namers teach numerous theological errors; chief among them is claiming that the verbal pronunciation of a certain name will accomplish a specific spiritual work. This thinking confuses the Semitic cultural tradition of associated a person&rsquo;s name with their authority, power, renown, and character with a belief that we can appropriate those qualities by invoking the name.&nbsp;<br />\nFor example, consider the following verse:</p>\n\n<h5>Acts 2:21&nbsp;&nbsp;&lsquo;And it shall be that everyone who calls on the name of the Lord will be saved.&rsquo;&nbsp;</h5>\n\n<p>The proper interpretation of this verse understands that to&nbsp;&ldquo;call on the name of the Lord&hellip;&rdquo; &nbsp;means to cry out to Jesus with a heart of repentance seeking His mercy and salvation. The sacred word groups teach a distorted, hyper-literal interpretation that merely stating the name of the Savior or the Father results in personal salvation. In other words, they believe that everyone who pronounces the name of the Lord will be saved.</p>\n\n<p>This heresy reduces the Gospel to a magic incantation. Even more bizarre, most sacred name groups teach that a person must pronounce \"the name\" in a special way using a certain ancient language to qualify for salvation. It&#39;s a modern-day form of Gnosticism in that they are offering a \"secret knowledge\" necessary for salvation.&nbsp;</p>\n\n<p>In the end, they are merely teaching another works-based salvation, where the work is pronouncing special words. This is a false gospel, and any who have placed their hope for salvation in this nonsense are not saved. These groups are similar to other false movements like&nbsp;Jehovah&#39;s Witnesses or Mormons, which can all be classified as cults dispensing corrupted views of the Christian faith. Though some individuals within these movements may be true believers by God&rsquo;s grace only, the vast majority of their members are not Christian in any sense.<br />\n<br />\nYou can find additional resources at another <a href=\"https://www.sacredname.com\" target=\"_blank\">ministry dedicated</a> to debunking the sacred name movement.&nbsp;The website offers recommendations on books, articles, and resources to counter the errors of the Sacred Name movement.</p>\n\n<p>You may find our <a href=\"/bible-studies/romans-2017\">Romans Study</a> helpful with approaching a works-based religion.&nbsp;</p>\n\n<p><br />\n<br />\n&nbsp;</p>"
                },
                {
                "topics": [
                           {
                           "ID": "Marriage",
                           "topic": "Marriage"
                           },
                           {
                           "ID": "Obedience",
                           "topic": "Obedience"
                           }
                           ],
                "ID": "2171",
                "postedDate": 1514229840,
                "title": "What do the scriptures teach about choosing a spouse?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/what-do-the-scriptures-teach-about-choosing-a-spouse",
                "body": "<p><strong><em>Q:&nbsp;I am a single 27-year-old Christian man with intentions to get married in two to three years to come. I have a lady friend (Not&nbsp;a girlfriend yet) whose character I seem to like, she is a Christian too and we attend church services together at the local assembly. I have a desire that I make a right decision about marriage and I want to make the correct choice, I need your help as to how I should approach this till I obtain assurance from the Lord that she is the right one for me.</em></strong></p>\n\n<p>A:&nbsp;We regret we are not in a position to give you proper counsel on who you should marry or how you should approach your courtship process other than to remind you of what scripture teaches concerning marriage.</p>\n\n<p>First, a believer must seek a believing spouse:</p>\n\n<h5>2Cor. 6:14&nbsp; Do not be&nbsp;bound together&nbsp;with unbelievers; for what partnership have righteousness and lawlessness, or what fellowship has light with darkness?&nbsp;</h5>\n\n<p>Even more, a believer should seek for the most mature, stable follower of Christ possible. Marriage is a partnership, where goals, values and practices need to work together to glorify Christ. Marriage also includes (at times) conflict and strife, and in all these things a believer should possess a mate who sees the world through a common lens of scripture.&nbsp;</p>\n\n<p>Spend time with your love interest asking questions about each other&rsquo;s view of scripture and of best to live to serve Christ. These conversations are important to uncovering spiritual differences, if any, and resolving them before marriage. For the same reasons, we also recommend spending time together with the person in prayer and Bible study.&nbsp;</p>\n\n<p>Finally, the Bible teaches we must remain unstained by immorality prior to marriage. As Hebrews says:</p>\n\n<h5>Heb. 13:4&nbsp;Marriage is to be held in honor among all, and the marriage bed is to be undefiled; for fornicators and adulterers God will judge.&nbsp;</h5>\n\n<p>Remain chaste and do not engage in fornication. Remain pure waiting for the day of your marriage, and seek a marriage partner who has done the same.<br />\n<br />\n</p>"
                },
                {
                "topics": [
                           {
                           "ID": "Angels",
                           "topic": "Angels"
                           },
                           {
                           "ID": "Righteousness",
                           "topic": "Righteousness"
                           },
                           {
                           "ID": "Satan",
                           "topic": "Satan"
                           },
                           {
                           "ID": "fallen+angels",
                           "topic": "fallen angels"
                           }
                           ],
                "ID": "2170",
                "postedDate": 1514229060,
                "title": "Will angels or humans fall after Jesus throws Satan into the lake of fire?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/will-angels-or-humans-fall-after-jesus-throws-satan-into-the-lake-of-fire",
                "body": "<p><strong><em>Q:&nbsp;God had an angel turn against Him, and took a third of the angels with him. Is that prevented from ever happening again when all of us get there in heaven because Satan and his demons are thrown into the lake of fire and we are saved so deemed worthy to enter and never get a big head like Satan did? Did God use Satan kind of like Jesus used Judas for the purpose of getting the BIG PLAN accomplished?</em></strong></p>\n\n<p>A:&nbsp;A survey of scripture teaches that demons (i.e., fallen angels) have become corrupt in nature like fallen man. These will not be redeemed since Hebrews teaches that the Lord does not give help (i.e., a way of redemption) to fallen angels. We also know that one-third of the angelic host were convinced by Satan to rebel against God with him, according to Revelation, meaning that&nbsp;the remaining two-thirds of the angelic realm did not follow Satan.&nbsp;</p>\n\n<p>Unlike mankind, all angels were created at once rather than through a process of procreation. We know this because Jesus said in Matthew 22:30 that angels are not given into marriage, which implies they do not procreate. We must conclude that when Satan fell, he had the entire host of angels at his disposal, and of these, he convinced a third to follow him into rebellion. Notably, two-thirds of the angels were not fooled by Satan and remained faithful.</p>\n\n<p>Therefore, we can safely assume that the remaining angels will never fall, since the author of lies failed to draw them in his first attempt and there will be no future source of rebellion in God&rsquo;s creation according to Revelation 21. Simply put, if Satan couldn&#39;t convince the remaining angels to rebel in his earlier attempt, then they will remain faithful forever.&nbsp;</p>\n\n<p>Likewise, we can assume that once we obtain our glorified state in the Kingdom, we will also be impervious to Satan&rsquo;s schemes. There will be no second fall of man, because the source of the fall (i.e., Satan and his lies) has already been judged, according to scripture. Scripture says we are no longer slaves to Satan and have conquered him through our faith in Jesus Christ. We have been made new in Christ&rsquo;s likeness so that we share in Christ&rsquo;s nature and in his desire to obey the Father.</p>\n\n<p>Therefore, both the faithful angels and believers in Jesus Christ (i.e., the elect angels and elect humanity) are saved by God and forever preserved from rebellion. God&rsquo;s original plan for Creation allowed for and even desired a fall of both the angels and of mankind. Self evidently, the Lord permitted His creation to be susceptible to deception and rebellion in the first place, so that a fall would occur in both realms.&nbsp;</p>\n\n<p>Ultimately, the Lord brought about these circumstances so that He might redeem the elect and thereby bring glory to His name for His mercy and love. This is the essence of Paul&rsquo;s exclamation in Romans 8:</p>\n\n<h5><br />\nRom. 8:31&nbsp;What then shall we say to these things? If God is for us, who is against us?&nbsp;<br />\nRom. 8:32&nbsp;He who did not spare His own Son, but delivered Him over for us all, how will He not also with Him freely give us all things?&nbsp;<br />\nRom. 8:33&nbsp;Who will bring a charge against God&rsquo;s elect? God is the one who justifies;&nbsp;<br />\nRom. 8:34&nbsp;who is the one who condemns? Christ Jesus is He who died, yes, rather who was raised, who is at the right hand of God, who also intercedes for us.&nbsp;<br />\nRom. 8:35&nbsp;Who will separate us from the love of Christ? Will tribulation, or distress, or persecution, or famine, or nakedness, or peril, or sword?&nbsp;<br />\nRom. 8:36&nbsp;Just as it is written,&nbsp;&ldquo;For Your sake we are being put to death all day long;&nbsp;We were considered as sheep to be slaughtered.&rdquo;&nbsp;<br />\nRom. 8:37&nbsp;But in all these things we overwhelmingly conquer through Him who loved us.&nbsp;<br />\nRom. 8:38&nbsp;For I am convinced that neither death, nor life, nor angels, nor principalities, nor things present, nor things to come, nor powers,&nbsp;<br />\nRom. 8:39&nbsp;nor height, nor depth, nor any other created thing, will be able to separate us from the love of God, which is in Christ Jesus our Lord.&nbsp;<br />\n&nbsp;</h5>\n\n<h5><span style=\"font-size: 13px;\">You might find our </span><a href=\"/bible-studies/romans-2017\" style=\"font-size: 13px;\">Romans study</a><span style=\"font-size: 13px;\"> helpful concerning this question.</span></h5>"
                },
                {
                "topics": [
                           {
                           "ID": "women",
                           "topic": "women"
                           },
                           {
                           "ID": "woman",
                           "topic": "woman"
                           },
                           {
                           "ID": "women+teachers",
                           "topic": "women teachers"
                           },
                           {
                           "ID": "Obedience",
                           "topic": "Obedience"
                           }
                           ],
                "ID": "2169",
                "postedDate": 1513888020,
                "title": "In a mixed gathering in church, may women speak?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/in-a-mixed-gathering-may-women-speak-up-on-things-being-discussed",
                "body": "<p><strong><em>Q:&nbsp;In a mixed gathering at a bible study, may women speak up on things being spoken? Would that be going against 1 Cor. 14; 34 if one does?</em></strong></p>\n\n<p>A:&nbsp;Generally, in mixed groups the Bible expects men to lead teaching and to ask and answer the questions, as Paul says:</p>\n\n<h5>1Tim. 2:11&nbsp;A woman must quietly receive instruction with entire submissiveness.&nbsp;<br />\n1Tim. 2:12&nbsp;But I do not allow a woman to teach or exercise authority over a man, but to remain quiet.&nbsp;<br />\n1Tim. 2:13&nbsp;For it was Adam who was first created, and then Eve.&nbsp;<br />\n1Tim. 2:14&nbsp;And it was not Adam who was deceived, but the woman being deceived, fell into transgression.&nbsp;<br />\n1Tim. 2:15&nbsp;But women will be preserved through the bearing of children if they continue in faith and love and sanctity with self-restraint.&nbsp;</h5>\n\n<p>On the other hand, this principle may include some minor variations in practice. Our ministry features several articles that explore this point in detail; &#39;<a href=\"/bible-answers/can_a_woman_teach_men_in_the_church\">Can a woman teach men in the church</a>&#39; and &#39;<a href=\"/bible-answers/can_a_woman_ever_teach_a_man\">Can a woman ever teach a man</a>?&#39;</p>\n\n<p>Nevertheless, Paul does give a very specific command to the church in Corinth concerning women speaking up to challenge men during the teaching:</p>\n\n<h5>1Cor. 14:34&nbsp; The women are to keep silent in the churches; for they are not permitted to speak, but are to subject themselves, just as the Law also says.&nbsp;<br />\n1Cor. 14:35&nbsp;If they desire to learn anything, let them ask their own husbands at home; for it is improper for a woman to speak in church.&nbsp;<br />\n&nbsp;</h5>\n\n<p>Notice in v.34 that Paul juxtaposes women speaking up in the service with women subjecting themselves to male headship (authority). Paul is implying that when the women in Corinth were asking questions, they were doing it for improper motives. The women were trying to undermine the authority of the male teachers by questioning their teaching.&nbsp;Their questions were not (apparently) asked in a sincere desire to understand the truth. Instead, the questioning was part of an effort to show themselves smarter than the men who taught them. It was a sinful motive.</p>\n\n<p>In fact, earlier in the letter Paul described how women in the church in Corinth were taking dramatic steps (including shaving their heads) to claim equality with men, which violated God&rsquo;s prescription for the church. Therefore, it is reasonable to conclude that Paul&rsquo;s point in chapter 14 concerning women speaking in the assembly was limited to those women who spoke up expressly for the purpose of challenging and undermining male teachers.&nbsp;</p>\n\n<p>Consequently, we teach that it is permissible for a woman to ask questions in a mixed group so long as she does so with a genuine interest in obtaining clarification or to understand scripture better. She may ask her question publicly so long as her intentions are pure. If the questioning transitions into a confrontation, challenges or a dispute, then the woman should silence herself and expect her husband to answer her questions or else carry the questioning forward on her behalf (assuming he shares her concerns).<br />\n&nbsp;</p>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>"
                },
                {
                "topics": [
                           {
                           "ID": "eisegesis",
                           "topic": "eisegesis"
                           },
                           {
                           "ID": "false+teaching",
                           "topic": "false teaching"
                           },
                           {
                           "ID": "old+testament",
                           "topic": "old testament"
                           },
                           {
                           "ID": "Jesus",
                           "topic": "Jesus"
                           },
                           {
                           "ID": "Law",
                           "topic": "Law"
                           },
                           {
                           "ID": "Gospel",
                           "topic": "Gospel"
                           }
                           ],
                "ID": "2168",
                "postedDate": 1513886400,
                "title": "Are Matthew, Mark, Luke, John and Acts part of the Old Testament?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/are-matthew-mark-luke-john-and-acts-part-of-the-old-testament",
                "body": "<p><strong><em>Q: Are Matthew, Mark, Luke, John and Acts are the Old Testament? In order to have a testament, you must have the death of the testator. By the very Biblical definition of a testament as given in Hebrews 9:16-17 anything you read before the death of Jesus Christ is the Old Testament; the time of the law. The book of Romans tells us that the law ended with the death of Jesus Christ and we are now under an age of grace.</em></strong></p>\n\n<p>A:&nbsp;Though you may not be pleased to hear it from us, your views of scripture are not accurate. In every case below, you have taken scripture out of context, distorting it&rsquo;s true meaning and misapplied it to support your preconceived notion. You are interpreting the scriptures <a href=\"https://en.wikipedia.org/wiki/Eisegesis\" target=\"_blank\">eisegetically</a>, which always results in a false understanding. Instead, you must interpret each verse in its proper context so as to uncover the meaning the author intended, which is the proper form of interpretation called <a href=\"https://en.wikipedia.org/wiki/Eisegesis\" target=\"_blank\">exegesis</a>.</p>\n\n<p>None of the verses you quoted truly mean what you suggested they mean, and therefore the conclusions you draw from your misinterpretations (i.e., that the four Gospels are not intended for Gentiles, etc.) are both bizarre and unbiblical. In fact, scripture itself contradicts your conclusion:</p>\n\n<h5>2Tim. 3:16&nbsp;All Scripture is inspired by God and profitable for teaching, for reproof, for correction, for training in righteousness;&nbsp;<br />\n2Tim. 3:17&nbsp;so that the man of God may be adequate, equipped for every good work.&nbsp;</h5>\n\n<p>Furthermore, the entire Bible preaches the same Gospel of salvation through faith in a Messiah sent to Israel and to the whole world. Genesis preaches this Gospel. Exodus preaches this Gospel. The prophets preach this Gospel. And certainly, the first four books of the New Testament preach this same Gospel, as does Paul and the other epistles writers. The Gospel Paul mentions in 1Cor 15 and elsewhere is the very same Gospel Jesus preached (it is His Gospel, after all), and it&rsquo;s the same Gospel revealed progressively throughout the Old Testament (Genesis-Malachi).</p>\n\n<p>As Hebrews declares:</p>\n\n<h5>Heb. 1:1&nbsp;&nbsp;God, after He spoke long ago to the fathers in the prophets in many portions and in many ways,&nbsp;<br />\nHeb. 1:2&nbsp;in these last days has spoken to us in His Son, whom He appointed heir of all things, through whom also He made the world.&nbsp;</h5>\n\n<p>There is no &ldquo;Old Testament&rdquo; Gospel. Yes, many in Israel and many among the Gentile nations have neglected the true Gospel and have pursued a false salvation of works, but the Bible is not to blame for that mistake. Neither the Old Testament nor the New Testament told Jews or Gentiles to pursue God through works. The Bible has preached the same Gospel from Genesis to Revelation, but many refuse to hear it.&nbsp;</p>\n\n<p>As you said, only by faith in the promises of God may one be saved, and this is the way Abraham was saved in the Old Testament (prior to Christ), and it is also the way we are saved now. As Paul said:</p>\n\n<h5>Rom. 4:3&nbsp;For what does the Scripture say? &ldquo;Abraham believed God, and it was credited to him as righteousness.&rdquo;&nbsp;<br />\nRom. 4:4&nbsp;Now to the one who works, his wage is not credited as a favor, but as what is due.&nbsp;<br />\nRom. 4:5&nbsp;But to the one who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness,&nbsp;</h5>\n\n<p>Finally, if you truly believe that the Gospel accounts are part of an &ldquo;Old Testament&rdquo; preaching of salvation by works, then you do not understand the Gospel nor do you understand the teaching of the Old Testament. We strongly advise you to listen to both our <a href=\"/bible-studies/genesis_2011\">Genesis</a> and <a href=\"/bible-studies/the-gospel-of-john\">Gospel of John</a> Bible studies to set your understanding of scripture correctly.&nbsp;</p>\n\n<p>We also feel compelled to remind you of scripture&rsquo;s warning concern those who would mishandle the word of God:</p>\n\n<h5>James 3:1&nbsp;Let not many of you become teachers, my brethren, knowing that as such we will incur a stricter judgment.&nbsp;</h5>\n\n<p>Finally, it might help your understanding to remember that all New Testament scripture (including the Gospel accounts) were written long after Jesus&rsquo; death. So, therefore, all New Testament scripture was written after the Law had been completed by Jesus&rsquo; death and resurrection.<br />\n&nbsp;</p>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>"
                },
                {
                "topics": [
                           {
                           "ID": "Church",
                           "topic": "Church"
                           },
                           {
                           "ID": "Obedience",
                           "topic": "Obedience"
                           },
                           {
                           "ID": "Evangelism",
                           "topic": "Evangelism"
                           },
                           {
                           "ID": "christian",
                           "topic": "christian"
                           },
                           {
                           "ID": "church+member",
                           "topic": "church member"
                           }
                           ],
                "ID": "2167",
                "postedDate": 1513801620,
                "title": "Is a church covenant/ contract biblical?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/is-a-church-covenant-contract-biblical",
                "body": "<p><strong><em>Q:&nbsp;Is a church covenant/contract biblical? Do such requirements put us under a new law? Even if most of the requirements are biblical should a Christian agree to them? Where is my sin in this matter affecting my judgment? I&#39;m sorry for the long drawn out question.&nbsp;</em></strong></p>\n\n<p>A:&nbsp;Regarding membership rules or requirements, you are correct that the Bible does not specify a &ldquo;membership&rdquo; process for a Christian in joining or participating in a local congregation.</p>\n\n<p>Nevertheless, the Bible does imply the need for Christians to establish a relationship in a local body and submit to the leadership in that body. The book of Hebrews implies that believers should actively participate in a gathering on a regular basis:</p>\n\n<h5>Heb. 10:24&nbsp;and let us consider how to stimulate one another to love and good deeds,&nbsp;<br />\nHeb. 10:25&nbsp;not forsaking our own assembling together, as is the habit of some, but encouraging one another; and all the more as you see the day drawing near.&nbsp;</h5>\n\n<p>So regular participation in a body of believers is a biblical expectation. Furthermore, believers are called by scripture to submit to the leaders of their church body:</p>\n\n<h5>Heb. 13:17&nbsp;Obey your leaders and submit to them, for they keep watch over your souls as those who will give an account. Let them do this with joy and not with grief, for this would be unprofitable for you.&nbsp;</h5>\n\n<p>Therefore, on the basis of this c command, we can say that if church leaders decide to place certain expectations on the church body for the benefit of their spiritual health (i.e., requiring regular attendance on Sundays, participation in home groups, etc.), then the body should submit to those in authority. Such rules only become legalism if the leaders teach that the rules are God&rsquo;s requirements, not merely man-made expectations.&nbsp;</p>\n\n<p>On the other hand, your pastor&rsquo;s comments connecting &ldquo;being Christian&rdquo; with attending church are very concerning. To equate attending church with being a Christian would seem to suggest a human work is required to be saved, which the Bible clearly refutes. No human work &ndash; not even attending church &ndash; is required to be saved.&nbsp;</p>\n\n<p>Furthermore, we know it is possible for even true Christians to stop attending church precisely because the book of Hebrews warns of that very thing! In Hebrews 10 we read:</p>\n\n<h5>Heb. 10:24&nbsp;and let us consider how to stimulate one another to love and good deeds,&nbsp;<br />\nHeb. 10:25&nbsp;not forsaking our own assembling together, as is the habit of some, but encouraging one another; and all the more as you see the day drawing near.&nbsp;</h5>\n\n<p>Notice the writer says some in the body have fallen into the habit of \"forsaking the gathering.&rdquo; The writer is acknowledging that believers can become lazy and disobedient so that they stop seeking for fellowship among other believers. Clearly, these believers are no less saved, though they are acting in a disobedient manner.</p>\n\n<p>Consequently, we suggest you seek to clarify your pastor&rsquo;s comments in a respectful manner. If you should determine that he believes attending church is a conclusive litmus test for true faith, then we would recommend you consider seeking fellowship elsewhere, since such views are unbiblical and potentially harmful to your spiritual growth in the faith.</p>\n\n<p>In summary, every believer should be participating regularly in a church congregation, and if the leaders of that congregation place certain requirements on that participation, we should submit to their authority. Only in cases where these requirements contradict scripture or offend out conscience should we raise objections.&nbsp;</p>\n\n<p>Meanwhile, no human work &ndash; not even participation in a church service &ndash; is necessary for salvation. Faith alone in Jesus Christ saves us, and unfortunately, some who have this understanding may yet forsake gathering together with other believers.</p>\n\n<p>You may find it helpful to listen to our <a href=\"/bible-studies/hebrews\">Hebrews</a> study on our website.</p>\n\n<p>&nbsp;</p>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>"
                },
                {
                "topics": [
                           {
                           "ID": "john+calvin",
                           "topic": "john calvin"
                           },
                           {
                           "ID": "calvinism",
                           "topic": "calvinism"
                           },
                           {
                           "ID": "Evangelism",
                           "topic": "Evangelism"
                           },
                           {
                           "ID": "Salvation",
                           "topic": "Salvation"
                           }
                           ],
                "ID": "2166",
                "postedDate": 1513800720,
                "title": "Would a Calvinist be less likely to do works of charity?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/why-do-calvinists-invest-in-mankind",
                "body": "<p><strong><em>Q:&nbsp;Would a follower of Calvinism be willing to make social works (e.g., improve health systems, local economies, build orphanages, etc.) or would only one who isn&#39;t a \"Calvinist\" be evangelical and invest in Bible teaching and disciple reproduction?</em></strong></p>\n\n<p>A:&nbsp;First, we suggest you read the &#39;<a href=\"/bible-answers/what_is_calvinism\">What is Calvinism</a>&#39;&nbsp;article on our website.<br />\n<br />\nAs we commented in that article, believers are not to be followers of &ldquo;Calvinism&rdquo; or any other manmade system. We follow Christ and proclaim the truth of His word.&nbsp;</p>\n\n<p>Secondly, the suggestion that obtaining a proper understanding of God&rsquo;s sovereignty in our salvation necessarily diminishes a believer&#39;s desire to serve Christ by acts of service or by reaching the nations with the Gospel is a false premise. On the contrary, the more a believer knows and understands the doctrines of their salvation, the more the person will be motivated to serve the Master Who bought them.</p>\n\n<p>The scripture is abundantly clear that the Lord grants faith in the heart as He chooses, which you could read our devotional, &#39;<a href=\"/devotionals/wrestling_with_god\">Wrestling with God</a>,&#39; but this truth doesn&rsquo;t diminish our enthusiasm to serve Him; on the contrary, it motivates believers to seek the lost.&nbsp;</p>\n\n<p>In fact, knowing that the Lord has the power to change a heart is the primary basis for our evangelism. As Jesus said:</p>\n\n<h5>Mark 10:24&nbsp;The disciples were amazed at His words. But Jesus answered again and said to them, &ldquo;Children, how hard it is to enter the kingdom of God!<br />\nMark 10:25&nbsp;&ldquo;It is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God.&rdquo;<br />\nMark 10:26&nbsp;They were even more astonished and said to Him, &ldquo;Then who can be saved?&rdquo;&nbsp;<br />\nMark 10:27&nbsp;Looking at them, Jesus&nbsp; said, &ldquo;With people, it is impossible, but not with God; for all things are possible with God.&rdquo;</h5>\n\n<p>Salvation is impossible for men alone, but God can bring salvation to hearts by granting faith, and so we proclaim the Gospel knowing that those who have ears to hear will respond. God grants the ability to hear the Gospel:</p>\n\n<h5>Rom. 10:17&nbsp;So faith comes from hearing, and hearing by the word of Christ.&nbsp;</h5>\n\n<p>Therefore, a believer&rsquo;s desire to serve God by preaching the Gospel or by any other work of service is increased (not decreased) by knowing that God is in control of the outcome. Our desire to serve Him is based in our confidence that the Lord is the One Who yields the results.&nbsp;</p>\n\n<p>Ironically, if we were personally responsible for the outcome in persuading a person to believe, we would have much less confidence to pursue evangelism, for who is capable of making an argument persuasive enough to overcome the pride of the flesh?&nbsp;</p>\n\n<p>On the&nbsp;other hand, if our prospects for success are dependent entirely upon God&rsquo;s grace, then how can we NOT act in service to God? Knowing God is in control of the outcome is a great motivator in moving forward as His ambassador, since God is capable of granting us success at any moment. We can go out serving Him in much greater confidence and enthusiasm knowing the result rests on Him alone.</p>\n\n<p>Finally, you may find the&nbsp;article, &#39;<a href=\"/bible-answers/why_do_we_evangelize\">Why do we Evangelize</a>,&#39; helpful.<br />\n<br />\n&nbsp;</p>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>"
                },
                {
                "topics": [
                           {
                           "ID": "cults",
                           "topic": "cults"
                           },
                           {
                           "ID": "soul+sleep",
                           "topic": "soul sleep"
                           },
                           {
                           "ID": "Death",
                           "topic": "Death"
                           },
                           {
                           "ID": "Resurrection",
                           "topic": "Resurrection"
                           },
                           {
                           "ID": "False+Teachers",
                           "topic": "False Teachers"
                           },
                           {
                           "ID": "sleep",
                           "topic": "sleep"
                           },
                           {
                           "ID": "Rapture",
                           "topic": "Rapture"
                           }
                           ],
                "ID": "2165",
                "postedDate": 1513795080,
                "title": "What does the Bible say about our resurrection and &#8220;soul sleep?&#8217;&#8217;",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/what-does-the-bible-say-about-our-resurrection-and-soul-sleep",
                "body": "<p><strong><em>Q: When we die, are we immediately&nbsp;with the Lord or are we in a &#39;soul sleep&#39; until the rapture or our time of the resurrection?&nbsp;</em></strong></p>\n\n<p>A:&nbsp;The Bible never teaches the concept of &ldquo;soul sleep.&rdquo; Passages like 1Thes 5:6 in our English Bibles use the word &ldquo;sleep&rdquo; as a euphemism for death. Paul is referring to death using the word &ldquo;sleep&rdquo; just as we might say &ldquo;passed away&rdquo; today. He is not speaking literally of a sleeping process. As you quoted from&nbsp;2Cor 5:6-8, believer&rsquo; souls are immediately and consciously present with the Lord from the moment of our death. Later at the resurrection, we receive our new bodies.&nbsp;</p>\n\n<p>Likewise, passages like <a href=\"/bible-studies/the_book_of_luke\">Luke</a> 16:22-23 make clear that unbelievers also move directly from death to a conscious existence in torment. No one enters a time of unconscious&nbsp;&ldquo;sleep.&rdquo; Soul sleep is a false teaching of a false religion.</p>\n\n<p>Our website offers more information on the&nbsp;false religion of <a href=\"/bible-answers/is-the-seventh-day-adventist-church-a-cult\">Seventh-Day Adventists</a>.</p>\n\n<p>For further reading, we&nbsp;also have a full article focused on <a href=\"/bible-answers/explain_where_we_go_when_we_die\">where we go after death</a>.<br />\n<br />\n&nbsp;</p>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>"
                },
                {
                "topics": [
                           {
                           "ID": "Predestination",
                           "topic": "Predestination"
                           },
                           {
                           "ID": "Grace",
                           "topic": "Grace"
                           },
                           {
                           "ID": "Salvation",
                           "topic": "Salvation"
                           },
                           {
                           "ID": "Paul",
                           "topic": "Paul"
                           }
                           ],
                "ID": "2164",
                "postedDate": 1513780440,
                "title": "Explain Romans 3:23-24?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/explain-romans-323-24",
                "body": "<p><strong><em>Q: Is Paul saying all have the ability to be justified by grace? if so, how does this fit with the rest of his teaching about being selected before birth?</em></strong></p>\n\n<p>A:&nbsp;Your confusion comes from taking these two verses out of their larger context in Romans 3.&nbsp;When we take vs.24-25 out of context, we lose sight of what Paul meant when he used the word&nbsp;&ldquo;all.&rdquo; So by returning to the context of the&nbsp;passage, we find the intended meaning of the word &ldquo;all.\" &nbsp;</p>\n\n<h5>Rom. 3:21&nbsp; But now apart from the Law the righteousness of God has been manifested, being witnessed by the Law and the Prophets,<br />\nRom. 3:22&nbsp;even the righteousness of God through faith in Jesus Christ for all those who believe; for there is no distinction;<br />\nRom. 3:23&nbsp;for all have sinned and fall short of the glory of God,<br />\nRom. 3:24&nbsp;being justified as a gift by His grace through the redemption which is in Christ Jesus;<br />\nRom. 3:25&nbsp;whom God displayed publicly as a propitiation in His blood through faith. This was to demonstrate His righteousness&nbsp;because in the forbearance of God He passed over the sins previously committed;<br />\nRom. 3:26&nbsp;for the demonstration, I say, of His righteousness at the present time, so that He would be just and the justifier of the one who has faith in Jesus.<br />\nRom. 3:27&nbsp; Where then is boasting? It is excluded. By what kind of law? Of works? No, but by a law of faith.<br />\nRom. 3:28&nbsp;For we maintain that a man is justified by faith apart from works of the Law.<br />\nRom. 3:29&nbsp;Or is God the God of Jews only? Is He not the God of Gentiles also? Yes, of Gentiles also,<br />\nRom. 3:30&nbsp;since indeed God who will justify the circumcised by faith and the uncircumcised through faith is one.</h5>\n\n<p>Paul describes our righteousness may be found. The righteousness required to enter Heaven is the righteousness of God, given to us by God&rsquo;s grace, apart from works. Notice in v.22 that Paul adds that this salvation is &ldquo;for all those who believe; there is no distinction&hellip;&rdquo; Paul is saying that the means of salvation is the same for both Jew and Gentile. There is no separate plan for Gentiles apart from Jews. We find this conclusion confirmed further when we look at the end of the passage, as&nbsp;Paul concludes God is the God of both Jew and Gentile.&nbsp;</p>\n\n<p>Therefore, when Paul uses the term &ldquo;all&rdquo; in this passage, he is referring to both Jew and Gentile. The word &ldquo;all\" doesn&rsquo;t refer to all humanity.&nbsp;<br />\nFor a greater understanding of these things, we strongly recommend you listen to our entire <a href=\"/bible-studies/romans-2017\">Romans</a> Bible study.<br />\n&nbsp;</p>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>"
                },
                {
                "topics": [
                           {
                           "ID": "False+Teachers",
                           "topic": "False Teachers"
                           },
                           {
                           "ID": "false+prophets",
                           "topic": "false prophets"
                           },
                           {
                           "ID": "bad+fruit",
                           "topic": "bad fruit"
                           },
                           {
                           "ID": "bearing+fruit",
                           "topic": "bearing fruit"
                           }
                           ],
                "ID": "2162",
                "postedDate": 1513610040,
                "title": "Explain Matthew 7:18-20",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/explain-matthew-718-20",
                "body": "<p><strong><em><a href=\"/bible-studies/isaiah\">/bible-studies/isaiah</a>Q: Will you explain Matthew 7-18-20?</em></strong></p>\n\n<p>A:&nbsp;The verses you asked us to explain are part of the following larger passage:<br />\n&nbsp;</p>\n\n<h5>Matt. 7:15&nbsp;&ldquo;Beware of the false prophets, who come to you in sheep&rsquo;s clothing, but inwardly are ravenous wolves.<br />\nMatt. 7:16&nbsp;&ldquo;You will know them by their fruits. Grapes are not gathered from thorn bushes nor figs from thistles, are they?<br />\nMatt. 7:17&nbsp;&ldquo;So every good tree bears good fruit, but the bad tree bears bad fruit.<br />\nMatt. 7:18&nbsp;&ldquo;A good tree cannot produce bad fruit, nor can a bad tree produce good fruit.<br />\nMatt. 7:19&nbsp;&ldquo;Every tree that does not bear good fruit is cut down and thrown into the fire.<br />\nMatt. 7:20&nbsp;&ldquo;So then, you will know them by their fruits.<br />\n&nbsp;</h5>\n\n<p>Notice that Jesus is speaking about false prophets. False prophets (or teachers) are those who claim to know the Lord and to follow Him but actually are not truly His disciples. They are false in every respect: they do not know the Lord, they do not know His word, nor do they following His commandments. Therefore, they are &ldquo;wolves&rdquo; masquerading as &ldquo;sheep.&rdquo;&nbsp;</p>\n\n<p>Christ tells His true followers to avoid falling victim to these false teachers by evaluating the &ldquo;fruit&rdquo; in their lives. Fruit refers to the product of their ministry. Just as a tree&rsquo;s output is the fruit it yields after a season, so is a teacher&rsquo;s production measure by the lasting effect (i.e., fruit) they yield in the lives of their students.&nbsp;<br />\nJesus teaches the principle that true teachers of God&rsquo;s word will naturally and always produce good outcomes in the lives of their students, because these teachers are sharing the true word of God. The word of God itself is produces the fruit in the lives of the hearers, and since the teacher is sharing the word in an honest way, that teacher will naturally yield good outcomes.&nbsp;</p>\n\n<p>On the other hand, false teachers or prophets do not teach the word of God. Instead, they teach man-made conclusion in place of the word of God, as Jesus said a few&nbsp;verses earlier in this chapter:</p>\n\n<h5>Mark 7:7&nbsp;&lsquo;But in vain do they worship Me,&nbsp;<br />\n&nbsp;&nbsp; &nbsp;Teaching as doctrines the&nbsp;precepts&nbsp;of men.&rsquo;</h5>\n\n<p>Those who spread false teaching will&nbsp;always&nbsp;yield &ldquo;bad fruit,&rdquo; which refers to the absence of godliness in the lives their students. Those who listen to false teaching do not experience changed lives or develop greater love for and devotion to Christ Jesus and His word. They may experience a season of&nbsp;excitement or enthusiasm, but in the end they cannot grow spiritually nor&nbsp;show&nbsp;the fruit of the Spirit in their lives since they lack the pure milk of the word of God, as Peter says:<br />\n1Pet. 2:2&nbsp;like newborn babies, long for the pure milk of the word, so that by it you may grow in respect to salvation,</p>\n\n<p>Simply put, false teaching is not from God and therefore it lacks the power of God&rsquo;s word. So Jesus warns the believer to evaluate the product of a person&rsquo;s teaching to know whether such a person is teaching&nbsp;truthfully or not. In v.17-18 Jesus says that those who&nbsp;teach God&rsquo;s word cannot yield good fruit, since only God&rsquo;s word has the power to produce that outcome.&nbsp;Likewise, those who teach God&rsquo;s word honestly will always see&nbsp;good fruit, because the word of God will not go forth and return void, as <a href=\"/bible-studies/isaiah\">Isaiah</a> says:</p>\n\n<h5>Is. 55:10 &nbsp;&ldquo;For as the rain and the snow come down from heaven,&nbsp;<br />\n&nbsp;&nbsp; &nbsp;And do not return there without watering the earth&nbsp;<br />\n&nbsp;&nbsp; &nbsp;And making it bear and sprout,&nbsp;<br />\n&nbsp;&nbsp; &nbsp;And furnishing seed to the sower and bread to the eater;<br />\nIs. 55:11 &nbsp;So will My word be which goes forth from My mouth;&nbsp;<br />\n&nbsp;&nbsp; &nbsp;It will not return to Me empty,&nbsp;<br />\n&nbsp;&nbsp; &nbsp;Without accomplishing what I desire,&nbsp;<br />\n&nbsp;&nbsp; &nbsp;And without succeeding in the matter for which I sent it.<br />\n&nbsp;</h5>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>"
                },
                {
                "topics": [
                           {
                           "ID": "Jesus",
                           "topic": "Jesus"
                           },
                           {
                           "ID": "immanuel",
                           "topic": "immanuel"
                           },
                           {
                           "ID": "emmanuel",
                           "topic": "emmanuel"
                           },
                           {
                           "ID": "jesus+name",
                           "topic": "jesus name"
                           }
                           ],
                "ID": "2160",
                "postedDate": 1513608480,
                "title": "Why was Jesus named Jesus, and not Emmanuel?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "vbvmadmin",
                "authorName": "vbvmadmin",
                "url": "https://www.versebyverseministry.org/bible-answers/why-was-jesus-named-jesus-and-not-emmanuel",
                "body": "<p><strong><em>Q:&nbsp;Why was Jesus named Jesus, and not Emmanuel?</em></strong></p>\n\n<p>A:&nbsp;The Messiah goes by many other names in scripture, including Immanuel. &nbsp;The name given to the Christ child came directly from the Father Himself, as revealed by the angel:</p>\n\n<h5>Luke 1:30&nbsp;The angel said to her, &ldquo;Do not be afraid, Mary; for you have found favor with God.<br />\nLuke 1:31&nbsp;&ldquo;And behold, you will conceive in your womb and bear a son, and you shall name Him Jesus.</h5>\n\n<p>The name Jesus is actually Yeshua in Hebrew, which is also translated Joshua. The name means &ldquo;the Lord is salvation,&rdquo; so clearly the Father wanted His Son to bear a name that announced His purpose. &nbsp;</p>\n\n<p>This is the earthly name for our Messiah, but before He was revealed to the world, the scripture speak of Him using other names. Collectively, there are over 200 different names or titles given to the Messiah in scripture. Taken together, these name describe the character and work of the Messiah in the plan of God.&nbsp;<br />\nThe first name the Lord gave Himself is found in Exodus:</p>\n\n<h5>Ex. 3:14&nbsp;God said to Moses, &ldquo;I AM WHO I AM&rdquo;; and He said, &ldquo;Thus you shall say to the sons of Israel, &lsquo;I AM has sent me to you.&rsquo;&rdquo;</h5>\n\n<p>Later in John&rsquo;s Gospel, Jesus continued to use this name in a subtle way, when He responded to the Pharisees this way:</p>\n\n<h5>John 8:58&nbsp;Jesus said to them, &ldquo;Truly, truly,&nbsp;I&nbsp;say to you, before Abraham was born,&nbsp;I am.&rdquo;</h5>\n\n<p>In His return to earth, the Lord will assume yet another name, as Jesus says in Revelation 3:</p>\n\n<h5>Rev. 3:12&nbsp;&lsquo;He who overcomes, I will make him a pillar in the temple of My God, and he will not go out from it anymore; and I will write on him the&nbsp;name&nbsp;of My God, and the&nbsp;name&nbsp;of the city of My God, the new Jerusalem, which comes down out of heaven from My God, and My new&nbsp;name.</h5>\n\n<p>So even the name Jesus is not the Lord&#39;s final name. His new name is described this way in Revelation 19:</p>\n\n<h5>Rev. 19:16&nbsp;And on His robe and on His thigh He has a name written, &ldquo;KING OF KINGS, AND LORD OF LORDS.&rdquo;</h5>\n\n<p>So the question of what is the Messiah&rsquo;s name is different than asking a human being for a name.&nbsp;Since there is no one like the Lord, He doesn&rsquo;t bear a name to distinguish Himself from another. The only reason the Lord adopts a name is to describe Himself to His Creation.&nbsp;Therefore, the Lord names Himself as a means of describing Himself to mankind using multiple names.&nbsp;<br />\n&nbsp;</p>"
                },
                {
                "topics": [
                           {
                           "ID": "Sin",
                           "topic": "Sin"
                           },
                           {
                           "ID": "Salvation",
                           "topic": "Salvation"
                           },
                           {
                           "ID": "Judgment",
                           "topic": "Judgment"
                           },
                           {
                           "ID": "Jesus",
                           "topic": "Jesus"
                           },
                           {
                           "ID": "Forgiveness",
                           "topic": "Forgiveness"
                           },
                           {
                           "ID": "false+teaching",
                           "topic": "false teaching"
                           }
                           ],
                "ID": "2157",
                "postedDate": 1513195260,
                "title": "Is the entire world forgiven of their sins because of Christs death?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "VBVM Staff",
                "authorName": "VBVM Staff",
                "url": "https://www.versebyverseministry.org/bible-answers/is-the-entire-world-forgiven-of-their-sins-because-of-christs-death",
                "body": "<p><strong><em>Q:&nbsp;Is it true that the whole worlds sins are forgiven at the moment of Christ&#39;s death on the cross? We don&#39;t have to ask for his forgiveness, but in order to be saved we must place our faith in what happens to Christ after his death, which is; we are to place faith in His resurrection?</em></strong></p>\n\n<p>A:&nbsp;In recent times, a false teaching has emerged within the church to the effect that Jesus&rsquo; payment on the cross forgave the sins of the entire world without regard to faith. Usually, this teaching cites 1John 2:1-2 to support such a conclusion:</p>\n\n<h5>1John 2:1&nbsp; My little children, I am writing these things to you so that you may not sin. And if anyone sins, we have an Advocate with the Father, Jesus Christ the righteous;<br />\n1John 2:2&nbsp;and He Himself is the propitiation for our sins; and not for ours only, but also for those of the whole world.</h5>\n\n<p>This interpretation is a misinterpretation of John&rsquo;s teaching and is contrary to other scripture.&nbsp;</p>\n\n<p>First, John&rsquo;s teaching in 1John 2 is not arguing for universal salvation. John was writing to an audience of Jewish believers living in the Diaspora in the mid-first century. To these believers, John says that Christ&rsquo;s death on the cross was a payment not only for them but for the &ldquo;whole world,&rdquo; meaning for all kinds of men (i.e., Jew &amp; Gentile), in all places and throughout all history. The Lord was dying for the sins of humanity, not just to save the Jews of the first century.&nbsp;</p>\n\n<p>John&#39;s comment is similar to the statements of other writers of the New Testament when they say:&nbsp;</p>\n\n<h5>Rom. 6:10&nbsp;For&nbsp;the death that He died, He died to sin&nbsp;once for all; but the life that He lives, He lives to God.</h5>\n\n<h5>Heb. 7:26&nbsp; For it was fitting for us to have such a high priest, holy, innocent, undefiled, separated from sinners and exalted above the heavens;<br />\nHeb. 7:27&nbsp;who does not need daily, like those high priests, to offer up sacrifices, first for His own sins and then for the sins of the people, because this He did once for all when He offered up Himself.<br />\nHeb. 9:11&nbsp; But when Christ appeared as a high priest of the good things to come, He entered through the greater and more perfect tabernacle, not made with hands, that is to say, not of this creation;<br />\nHeb. 9:12&nbsp;and not through the blood of goats and calves, but through His own blood, He entered the holy place once for all, having obtained eternal redemption.</h5>\n\n<h5>1Pet. 3:18&nbsp;For Christ also died for sins once for all, the just for the unjust, so that He might bring us to God, having been put to death in the flesh, but made alive in the spirit;</h5>\n\n<p>In all these passages, the author is speaking of the sufficiency of Christ&rsquo;s atoning work. His death is a once-for-all sacrifice sufficient to enact the Father&rsquo;s plan of salvation such that no additional sacrifice is needed. No additional Messiah is required. Jesus did all the work needed.</p>\n\n<p>Therefore, these statements do NOT mean that the payment of Christ on the cross was applied to the sins of all humanity nor that all people will ultimately benefit from it. As John himself says:</p>\n\n<h5>John 3:17&nbsp;&ldquo;For God did not send the Son into the world to judge the world, but that the world might be saved through Him.<br />\nJohn 3:18&nbsp;&ldquo;He who believes in Him is not judged; he who does not believe has been judged already, because he has not believed in the name of the only begotten Son of God.</h5>\n\n<p>Notice, those&nbsp;who do not believe are showing evidence they were &ldquo;judged already&rdquo; because they did not believe. Men are born sinners, and therefore all human beings are due judgment from birth. As Paul says:</p>\n\n<h5>Rom. 3:10 &nbsp;as it is written,&nbsp;<br />\n&nbsp;&nbsp; &nbsp;&ldquo;There is none righteous, not even one;<br />\nRom. 3:11 &nbsp;There is none who understands,&nbsp;<br />\n&nbsp;&nbsp; &nbsp;There is none who seeks for God;<br />\nRom. 3:12 All have turned aside, together they have become useless;&nbsp;<br />\n&nbsp;&nbsp; &nbsp;There is none who does good,&nbsp;<br />\n&nbsp;&nbsp; &nbsp;There is not even one.&rdquo;</h5>\n\n<p>As someone once said, we are not sinners because we sin. We sin because we are born sinners. Therefore, all men are due judgment for their sin nature from birth, not for some specific sinful decision or action during their life.&nbsp;Those who fail to place their trust in Christ will be judged for their sin nature and the life of sin that resulted.&nbsp;</p>\n\n<p>As John himself writes in Revelation:</p>\n\n<h5>Rev. 20:11&nbsp; Then I saw a great white throne and Him who sat upon it, from whose presence earth and heaven fled away, and no place was found for them.<br />\nRev. 20:12&nbsp;And I saw the dead, the great and the small, standing before the throne, and books were opened; and another book was opened, which is the book of life; and the dead were judged from the things which were written in the books, according to their deeds.<br />\nRev. 20:13&nbsp;And the sea gave up the dead which were in it, and death and Hades gave up the dead which were in them; and they were judged, every one of them according to their deeds.<br />\nRev. 20:14&nbsp;Then death and Hades were thrown into the lake of fire. This is the second death, the lake of fire.<br />\nRev. 20:15&nbsp;And if anyone&rsquo;s name was not found written in the book of life, he was thrown into the lake of fire.</h5>\n\n<p>At the judgment, the world of unbelievers will be called to account. They will not be judged for a specific sin of rejecting Christ. In fact, many of these will never have even heard the name Jesus or been exposed to the Gospel. Millions die every day&nbsp;who have never heard the name Jesus. Nevertheless, they will be rightly judged at the Great White Throne since they are sinners by nature and are due the penalty of sin.&nbsp;</p>\n\n<p>Only by God&rsquo;s grace may a person come to trust in God&rsquo;s propitiation in Christ and be saved from the penalty of their sin. The sacrifice of Christ on the cross is the once-for-all payment for the whole world, but the effective application of His payment requires God&rsquo;s grace to bring a man or woman to trust in that payment.&nbsp;</p>\n\n<p>Regarding the unforgivable sin, please read <a href=\"/bible-answers/what-is-the-unforgivable-sin\">our article</a> on this important question.</p>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>"
                },
                {
                "topics": [
                           {
                           "ID": "Paul",
                           "topic": "Paul"
                           },
                           {
                           "ID": "missionary",
                           "topic": "missionary"
                           }
                           ],
                "ID": "2156",
                "postedDate": 1513194900,
                "title": "How many missionary trips did Paul make?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "vbvmadmin",
                "authorName": "vbvmadmin",
                "url": "https://www.versebyverseministry.org/bible-answers/how-many-missionary-trips-did-paul-make",
                "body": "<p><strong><em>Q: How many missionary journeys&nbsp;did Paul make?</em></strong></p>\n\n<p>A:&nbsp;Traditionally, we count that Paul made three, long journeys to share the Gospel with Gentile peoples, but these were not Paul&rsquo;s only missionary travels. He also traveled to Rome in chains near the end of his life, and he may have continued on to Spain.&nbsp;</p>\n\n<p>Even before his first missionary journey, Paul preached in Damascus, Jerusalem, Caesarea, Tarsus, Antioch, and Arabia. Though these travels are not counted as &ldquo;journeys&rdquo; in the traditional sense, they do reflect Paul&rsquo;s constant movement in seeking to fulfill his mission.</p>\n\n<p>You can read about Paul&rsquo;s journeys beginning in <a href=\"/bible-studies/acts_of_the_apostles\">Acts</a> 9 through the end of the book. Additionally, Paul speaks about some of his other travels in <a href=\"/bible-studies/galatians\">Galatians</a> 1.&nbsp;<br />\n&nbsp;</p>\n\n<div class=\"grammarly-disable-indicator\">&nbsp;</div>"
                },
                {
                "topics": [
                           {
                           "ID": "Paul",
                           "topic": "Paul"
                           },
                           {
                           "ID": "saul",
                           "topic": "saul"
                           }
                           ],
                "ID": "2145",
                "postedDate": 1510849140,
                "title": "Why did Saul become Paul?",
                "authorThumbnailSource": "",
                "authorThumbnailAltText": "vbvmadmin",
                "authorName": "vbvmadmin",
                "url": "https://www.versebyverseministry.org/bible-answers/why-did-saul-become-paul",
                "body": "<p><em><strong>Q: Why did Saul&#39;s name change to Paul?</strong></em></p>\n\n<p>A:&nbsp;The name Saul is Hebrew, and the Greek version of that name is Paul. At a point in the <a href=\"/bible-studies/acts_of_the_apostles\">book of Acts</a>, Luke begins addressing Saul by his Greek name, Paul, in Acts 13:</p>\n\n<h5>Acts 13:9&nbsp;But Saul, who was also known as Paul, filled with the Holy Spirit, fixed his gaze on him,&nbsp;</h5>\n\n<p>From this point forward in Acts, Luke uses only Paul&rsquo;s Greek name, reflecting his assignment to preach the Gospel to the Gentiles. So Paul&rsquo;s name was never changed, but Luke chooses to use his Greek name rather than his Hebrew name to reflect Paul&rsquo;s mission to reach Gentiles with the Gospel.&nbsp;</p>"
                }
                ]
}
