{
  "VerseByVerse": {
    "QandAPosts": [{
      "category": "cat1",
      "topics": [{
        "ID": "self-defense",
        "topic": "self-defense"
      }, {
        "ID": "killing",
        "topic": "killing"
      }, {
        "ID": "murder",
        "topic": "murder"
      }, {
        "ID": "guns",
        "topic": "guns"
      }],
      "ID": "1740",
      "postedDate": "1452113760",
      "title": "Can a Christian carry a weapon in self-defense?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q: What does the Bible say about a Christian carrying a weapon for self-defense?&nbsp;\r\n\r\nA: The Bible teaches in various places that a believer may act in self-defense or defense of others without sinning, including acts of defense that involve taking the life of another when necessary.\r\n\r\n\r\n\r\nSome turn to the sixth commandment&#39;s prohibition against murder to claim that the Bible prohibits&nbsp;taking any life under any circumstances, but this is not a correct interpretation. The word murder means, by definition, the unlawful taking of life. Exodus 20 uses the Hebrew word for murder (ratzach) rather than&nbsp;the word for kill (harag) to acknowledge some forms of killing are justified and therefore not sin.\r\n\r\nAccording to scripture, lawful forms of killing include during wartime against enemies of peace (e.g., Numbers 21:1-3), in self-defense (e.g., Exodus 22:2-3), and in defense of others (e.g., Exodus 2:11-12).\r\n\r\nEven Jesus implied the need for believers to&nbsp;prepare for self-defense against those who might threaten Jesus&#39; disciples as fellow \"transgressors\" following Jesus&#39; ascension, when He gave these instructions to the disciples:\r\n\r\nLuke 22:35 &nbsp;And He said to them, &ldquo;When I sent you out without money belt and bag and sandals, you did not lack anything, did you?&rdquo; They said, &ldquo;No, nothing.&rdquo;\r\nLuke 22:36 And He said to them, &ldquo;But now, whoever has a money belt is to take it along, likewise also a bag, and whoever has no sword is to sell his coat and buy one.\r\nLuke 22:37 &ldquo;For I tell you that this which is written must be fulfilled in Me, &lsquo;And He was numbered with transgressors&rsquo;; for that which refers to Me has its fulfillment.&rdquo;\r\nLuke 22:38 They said, &ldquo;Lord, look, here are two swords.&rdquo; And He said to them, &ldquo;It is enough.&rdquo;The means we choose to employ for self-defense (i.e., martial arts, sticks, knives, guns, etc.) are not necessarily important so long as our actions do not go beyond the reasonable needs of self-defense or turn to vengeance, as Paul says:\r\n\r\nRom. 12:17&nbsp;Never pay back evil for evil to anyone. Respect what is right in the sight of all men.&nbsp;\r\nRom. 12:18&nbsp;If possible, so far as it depends on you, be at peace with all men.&nbsp;\r\nRom. 12:19&nbsp;Never take your own revenge, beloved, but leave room for the wrath of God, for it is written, &ldquo;Vengeance is mine, I will repay,&rdquo; says the Lord.&nbsp;Paul says our goal is to remain&nbsp;at peace with men so long as the situation depends on our choices and actions. On the other hand, if another breaks the peace with us, then we are justified to act in defense so long as we don&rsquo;t move to acting in vengeance. Acting in vengeance&nbsp;is initiating revengeful conflict out of malice for another while self-defense is acting without malice to halt or prevent the attack of another. If our actions shift from halting an attack to prosecuting our own attack, then we have crossed the line into sin.&nbsp;\r\n\r\nKeep in mind&nbsp;Paul&#39;s command for believers to seek for peace with others to the degree possible&nbsp;presumes we will make every effort&nbsp;to avoid potential conflict before it escalates to violence. If we sense a conflict developing around us, we should seek an escape or retreat if reasonably possible. The Bible&#39;s acknowledgment of the right to act in self-defense&nbsp;cannot become license&nbsp;for us to choose a violent response when other, non-violent options were still available.&nbsp;\r\n\r\nFinally, as Jesus advised in Luke 22 a Christian may take prudent measures to mitigate&nbsp;potential risks, including taking self-defense courses, lawfully carrying weapons or even acting preemptively&nbsp;against a threat when required to protect life or property. Any actions we take must be in keeping with the laws of our land since Christians are also required to obey and uphold the law.&nbsp;\r\n\r\nIn the end, the key test for whether we act properly under any circumstances is determined by&nbsp;the motives of our heart. If we act with evil intentions, then we sin; if we act to thwart evil and protect the innocent, then we do not sin.&nbsp;"
    }, {
      "category": "cat1",
      "topics": [],
      "ID": "1709",
      "postedDate": "1446517800",
      "title": "Can a believer be cursed?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q. I&#39;ve been taught that I will be cursed by God if I sow discontent within the church, according to Proverbs 6:19. Is that true?\r\n\r\n\r\nA.&nbsp; The Bible never uses the word &ldquo;curse&rdquo; in describing the consequences for a believer. In the Bible, a curse from the Lord always means death and judgment. It is never correct to say that the Lord curses a believer.&nbsp;\r\n\r\nFurthermore, the Bible does not speak of a curse for those who cause conflict or strife, though these behaviors are likely sin nonetheless. Every believer sins, and the Bible commands all believers to put away sin and seek to live in accordance with the commandments of Christ. A believer who fails to obey God&rsquo;s word may receive a rebuke from the Lord as Hebrews teaches:\r\n\r\nHeb. 12:7&nbsp;It is for discipline that you endure; God deals with you as with sons; for what son is there whom his father does not discipline?&nbsp;\r\nHeb. 12:8&nbsp;But if you are without discipline, of which all have become partakers, then you are illegitimate children and not sons.&nbsp;\r\nHeb. 12:9&nbsp;Furthermore, we had earthly fathers to discipline us, and we respected them; shall we not much rather be subject to the Father of spirits, and live?&nbsp;\r\nHeb. 12:10&nbsp;For they disciplined us for a short time as seemed best to them, but He disciplines us for our good, so that we may share His holiness.&nbsp;\r\nHeb. 12:11&nbsp;All discipline for the moment seems not to be joyful, but sorrowful; yet to those who have been trained by it, afterwards it yields the peaceful fruit of righteousness.&nbsp;\r\nStill, we cannot say that any believer is placed under a curse, for a curse from God always results in damnation. The idea that God may curse people (in the sense of bringing bad luck or terrible experiences in life) comes from&nbsp;pagan religion and false teaching. The Bible says the Lord acts in all ways for the good of the believer:\r\n\r\nRom. 8:28&nbsp; And we know that God causes all things to work together for good to those who love God, to those who are called according to His purpose.&nbsp;"
    }, {
      "category": "cat1",
      "topics": [],
      "ID": "1708",
      "postedDate": "1446516180",
      "title": "Advice on preaching",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q. I would like some basic advice on preaching. How do I get started?\r\n\r\n\r\nA.&nbsp; Our ministry does not provide personal counseling services though we can offer some basic advice on preaching. First, preaching is a process of expositing (or explaining) the word of God. Preaching is not speech-giving nor is it merely entertaining. Preaching is always a matter of teaching and applying the word of God to God&rsquo;s people, as Paul said:\r\n\r\n2Tim. 4:1&nbsp; I solemnly charge you in the presence of God and of Christ Jesus, who is to judge the living and the dead, and by His appearing and His kingdom:&nbsp;\r\n2Tim. 4:2&nbsp;preach the word; be ready in season and out of season; reprove, rebuke, exhort, with great patience and instruction.&nbsp;\r\n2Tim. 4:3&nbsp;For the time will come when they will not endure sound doctrine; but wanting to have their ears tickled, they will accumulate for themselves teachers in accordance to their own desires,&nbsp;\r\n2Tim. 4:4&nbsp;and will turn away their ears from the truth and will turn aside to myths.&nbsp;Notice that Paul&rsquo;s primary concern to Timothy, a young preacher, was that he preach the word of God rather than simply spreading myths and useless stories. Unfortunately, many pastors and preachers today have ignored Paul&rsquo;s advice and continue to preach useless words rather than teaching God&rsquo;s word. Preaching must be centered on expositing the text of scripture or it lacks any validity.\r\n\r\nSecondly, you cannot preach the word if you do not know the word, so every preacher must establish a life-long habit of learning the word of God. You must devote yourself to the study of scripture in an in-depth and diligent manner so that you may be prepared to teach others. There is no short cut to hours of study and preparation.&nbsp;\r\n\r\nFinally, no preacher can expect to impact men and women for the kingdom unless and until they are called and equipped by the Spirit of God for that purpose. So we encourage you to seek the Lord in prayer and with the confirmation of other godly men before assuming you are called to preach the word. If other men agree you are called in this way, then they may be led by the Spirit to lay hands on you and confirm your calling.\r\n\r\nBe careful not to step out in preaching before you have this confirmation, as James warns:\r\n\r\nJames 3:1 &nbsp;Let not many of you become teachers, my brethren, knowing that as such we will incur a stricter judgment.&nbsp;\r\n&nbsp;"
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "Holy+Spirit",
        "topic": "Holy Spirit"
      }, {
        "ID": "antichrist",
        "topic": "antichrist"
      }],
      "ID": "1707",
      "postedDate": "1446515640",
      "title": "Is the Holy Spirit allowing more evil?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q. I know the Bible teaches that the Holy Spirit will be removed in the last days, but is the increasing lawlessness a sign that the Holy Spirit is releasing&nbsp;His grip already?\r\n\r\n\r\nA.&nbsp; The Bible teaches that lawlessness and ungodliness will increase in the last days, but the Bible never suggests that this trend is the result of the Holy Spirit &ldquo;releasing His grip&rdquo; on the world. The Lord is always 100% in control of all that happens in Creation, and the rise of lawlessness is according to His eternal purposes.\r\n\r\nOn the other hand, the Bible does teach that the Holy Spirit is a &ldquo;restrainer&rdquo; but only in a very particular sense:\r\n\r\n2Th. 2:5&nbsp;Do you not remember that while I was still with you, I was telling you these things?&nbsp;\r\n2Th. 2:6&nbsp;And you know what restrains him now, so that in his time he will be revealed.&nbsp;\r\n2Th. 2:7&nbsp;For the mystery of lawlessness is already at work; only he who now restrains will do so until he is taken out of the way.&nbsp;\r\nThe Holy Spirit is restraining the appearance of the antichrist. This is not a restraint on evil itself but only on the revealing of the antichrist. Until the Holy Spirit is removed with the church at the resurrection (i.e., the rapture), the antichrist&rsquo;s identity cannot be known. The Holy Spirit is restraining Satan&rsquo;s ability to bring forth an antichrist to rule the world. Only in the sense is the Holy Spirit a restrainer.&nbsp;\r\n\r\nThe rise of lawlessness is a trend that must happen even as the Holy Spirit is present and working on the earth, and this rise is according to God&rsquo;s purposes in bringing about the end of this age. For a more detailed explanation of these matters, we recommend you listen to our in-depth teaching through the book of Revelation."
    }, {
      "category": "cat1",
      "topics": [

      ],
      "ID": "1706",
      "postedDate": "1446514620",
      "title": "Unbelievers casting out demons?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q. In reading&nbsp;Mark 9:39, it seems as though the Lord teaches that those who cast out demons in his name are to be treated as believers, and yet in Luke 11:18, Mark 3:26, and Matthew 12:26, Jesus says that there will be those who cast our demons in His name but He does not know them. Can you help me understand this difference?\r\n\r\n\r\nA.&nbsp; Regarding each of the passages you cited, here are some general observations. First, Luke 9:49-50 &amp; Mark 9:39 are both speaking of those who are working by means of the Spirit of God though not publicly identified as disciples following Jesus. These men were successfully casting out demons &ldquo;in Jesus name,&rdquo; which means they were operating in the power and authority of the Lord, which had been granted to them by the Spirit.&nbsp;\r\n\r\nThe disciples objected to these men working in this way, because these other men were not a part of the group following Jesus, but Jesus rejects their assumptions. The Lord says God is capable of working through others who were unknown to the disciples, therefore they must not judge others merely by human associations. If a person works in like manner for a shared outcome to the glory of Christ, then we can assume they are working by the same Spirit as us.&nbsp;\r\n\r\nRegarding&nbsp;Luke 11:18, Mark 3:26, and Matthew 12:26, Jesus said that Satan will never work against his own purposes. Jesus spoke&nbsp;these words because the Pharisees had accused Jesus of performing a miracle of casting out a demon using the power of Satan. Jesus explained that it would be illogical to expect Satan to lend his power to anyone for the purpose of increasing the Lord&#39;s glory.&nbsp;\r\n\r\nOn the other hand, Jesus was NOT declaring that Satan never grants a person the power to send out a demon. On the contrary, Satan is the ruler of the demons, and therefore he can send demons into our out of an unbeliever&rsquo;s body at will. Satan may grant the power to one of his agents to cast out demons from another of his agents in order to gain attention and loyalty from an audience for his evil agenda. False teachers and false prophets have long demonstrated supernatural power granted by Satan, including the power to control the demonic realm. The enemy uses this deception to win an audience for his claims.&nbsp;\r\n\r\nBut as Jesus said, the enemy will never use his power to further the glory or goals of the Lord, which was the point Jesus was making to the Pharisees. Therefore, we cannot say that those who cast out demons must be believers, because sometimes unbelievers cast out demons to further the purposes of Satan. We can only say that those who bring glory to Jesus in their work to further the kingdom are not our enemies. &nbsp;\r\n\r\nThis truth explains why in Matthew 7:22 Jesus declares that some will prophesy and cast out demons in Jesus&rsquo; name yet He will say He doesn&rsquo;t know them at the judgment. These are unbelievers who were under the influence of false teaching and were working in the power of Satan to accomplish great miracles, but they didn&rsquo;t have the Spirit and didn&rsquo;t know the true Gospel. Present-day examples of such people include Jehovah&rsquo;s Witnesses, Mormons, and unbelievers trapped in many pentecostal movements around the world.&nbsp;\r\n\r\nFurthermore, there is no example in scripture of the Lord granting an unbeliever spiritual power to perform miracles, but there are many occasions of Satan granting such power to unbelievers (including the antichrist to come). Therefore, we cannot make a determination concerning someone&rsquo;s spiritual status (i.e., believer vs. unbeliever) merely on the basis of whether they can perform supernatural signs. This is why the Bible warns against seeking for such signs.&nbsp;\r\n\r\nFinally, the Bible is clear that the unbeliever&rsquo;s prayers are &ldquo;heard&rdquo; by God in the sense that the Spirit isn&rsquo;t working within such a person to bring their prayers into alignment with the will of God.&nbsp;"
    }, {
      "category": "cat1",
      "topics": [

      ],
      "ID": "1705",
      "postedDate": "1446514200",
      "title": "God saving men through dreams?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q. Why doesn&#39;t the Lord reveal Himself to people through dreams to tell them to believe in Him especially in places like Asia and the Middle East?\r\n\r\n\r\nA.&nbsp; The Bible teaches that though the Lord used a variety of methods to reach the world in the past, today the Lord uses His word to reach the world with the truth of the Gospel:\r\n\r\nHeb. 1:1&nbsp;&nbsp;God, after He spoke long ago to the fathers in the prophets in many portions and in many ways,&nbsp;\r\nHeb. 1:2&nbsp;&nbsp;in these last days has spoken to us in His Son, whom He appointed heir of all things, through whom also He made the world.&nbsp;\r\n&nbsp;Paul echoes this truth in Romans and in 1Corinthians:\r\n\r\nRom. 10:17&nbsp;So faith comes from hearing, and hearing by the word of Christ.&nbsp;1Cor. 1:21&nbsp;For since in the wisdom of God the world through its wisdom did not come to know God, God was well-pleased through the foolishness of the message preached to save those who believe.&nbsp;\r\n1Cor. 1:22&nbsp;For indeed Jews ask for signs and Greeks search for wisdom;&nbsp;\r\n1Cor. 1:23&nbsp;but we preach Christ crucified, to Jews a stumbling block and to Gentiles foolishness,&nbsp;\r\n1Cor. 1:24&nbsp;but to those who are the called, both Jews and Greeks, Christ the power of God and the wisdom of God.&nbsp;1Cor. 2:2&nbsp;For I determined to know nothing among you except Jesus Christ, and Him crucified.&nbsp;\r\n1Cor. 2:3&nbsp;I was with you in weakness and in fear and in much trembling,&nbsp;\r\n1Cor. 2:4&nbsp;and my message and my preaching were not in persuasive words of wisdom, but in demonstration of the Spirit and of power,&nbsp;\r\n1Cor. 2:5&nbsp;so that your faith would not rest on the wisdom of men, but on the power of God.&nbsp;\r\nThe Bible teaches that the Lord used lessor methods to reveal Himself in past times (i.e., prophets, dreams, etc.) as a temporary measure until the arrival of His Son Jesus Christ. Once Christ was revealed and the canon of scripture complete, the Lord relies exclusively on the word of God.&nbsp;\r\nAnd the Lord is fully capable of bringing His word to everyone and anyone as He chooses. The Lord will not leave any of His elect behind, as Jesus said in John 6:\r\n\r\nJohn 6:37&nbsp;&ldquo;All that the Father gives Me will come to Me, and the one who comes to Me I will certainly not cast out.\r\nJohn 6:38&nbsp;&ldquo;For I have come down from heaven, not to do My own will, but the will of Him who sent Me.\r\nJohn 6:39&nbsp;&ldquo;This is the will of Him who sent Me, that of all that He has given Me I lose nothing, but raise it up on the last day.\r\nJohn 6:40&nbsp;&ldquo;For this is the will of My Father, that everyone who beholds the Son and believes in Him will have eternal life, and I Myself will raise him up on the last day.&rdquo;On occasion, we have heard reports that the Spirit is still using dreams or other means to draw men to Him, especially in Asia and the Middle East. These experiences appear to be limited to areas where the word of God is not yet easily available, and so the Spirit must use other methods as a temporary measure. Nevertheless, these experiences are always followed by the introduction of the word of God, so that the person may gain the full counsel of Christ by His word.\r\n\r\nWe advise you to be cautious when dealing with any report of a so-called prophetic dream or revelation. Often these reports are not credible or find their source in demonic activity. Even when the Lord may be using dreams to draw unbelievers to the Gospel, these measures are not a substitute for the word of God."
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "catholicism",
        "topic": "catholicism"
      }, {
        "ID": "catholics",
        "topic": "catholics"
      }, {
        "ID": "Gospel",
        "topic": "Gospel"
      }, {
        "ID": "false+church",
        "topic": "false church"
      }, {
        "ID": "false+gospel",
        "topic": "false gospel"
      }],
      "ID": "1704",
      "postedDate": "1446510240",
      "title": "Are Roman Catholics truly Christian?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q. Can a Roman Catholic be truly Christian given all the false teaching that Catholicism holds?&nbsp;\r\n\r\n\r\nA. &nbsp;First, we must separate the institution from those who congregate within it. While we cannot judge a person&#39;s heart, we can evaluate the teachings and beliefs of a religious system like Catholicism.\r\n\r\nIn evaluating Catholicism, we find&nbsp;the doctrines, beliefs and practices of the Roman Catholic Church to be unbiblical. By&nbsp;far the most important distinction between Catholicism and Christianity is their teaching on salvation. How one gets to Heaven is the most important question a person can ask, but the answers offered by scripture and by the Catholic Church are radically different, and any religion that does not agree with Scripture regarding salvation is, by definition, a false religion.\r\n\r\nScripture is very clear how one receives salvation. The Bible says that salvation is found by faith alone in Christ alone:\r\n\r\nRom. 10:8 But what does it say? &ldquo;THE WORD IS NEAR YOU, IN YOUR MOUTH AND IN YOUR HEART&rdquo; &mdash; that is, the word of faith which we are preaching,\r\nRom. 10:9 that if you confess with your mouth Jesus as Lord, and believe in your heart that God raised Him from the dead, you will be saved;\r\nRom. 10:10 for with the heart a person believes, resulting in righteousness, and with the mouth he confesses, resulting in salvation.&nbsp;\r\n&nbsp;Faith alone in Jesus Christ alone is the means to salvation according to the Bible. Diving deeper, the Bible says that all men are sinners, deserving of God&rsquo;s wrath.&nbsp;Our sin has separated us from God, and our sin must be punished because God is a holy and just God.&nbsp; To avoid that penalty and enter into Heaven, we&nbsp;must be perfectly righteous and&nbsp;without sin and thus reconciled to God.&nbsp;\r\n\r\nThe Gospel according to the Bible teaches that reconciliation with God is found only through faith in the sacrificial death of Jesus Christ on our behalf as a matter of&nbsp;God&rsquo;s grace and mercy, not as a result of our own merit or good works. Those of faith in Jesus place their trust in Jesus&#39; death on the cross for our sins, a death we rightly&nbsp;deserved. In this way, the Father can be just in not overlooking our sin, since He placed our sin on His Son. In addition, Scripture says that when we have faith in Christ, His perfect righteousness is imputed (or credited) to the believer so we may enter into Heaven.&nbsp;\r\n\r\nSo by faith in Jesus our sins have been justly punished (on Christ) and we have been made perfect (by receiving Christ&#39;s righteousness), and these outcomes are the result of Christ&#39;s work on our behalf,&nbsp;not because of anything we did for ourselves.&nbsp;In fact, the only thing we bring to our salvation is our sin, which Christ takes from us. Any&nbsp;supposed \"good\" works we might do count for nothing to God since Jesus has accomplished everything necessary for our salvation.&nbsp;That is why we call this truth&nbsp;the &ldquo;gospel,\"&nbsp;which means &ldquo;good news.&rdquo;\r\n\r\nThe Catholic church does not hold to this&nbsp;gospel. Although the Catholic Church teaches that a person&#39;s salvation begins with faith in Jesus as Messiah, they depart from the Gospel in claiming that faith alone will not secure salvation. Catholics believe they must become perfect&nbsp;before they may enter into Heaven, and they teach the way to perfection is by doing penance for sin and accomplishing righteous works. It&#39;s important to note that Catholicism doesn&#39;t hold that a believer is assigned the perfection earned by&nbsp;Christ (as the Bible teaches); instead Catholics believe that each believer&nbsp;must become perfect in himself by his own works. This teaching is contrary to the Bible and is a false gospel.\r\n\r\nIn summary, Catholics teach that salvation is dependent on personal works of righteousness, which stands in stark contrast to Paul&#39;s words in Ephesians 2:8-9:\r\n\r\nEph. 2:8 For by grace you have been saved through faith; and that not of yourselves, it is the gift of God;\r\nEph. 2:9 not as a result of works, so that no one may boast.&nbsp;\r\n&nbsp;So while we could list many differences between the Catholic Church and biblical Christianity, the&nbsp;most important difference centers on the Gospel itself, and this disagreement over the true Gospel&nbsp;was largely responsible for&nbsp;the rise of the Reformation and the existence of Protestant churches today. In the sixteenth century, the Lord led Martin Luther to shine forth the light of the true gospel again in opposition to the heresy of the Catholic Church by teaching that a person is saved by faith alone in Christ alone. Naturally, Luther&#39;s teaching put him at odds with the Catholic Church and the Reformation followed.\r\n\r\nAt the time of the Reformation, the Catholic church convened a church council to refute the teachings of the Reformers (i.e., Martin Luther, John Calvin, and many others).&nbsp;This council, called the Council of Trent, became the official teaching of the Catholic church&nbsp;and remains their official teaching to this day.&nbsp;\r\n\r\nIt&rsquo;s important to note that the Catholic church teaches that when the pope and the magisterium (the bishops of the church) teach something with respect to faith and morals, such as was taught at the Council of Trent, that teaching is infallible.&nbsp; Since it is &ldquo;infallible&rdquo;, every Catholic must accept this teaching without question.&nbsp; To do otherwise makes one a bad Catholic, meaning that person would be in open rebellion to the church&rsquo;s official, infallible teaching.&nbsp; As far as the Catholic church is concerned, it is just as bad as rejecting the Bible.\r\n\r\nExamples of this teaching from the Council of Trent are shown below.&nbsp; Remember, each one of these statements is considered infallible and, therefore, equal with Scripture for Catholics, as the Catholic church believes the Holy Spirit leads the pope to proclaim such infallible statements:\r\n\r\nCANON XI.-If any one saith, that men are justified, either by the sole imputation of the justice of Christ, or by the sole remission of sins, to the exclusion of the grace and the charity which is poured forth in their hearts by the Holy Ghost, and is inherent in them; or even that the grace, whereby we are justified, is only the favour of God; let him be anathema.CANON XII.-If any one saith, that justifying faith is nothing else but confidence in the divine mercy which remits sins for Christ&#39;s sake; or, that this confidence alone is that whereby we are justified; let him be anathema.CANON XX.-If any one saith, that the man who is justified and how perfect soever, is not bound to observe the commandments of God and of the Church, but only to believe; as if indeed the Gospel were a bare and absolute promise of eternal life, without the condition of observing the commandments ; let him be anathema.CANON XXIV.-If any one saith, that the justice received is not preserved and also increased before God through good works; but that the said works are merely the fruits and signs of Justification obtained, but not a cause of the increase thereof; let him be anathema.CANON XXVI.-If any one saith, that the just ought not, for their good works done in God, to expect and hope for an eternal recompense from God, through His mercy and the merit of Jesus Christ, if so be that they persevere to the end in well doing and in keeping the divine commandments; let him be anathema.CANON XXX.-If any one saith, that, after the grace of Justification has been received, to every penitent sinner the guilt is remitted, and the debt of eternal punishment is blotted out in such wise, that there remains not any debt of temporal punishment to be discharged either in this world, or in the next in Purgatory, before the entrance to the kingdom of heaven can be opened (to him); let him be anathema.CANON XXXII.-If any one saith, that the good works of one that is justified are in such manner the gifts of God, as that they are not also the good merits of him that is justified; or, that the said justified, by the good works which he performs through the grace of God and the merit of Jesus Christ, whose living member he is, does not truly merit increase of grace, eternal life, and the attainment of that eternal life,-if so be, however, that he depart in grace,-and also an increase of glory; let him be anathema.\r\n&nbsp;These statements all state that anyone who says salvation is by faith alone is categorically wrong and must be excluded from the Church. For the Catholic, salvation is about works, not faith alone.\r\n\r\nClearly, these beliefs contradict Scripture in many places, including Romans 5:19, &ldquo;19 For as through the one man&rsquo;s disobedience the many were made sinners, even so through the obedience of the One the many will be made righteous.&rdquo;&nbsp;\r\n\r\nRomans 5 provides a contrast between Adam and Jesus.&nbsp; In Adam, we are all made sinners because of his sin.&nbsp; In Christ, believers are made righteous by Christ&rsquo;s obedience.&nbsp; Notice that it is not by our works that we are considered righteous, as the Catholic church falsely teaches.&nbsp; Rather, it is solely by Christ&rsquo;s obedience that we are made righteous.\r\n\r\nPreaching a different gospel is the most serious error of the Catholic religion (and there are many others), but this difference alone makes the Catholic Church a false religion, as scripture says in Galatians 1:\r\n\r\n&ldquo;8 But even if we, or an angel from heaven, should preach to you a gospel contrary to what we have preached to you, he is to be accursed!&nbsp; 9 As we have said before, so I say again&nbsp;now,&nbsp;if any man is preaching to you a gospel contrary to what you received, he is to be accursed!&rdquo;&nbsp;\r\nEven though Catholics acknowledge&nbsp;Jesus to a certain extent (then again, even the Muslims acknowledge&nbsp;Jesus), nevertheless the Catholic church preaches&nbsp;a contrary gospel.&nbsp; Therefore according to Paul, the Catholic Church is not a Christian church; it is&nbsp;a false church.\r\n\r\nSo can we expect believers to be found in the Catholic Church?&nbsp;\r\n\r\nSince the Catholic Church presents a false gospel that cannot bring men and women into Heaven and rescue them from Hell, why would a true believer choose to remain in a church that teaches a false gospel?&nbsp; This would be no different than a believer attending a Mormon church, a Jehovah Witness church, or any other false church.&nbsp;Why would a believer stay in a church that teaches and believes that which is contrary to the very word of God?\r\n\r\nNevertheless, some believers (very few in our experience) do choose to remain in the Catholic Church. Some remain because they do not realize the differences between the true Gospel and the teaching of the Catholic Church. Others remain because family ties and tradition overrule sound judgment. Still others remain as a mission to reach other Catholics with the truth. Therefore, we cannot say that there are no believers in the Catholic Church, but where believers can be found in that religion, it is only because God&#39;s grace has overcome the false teaching in that system.&nbsp;\r\n\r\nStill, choosing to remain in the Catholic system of religion after coming to a saving faith in Jesus Christ may have a negative effect on a person&#39;s spiritual development. &nbsp;False teaching impacts a believer&rsquo;s spiritual maturity and relationships with family and friends.&nbsp;Jesus understood this, too, when He warned in Luke 12:\r\n\r\n&ldquo;51 Do you suppose that I came to grant peace on earth?&nbsp; I tell you, no, but rather division; 52 for from now on five members in one household will be divided, three against two and two against three.&nbsp; 53 They will be divided, father against son and son against father, mother against daughter and daughter against mother, mother-in-law against daughter-in-law and a daughter-in-law against mother-in-law.&rdquo;&nbsp;\r\nChrist must come first, even above our family and friends.&nbsp; In Luke 14, Jesus says, &ldquo;26 If anyone comes to Me, and does not hate his own father and mother and wife and children and brothers and sisters, yes, and even his own life, he cannot be My disciple.&rdquo;&nbsp; This does not mean we should hate our family; rather, it means we must love Him more than even our family.&nbsp; Therefore, Christians must share the &nbsp;true gospel with Catholics, as this is a truly loving action."
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "ephesians",
        "topic": "ephesians"
      }, {
        "ID": "Faith",
        "topic": "Faith"
      }],
      "ID": "1703",
      "postedDate": "1446509820",
      "title": "The Whole Armor of God",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q. Can you explain Paul&#39;s teaching in Ephesians 6:13-17 on the \"whole armor of God?\"\r\n&nbsp;\r\n\r\nA. This is a great passage of Scripture, one we need to understand and follow.&nbsp; First and foremost, we need to put the passage into context, so let&rsquo;s look at the verses prior to this passage.\r\n\r\nAt the beginning of chapter 6 of Ephesians, Paul instructs us regarding certain relationships (children and parents, fathers and children, slaves and masters, masters and slaves).&nbsp; He then moves in verse 10 to exhorting us to be strong in the Lord, and we do this by putting on the full armor of God:\r\n\r\n&ldquo;10 Finally, be strong in the Lord and in the strength of His might.&nbsp; 11 Put on the full armor of God, so that you will be able to stand firm against the schemes of the devil.&nbsp; 12 For our struggle is not against flesh and blood, but against the rulers, against the powers, against the world forces of this darkness, against the spiritual forces of wickedness in the heavenly places.&nbsp; 13 Therefore, take up the full armor of God, so that you will be able to resist in the evil day, and having done everything, to stand firm.&nbsp; 14 Stand firm therefore, having girded your loins with truth, and having put on the breastplate of righteousness, 15 and having shod your feet with the preparation of the gospel of peace; 16 in addition to all, taking up the shield of faith with which you will be able to extinguish all the flaming arrows of the evil one.&nbsp; 17 And take the helmet of salvation, and the sword of the Spirit, which is the word of God.&rdquo;\r\n&nbsp;The context of this passage is that we need to be strong in the Lord to withstand the schemes of the devil.&nbsp; Notice that we cannot do this in our own strength; rather, we must do this in the Lord&rsquo;s strength.&nbsp; The picture is one of a soldier going into battle, and arming himself with everything available to stand firm against the enemy.&nbsp; The word&nbsp;schemes&nbsp;means &ldquo;cunning arts, deceit, trickery&rdquo;.&nbsp; That is how the devil attacks Christians so that we do not stand firm in the faith.&nbsp; This is why v. 12 says our struggle is not against humans (&ldquo;flesh and blood&rdquo;) but &ldquo;against spiritual forces of wickedness in the heavenly places&rdquo;, which means against the devil and his demonic angels.\r\n\r\nJames 4:7-8 says, &ldquo;Submit therefore to God.&nbsp; Resist the devil and he will flee from you.&nbsp;&nbsp;Draw near to God and He will draw near to you.&rdquo;&nbsp; So, we are commanded to obey God and resist the devil.&nbsp; God does not leave us without defense, but provides us with a full body armor, one that is specially designed to resist the devil that we may stand against his attacks.&nbsp; This armor consists of girding our loins with truth, putting on the breastplate of righteousness, covering our feet with the preparation of the gospel of peace, taking up the shield of faith, the helmet of salvation, and the sword of the Spirit.&nbsp; Let&rsquo;s consider each piece of armor.\r\n\r\nFirst, Paul tells us to &ldquo;gird our loins with truth&rdquo;.&nbsp; In Biblical times, most people, including men, wore loose-fitting garments that basically consisted of three holes:&nbsp; one for your head and one for each arm, much like a Roman toga.&nbsp; Such clothing was not conducive to running or fighting, as the looseness of the clothing could easily entangle a person in such instances.&nbsp; To remedy this, soldiers would bring up the bottom of the garment between their legs and around their torso (by their &ldquo;loins&rdquo;) and fasten it (gird) with a belt.&nbsp; The picture here is of a soldier dressed for battle.&nbsp; Likewise, when God told the Jews to leave Egypt, He told them to &ldquo;gird up their loins&rdquo;, which meant for them to be ready to move.&nbsp; So, it&rsquo;s also an expectation to be ready, be prepared for battle.\r\n\r\nIn our case, we are &ldquo;dressed for battle&rdquo; when we fasten ourselves in the truth of God&rsquo;s word.&nbsp; It has been well said that to spot counterfeit currencies, people are trained to know what the authentic currency looks like.&nbsp; Similarly, we can stand firm against Satan&rsquo;s deceit and lies when we know God&rsquo;s truth.&nbsp; This is the point of Ephesians 4:&nbsp;\r\n\r\n&ldquo;13 until we all attain to the unity of the faith, and of the knowledge of the Son of God, to a mature man, to the measure of the stature which belongs to the fullness of Christ. 14 As a result, we are no longer to be children, tossed here and there by waves and carried about by every wind of doctrine, by the trickery of men, by craftiness in deceitful scheming.&rdquo;&nbsp;\r\nNot only are we to know the truth, we are also to walk in the truth.&nbsp; Knowing God&rsquo;s word will keep us from being led astray by the devil and by sinful men who are under his influence (1 John 5:19).\r\n\r\nNext, we are to put on the &ldquo;breastplate of righteousness&rdquo;.&nbsp; A breastplate typically covered the soldier from the neck down to the navel.&nbsp; So, clearly, a breastplate protected a soldier&rsquo;s vital organs, his heart, liver, kidneys, etc.&nbsp; Getting shot with an arrow or hit with a sword in this area would likely be fatal.\r\n\r\nThe Jews viewed the heart symbolically as the mind.&nbsp; Proverbs 23:7 says, &ldquo;For as he thinks in his heart, so he is.&rdquo;&nbsp; In Matthew 15 Jesus said, &ldquo;11 It is not what enters into the mouth that defiles the man, but what proceeds out of the mouth, this defiles the man&hellip;18 But the things that proceed out of the mouth come from the heart, and those defile the man.&nbsp; 19 For out of the heart come evil thoughts, murders, adulteries, fornications, thefts, false witness, slanders.&nbsp; 20 These are the things which defile the man; but to eat with unwashed hands does not defile the man.&rdquo;&nbsp;\r\n\r\nSo, what and how we think determines what we say and do.&nbsp; Thus, the heart, our minds, must be protected.&nbsp; Furthermore, the Jews associated the bowels\/stomach with feelings and emotions.&nbsp; Indeed, we feel things in our stomach, in our gut.&nbsp; So, we need to also protect our emotions and feelings.\r\n\r\nSatan will attack the believer in his thinking and his emotions.&nbsp; He wants to get a Christian to change his thinking by his deceit and trickery, or appeal to a believer&rsquo;s emotions so as to go against God&rsquo;s word.&nbsp; He does this primarily by trying to get us to doubt God, which for us is given in the Bible.&nbsp; So, his attack is against the word of God.&nbsp; He wants to cause believers to doubt the veracity of Scripture.&nbsp;\r\n\r\nHe does this in numerous ways, including the lie of evolution, trying to say that science disproves the Bible, or sending false teachers into the church to teach false doctrine.&nbsp; Satan has done this from the beginning, when he told Eve &ldquo;has God said?&rdquo; (Genesis 3:1)&nbsp; He wants us to doubt the Lord, rather than trust in the Lord with all of our heart as the Bible commands (Proverbs 3:5).\r\n\r\nSo, we must protect ourselves with the breastplate of righteousness.&nbsp; The word righteousness means that we are in a right relationship with God, which comes by faith in Jesus, as His righteousness is credited to us by faith.&nbsp; This means we are now able to have right thinking, right feelings and emotions.&nbsp; We now have the mind of Christ (1 Corinthians 2:16).&nbsp; As such, by the power of the Holy Spirit who dwells in us, we can now even live righteously.&nbsp;\r\n\r\nThus, knowing God&rsquo;s truth, protecting our minds and emotions, and living righteously by the power of the Spirit is how we put on the breastplate of righteousness.&nbsp; As John says, &ldquo;7 Little children, make sure no one deceives you; the one who practices righteousness is righteous, just as He is righteous; 8 the one who practices sin is of the devil; for the devil has sinned from the beginning. The Son of God appeared for this purpose, to destroy the works of the devil.&rdquo; (1 John 3)&nbsp; If we are righteous (by faith), then we will live righteously.\r\n\r\nNext, Paul says to &ldquo;shod your feet with the preparation of the gospel of peace.&rdquo;&nbsp; Keep in mind that all of the armor of God is meant to make us able to stand firm against the schemes of the devil (v. 11).&nbsp; So, here, putting the gospel on our feet is akin to the shoes a soldier wore to allow them to keep from slipping in battle.&nbsp; The material was a heavy bottomed sole with hobnails on the bottom, much like a modern day cleat.&nbsp; This allowed the soldier to keep his traction in battle, to stand firm.\r\n\r\nThe same is true for Christians in that we are to stand firm in the gospel of peace.&nbsp; This means that we know that we are no longer under the wrath of God.&nbsp; Because of what Christ has done for us, we are now at peace with God.&nbsp; We can stand against the schemes of the devil knowing that God is on our side, that we are no longer His enemies (Romans 5).&nbsp; This is very similar to what Paul tells the Corinthians, &ldquo;Be on the alert, stand firm in the faith, act like men, be strong.&rdquo; (1 Corinthians 16:13)&nbsp; Now that we are believers, we have the power and resources of the Holy Spirit, who lives and dwells in us.&nbsp;\r\n\r\nThis is how we stand firm in the faith against the schemes of the devil, knowing we have peace with God, and this &ldquo;gospel of peace&rdquo; is symbolically shown to be shoes here that allow us to stand firm in the battle.\r\n\r\nThe next piece of God&rsquo;s armor is the &ldquo;shield of faith&rdquo;.&nbsp; This type of shield was not the one you might see a soldier holding on one arm while fighting with a sword with the other hand.&nbsp; Rather, this shield was a large, four-cornered shield.&nbsp; It was covered with either metal or thick leather, and it was designed as a protection against flaming arrows shot by the enemy.\r\n\r\nLikewise, the shield of faith protects us from Satan&rsquo;s flaming arrows.&nbsp; Notice that the shield of faith will allow us to extinguish ALL of Satan&rsquo;s flaming arrows.&nbsp; So, no matter what Satan shoots at us, the shield of faith will allow us to render them harmless.&nbsp; Now, these flaming arrows are what Satan uses to tempt us.&nbsp; They include things that appeal to the lust of the eyes, the lust of the flesh, and the pride of life.&nbsp; This is how Satan always tempts us.&nbsp; He tempted Adam and Eve this way with the fruit in the Garden of Eden.&nbsp; He tempted our Lord Jesus this way.&nbsp; The temptations are always designed to lead us away from God, to be disobedient to Him.&nbsp; Our defense against these temptations is the shield of faith.\r\n\r\nSo, what does faith mean?&nbsp; It means we believe what God has told us.&nbsp; We believe it when He says that if we believe in His Son we will have eternal life.&nbsp; We trust Him.&nbsp; So, when the devil comes along with a temptation that questions what God has told us in His word, by faith we believe what God has said and do not believe the temptation of the devil.&nbsp; Adam and Eve believed Satan&rsquo;s lie and consequently fell into sin (Genesis 3).&nbsp; Jesus believed everything God has said (Matthew 4, Luke 4), and so did not fall into Satan&rsquo;s temptations.&nbsp;\r\n\r\nThus the shield of faith, believing God and His word, protects us from Satan&rsquo;s flaming arrows of temptations.&nbsp; As Proverbs 30:5-6 says, &ldquo;Every word of God is tested; He is a shield to those who take refuge in Him.&nbsp; Do not add to His words Or He will reprove you, and you will be proved a liar.&rdquo;&nbsp; Similarly, Psalm 18:30 says, &ldquo;As for God, His way is blameless; The word of the Lord is tried; He is a shield to all who take refuge in Him.&rdquo;\r\n\r\nOur next piece of armor is the helmet of salvation.&nbsp; The Roman soldier wore a helmet to protect against the enemy&rsquo;s attacks to the head, typically with a broadsword.&nbsp; This was a very large sword, 3-4 feet in length, and was designed to inflict major damage with a single blow.&nbsp; If you could hit your opponent on the head and drive the sword into the skull, you&rsquo;d probably defeat your enemy with one blow.&nbsp; So to protect against that, soldiers wore helmets.\r\n\r\nThe helmet of salvation also protects us from Satan&rsquo;s attacks.&nbsp; It&rsquo;s important to know that there are really three aspects to our salvation.&nbsp; First, we have been saved; the Bible calls this our justification, and we are justified (made right with God) through faith in Jesus.&nbsp; Through justification, we are removed from the penalty of sin, since Jesus took our punishment on the cross.\r\n\r\nSecond, we are being saved; that is what the Bible calls sanctification.&nbsp; By the power of the Holy Spirit living and dwelling in us and by the study of His word, we can become more and more like Christ over the course of our lifetime.&nbsp; In this sense, we have the ability to escape the power of sin.&nbsp; By God&rsquo;s power, we can now choose to not sin, although we still sometimes do.\r\n\r\nThird, we will be saved.&nbsp; That is, God will complete our salvation ultimately when we get to heaven, when we will be glorified and will be like Him (Romans 8:30; 1 John 3:2).&nbsp; This aspect of our salvation is the hope of our salvation.&nbsp; Here, hope is not a verb, but a noun.&nbsp; Hope is not something we worry about, it is something we glory in, knowing we have been saved and have salvation to which we can look forward.&nbsp; When we are in heaven, we will be free from the presence of sin, for in heaven there is no more death, and since the wages of sin is death, there can therefore be no more sin.&nbsp; This is our hope.\r\n\r\nIt is this aspect of salvation that Paul describes as our helmet.&nbsp; 1 Thessalonians 5 says, &ldquo;8 But since we are of the day, let us be sober, having put on the breastplate of faith and love, and as a helmet, the hope of salvation.&rdquo;&nbsp; Having such a hope, we do not grow weary of Satan&rsquo;s attacks but persevere in doing good.&nbsp; We do not get discouraged by a lack of seeing the fruit of our efforts.&nbsp;\r\n\r\nConsider that God commissioned Jeremiah to preach to Israel, but then told him that they would not listen to him nor would they answer him (Jeremiah 7:27).&nbsp; Yet, Jeremiah was obedient, knowing he had the hope of his salvation to which he could look forward.&nbsp; So, although Satan and his demons will attack our mind, causing us to doubt and to be discouraged, we persevere, knowing our salvation awaits us, which is the helmet of salvation.&nbsp; In that sense, we protect our mind, our thinking.\r\n\r\nOur final piece of armor is the &ldquo;sword of the Spirit, which is the word of God.&rdquo;&nbsp; Note that this is the first weapon that is not solely defensive, as are the other weapons.&nbsp; The sword can be both defensive and offensive.&nbsp; We are talking here about the Bible, God&rsquo;s word.&nbsp; If this is one of our weapons, then it logically follows that in order for us to be able to use this weapon, we must understand God&rsquo;s word.&nbsp; This is one reason Bible study is so crucial in the life of all believers.\r\n\r\nAn interesting aside is that the Greek word for sword here is&nbsp;m&aacute;chaira, which is a small sword, as opposed to a much longer broadsword.&nbsp; This sword would be anywhere from 6 to 18 inches, and was used for close combat fighting.&nbsp; The picture here is one that is personal.\r\n\r\nWe use the word of God because it is true, it is inerrant, it is infallible.&nbsp; Hebrews 4 tells us it is &ldquo;living and active and sharper than any two-edged sword, and piercing as far as the division of soul and spirit, of both joints and marrow, and able to judge the thoughts and intentions of the heart.&rdquo;&nbsp; It is powerful &ndash; it is the power of God unto salvation (Romans 1:16).&nbsp; By the word we are sanctified (John 17:17).&nbsp; The word of God is a powerful weapon indeed.\r\n\r\nPerhaps the best example of using the sword defensively is given to us by our Lord Jesus when He was tempted by Satan in the wilderness (Matthew 4, Luke 4).&nbsp; Jesus answers each of Satan&rsquo;s temptations with Scripture.&nbsp; He is thus defending Himself against temptation with the word of God.&nbsp; Likewise, we can protect ourselves from Satan&rsquo;s temptations by knowing God&rsquo;s word, just as our Lord did.\r\n\r\nThe sword of the Spirit can also be used offensively.&nbsp; When we preach the gospel, we are attacking the dominion of Satan by bringing people out of the darkness and into His marvelous light (all by the power of the Holy Spirit).&nbsp; We can attack the elementary principles of this world when we preach the truth in love, which is typically against the views of the world (e.g., marriage, sex, drunkenness, lying, stealing, etc.)&nbsp; We use it offensively so we can &ldquo;sanctify Christ as Lord in your hearts, always being ready to make a defense to everyone who asks you to give an account for the hope that is in you, yet with gentleness and reverence. (1 Peter 3:15)&rdquo;\r\n\r\nLastly, as one prominent teacher pointed out, the armor is a picture of Jesus Christ our God and Savior.&nbsp; He is the truth (the belt).&nbsp; He gives us faith (the shield).&nbsp; He is our righteousness (the breastplate).&nbsp; He is our peace (the shoes).&nbsp; He is our salvation (the helmet).&nbsp; And He is the Word (the sword of the Spirit).&nbsp; To God be the glory!"
    }, {
      "category": "cat1",
      "topics": [

      ],
      "ID": "1686",
      "postedDate": "1443491400",
      "title": "Satan&#8217;s creation and fall?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Can you explain Satan&#39;s origins and his fall? Was he created before the Garden?\r\n\r\n\r\nThe history of angels (and demons) is sparsely covered in scripture, probably because they are secondary to the purposes of God in authoring scripture. Nevertheless, we do get some details in the Bible.&nbsp;\r\n\r\nFirst, we know that the Lord created the angels prior to the Creation, according to Job 38:4-7:\r\n\r\nJob 38:4&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;Where were you when I laid the foundation of the earth?&nbsp;\r\n&nbsp;&nbsp; &nbsp;Tell Me, if you have understanding,&nbsp;\r\nJob 38:5&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Who set its measurements? Since you know.&nbsp;\r\n&nbsp;&nbsp; &nbsp;Or who stretched the line on it?&nbsp;\r\nJob 38:6&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;On what were its bases sunk?&nbsp;\r\n&nbsp;&nbsp; &nbsp;Or who laid its cornerstone,&nbsp;\r\nJob 38:7&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;When the morning stars sang together&nbsp;\r\n&nbsp;&nbsp; &nbsp;And all the sons of God shouted for joy?&nbsp;The sons of God in v.7 refers to angels, just as it does earlier in the book of Job and in Genesis 6. The role of angels in Heaven prior to the Creation seems to be to praise the Lord singing before His throne. After the creation of man, angels fulfill their primary purpose, which is to minister to the saints:\r\n\r\nHeb. 1:13&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;But to which of the angels has He ever said,&nbsp;\r\n&nbsp;&nbsp; &nbsp;&ldquo;SIT AT MY RIGHT HAND,&nbsp;\r\n&nbsp;&nbsp; &nbsp;UNTIL I MAKE YOUR ENEMIES&nbsp;\r\n&nbsp;&nbsp; &nbsp;A FOOTSTOOL FOR YOUR FEET&rdquo;?&nbsp;\r\nHeb. 1:14&nbsp;Are they not all ministering spirits, sent out to render service for the sake of those who will inherit salvation?&nbsp;Regarding the fall of Satan and the Creation, there is no exact timeline in scripture, though in Ezekiel 28 we learn the full story of how Satan fell prior to the Creation while he lived in Heaven:\r\n\r\nEzek. 28:12&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;Son of man, take up a lamentation over the king of Tyre and say to him, &lsquo;Thus says the Lord GOD,&nbsp;\r\n&nbsp;&nbsp; &nbsp;&ldquo;You had the seal of perfection,&nbsp;\r\n&nbsp;&nbsp; &nbsp;Full of wisdom and perfect in beauty.&nbsp;\r\nEzek. 28:13&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;You were in Eden, the garden of God;&nbsp;\r\n&nbsp;&nbsp; &nbsp;Every precious stone was your covering:&nbsp;\r\n&nbsp;&nbsp; &nbsp;The ruby, the topaz and the diamond;&nbsp;\r\n&nbsp;&nbsp; &nbsp;The beryl, the onyx and the jasper;&nbsp;\r\n&nbsp;&nbsp; &nbsp;The lapis lazuli, the turquoise and the emerald;&nbsp;\r\n&nbsp;&nbsp; &nbsp;And the gold, the workmanship of your settings and sockets,&nbsp;\r\n&nbsp;&nbsp; &nbsp;Was in you.&nbsp;\r\n&nbsp;&nbsp; &nbsp;On the day that you were created&nbsp;\r\n&nbsp;&nbsp; &nbsp;They were prepared.&nbsp;\r\nEzek. 28:14&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;You were the anointed cherub who covers,&nbsp;\r\n&nbsp;&nbsp; &nbsp;And I placed you there.&nbsp;\r\n&nbsp;&nbsp; &nbsp;You were on the holy mountain of God;&nbsp;\r\n&nbsp;&nbsp; &nbsp;You walked in the midst of the stones of fire.&nbsp;\r\nEzek. 28:15&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;You were blameless in your ways&nbsp;\r\n&nbsp;&nbsp; &nbsp;From the day you were created&nbsp;\r\n&nbsp;&nbsp; &nbsp;Until unrighteousness was found in you.&nbsp;\r\nEzek. 28:16&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;By the abundance of your trade&nbsp;\r\n&nbsp;&nbsp; &nbsp;You were internally filled with violence,&nbsp;\r\n&nbsp;&nbsp; &nbsp;And you sinned;&nbsp;\r\n&nbsp;&nbsp; &nbsp;Therefore I have cast you as profane&nbsp;\r\n&nbsp;&nbsp; &nbsp;From the mountain of God.&nbsp;\r\n&nbsp;&nbsp; &nbsp;And I have destroyed you, O covering cherub,&nbsp;\r\n&nbsp;&nbsp; &nbsp;From the midst of the stones of fire.&nbsp;\r\nEzek. 28:17&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;Your heart was lifted up because of your beauty;&nbsp;\r\n&nbsp;&nbsp; &nbsp;You corrupted your wisdom by reason of your splendor.&nbsp;\r\n&nbsp;&nbsp; &nbsp;I cast you to the ground;&nbsp;\r\n&nbsp;&nbsp; &nbsp;I put you before kings,&nbsp;\r\n&nbsp;&nbsp; &nbsp;That they may see you.&nbsp;\r\nEzek. 28:18&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;By the multitude of your iniquities,&nbsp;\r\n&nbsp;&nbsp; &nbsp;In the unrighteousness of your trade&nbsp;\r\n&nbsp;&nbsp; &nbsp;You profaned your sanctuaries.&nbsp;\r\n&nbsp;&nbsp; &nbsp;Therefore I have brought fire from the midst of you;&nbsp;\r\n&nbsp;&nbsp; &nbsp;It has consumed you,&nbsp;\r\n&nbsp;&nbsp; &nbsp;And I have turned you to ashes on the earth&nbsp;\r\n&nbsp;&nbsp; &nbsp;In the eyes of all who see you.&nbsp;\r\nEzek. 28:19&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&ldquo;All who know you among the peoples&nbsp;\r\n&nbsp;&nbsp; &nbsp;Are appalled at you;&nbsp;\r\n&nbsp;&nbsp; &nbsp;You have become terrified&nbsp;\r\n&nbsp;&nbsp; &nbsp;And you will cease to be forever.&rdquo;&rsquo;&rdquo;&nbsp;First, the writer says Satan was an angel created by God and perfectly made.&nbsp;Notice in v.12, we hear that&nbsp;Satan had the seal of perfection.&nbsp;He was full of wisdom and beauty.&nbsp;In v.15, he was blameless, at least for a time, and he was splendidly adorned in jewels Ezekiel says.\r\n\r\nSecondly, notice where Satan lived and how he served God, and in v.13 he was in the garden of Eden.&nbsp;Naturally, we assume this refers to the garden than Adam and&nbsp;Woman occupied, and&nbsp;of course, Satan was in the earthly garden in Genesis 3.But if we look more closely at this passage, we see clues that&nbsp;suggest this garden isn&rsquo;t the same one as&nbsp;that in Genesis 3.&nbsp;\r\n\r\nFor example, Satan was on the holy mountain of God.&nbsp;The holy mountain of God is Mt. Zion, which&nbsp;is the name for the Heaven Jerusalem that exists in the&nbsp;Heavenly realm.&nbsp;The writer of Hebrews mentions this later in his letter in chapter&nbsp;12, and&nbsp;in Revelation 21, we hear that this heavenly Zion will&nbsp;descend from Heaven to become our new&nbsp;dwelling place for&nbsp;eternity. So it would seem that there is a heavenly garden called Eden,&nbsp;which the earthly Eden represented.\r\n\r\nFurthermore, notice that Satan served God as the covering cherub.&nbsp;The covering cherub refers to those angels whose wings covered the&nbsp;mercy seat on top of the ark of the covenant. The tabernacle given to Moses and Israel is&nbsp;a pattern of the one in Heaven,&nbsp;\r\n\r\nSo now we know that the golden covering cherubs made for the&nbsp;earthly tabernacle are pictures of real cherubs&nbsp;who cover the&nbsp;glory of God in the Heavenly tabernacle, and the&nbsp;first and most glorious of those cherubs originally was&nbsp;none other than Satan himself. &nbsp;Then notice in v.18 Ezekiel says that Satan profaned his sanctuaries. The word in Hebrew for sanctuary literally means holy places.&nbsp;Satan profaned the holy places.\r\n\r\nThere are two holy places in the tabernacle, the holy place and the holy of holies. Both of these places in the Heavenly tabernacle were defiled by&nbsp;Satan Ezekiel says.&nbsp;How did Satan come to defile the Heavenly tabernacle?&nbsp;\r\n\r\nFirst, God says Satan was&nbsp;filled with violence because of pride.&nbsp;Specifically, Satan took note of the abundance of his trade.&nbsp;Trade is a term in Hebrew meaning merchandise, and in this context it refers to Satan&rsquo;s trade as the covering cherub.&nbsp;He was the angel closest to the glory of God.&nbsp;He was assigned to cover it, to husband it, and because he was so close to God&rsquo;s glory, he was&nbsp;filled with&nbsp;violence.&nbsp;\r\n\r\nWhat was supposed to be an honor to Satan became a cause for him to&nbsp;rebel against God, and he so loved seeing his privileged position next to the glory of&nbsp;God that he began to think he was equal to&nbsp;God. This is the essence of pride: loving what God has done in&nbsp;creating us so much that we stop thanking Him and&nbsp;begin thanking&nbsp;ourselves.\r\n\r\nSecondly, Satan was corrupted by his own perfection.&nbsp;Satan started thinking he was inherently great and beautiful &ndash;&nbsp;even more so than God Himself.&nbsp;Notice in v.17 Ezekiel says Satan&rsquo;s heart was corrupted by his&nbsp;splendor. What&nbsp;action did Satan take to pollute the Heavenly tabernacle? The answer to this question is a little less clear, but first&nbsp;remember Satan&rsquo;s position as the covering cherub.&nbsp;His station was in the holiest place in the tabernacle.&nbsp;\r\n\r\nWe know the tabernacle on earth is based on a pattern of the&nbsp;tabernacle in Heaven, and we also see that other aspects of Creation are patterned&nbsp;after things in Heaven.&nbsp;The temple mount is a representation of Mt. Zion in Heaven, and&nbsp;the garden of Eden on earth appears to be a representation&nbsp;of the Garden of God in Heaven.\r\n\r\nTherefore, to understand how Satan may have profaned the tabernacle&nbsp;in Heaven, we should ask does Satan ever&nbsp;profane the earthly tabernacle?&nbsp;The answer is most definitely, he does so on numerous occasions, but most notably in the&nbsp;Abomination of Desolation described in&nbsp;Daniel and by Jesus in&nbsp;Matthew 24.&nbsp;This is a moment when Satan sets a man in the Holy of Holies&nbsp;and declares himself to be God.&nbsp;Satan also accomplished&nbsp;something&nbsp;similar with Antiochus Epiphanies&nbsp;shortly before Christ&rsquo;s birth, and&nbsp;he will repeat it again with the Antichrist in&nbsp;Tribulation.\r\n\r\nSo by comparison, Satan was a covering cherub who became so convinced&nbsp;by his importance and beauty&nbsp;that he could be God, and&nbsp;so in a rebellious moment of violence and pride, Satan seized the&nbsp;mercy seat in the Heavenly tabernacle&nbsp;declaring Himself to be God. In doing so, he profaned the Heavenly tabernacle.&nbsp;We see the result of that act of rebellion in Ezekiel 28.\r\n\r\nIn v.16 the Lord says He cast Satan down from the mountain of God (in&nbsp;Heaven), and&nbsp;In v.17 we hear that Satan was cast to the ground,&nbsp;The Hebrew word for ground is the word for earth, and&nbsp;again in v.18 the Lord declares that Satan was cast down to&nbsp;the earth.&nbsp;We know that Satan fell into sin prior to the events of Genesis 3, where&nbsp;he met with woman and seduced her&nbsp;to sin.&nbsp;So it seems that Satan was roaming the earthly garden of Eden&nbsp;because he had been cast out of the&nbsp;Heavenly garden of God.&nbsp;\r\n\r\nJesus described seeing this moment in the Gospels:\r\n\r\nLuke 10:18 &nbsp;And He said to them, &ldquo;I was watching Satan fall from heaven like lightning.This is largely the extent of what we know concerning the timeline of Satan&rsquo;s fall.\r\n&nbsp;"
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "leadership",
        "topic": "leadership"
      }, {
        "ID": "growth",
        "topic": "growth"
      }, {
        "ID": "vision",
        "topic": "vision"
      }],
      "ID": "1685",
      "postedDate": "1443490380",
      "title": "What is &#8220;casting a vision?&#8221;",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "I&#39;ve heard my pastor say we need to \"cast a vision,\" but I don&#39;t know what that means? Is it biblical for pastors to be preoccupied with arriving at a vision for the growth of a church rather than simply accomplishing the work of evangelizing, discipling, equipping?\r\n\r\n\r\nA strategic vision (or a plan for the future) is not by itself a bad thing in any walk of life, including in serving God. God is not opposed to plans, as we see with Joseph who planned thoroughly to survive a period of famine in Egypt. Setting goals and objective in ministry can be immensely helpful to accomplish difficult and challenging tasks even as we rely on the Spirit and seek the Lord&rsquo;s counsel.&nbsp;\r\n\r\nThe question is where do we go to find our vision and goals in ministry? In Joseph&rsquo;s case, the Lord set the vision when He told Joseph through a dream given to Pharaoh what to expect and how to respond. Then Joseph simply put God&rsquo;s vision into action through careful planning and execution, as scripture records.\r\n\r\nLikewise, men must seek the wisdom and counsel of the Lord in His word by the counsel of His Spirit. Then when the Lord reveals His desires to our heart, we put that &ldquo;vision&rdquo; into action for the glory of Christ. Unfortunately, many churches have replaced leaning on the Lord and His word for direction with leaning on their own understanding and egotistical desires. In some cases,&nbsp;modern churched \"cast\" visions of larger and larger buildings and bank accounts&nbsp;rather than visions of dividing to&nbsp;reach&nbsp;the world for Christ.&nbsp;\r\n\r\nAs you mentioned in your question, growth is an overriding preoccupation&nbsp;for many churches, while scripture emphasizes&nbsp;growing THE Church, not a specific church body. These goals may sound similar, but they are actually very different and usually opposed to one another. Growing THE church means to reach outward with the Gospel, teaching disciples to become disciple-makers, and sending them out to start the process somewhere else. This model doesn&rsquo;t grow a single church body necessarily, but it does grow THE Church!\r\n\r\nNevertheless, we caution you against judging any pastoral staff too quickly on this question. Allow&nbsp;time to get to know their hearts and intentions. Many men in pastoral ministry have been trained in seminaries to think of pastoring a church like building a business, and, unfortunately, they may have internalized this premise without questioning its biblical legitimacy. Show these men grace and attempt to guide them into a more biblical view of how the Lord calls His Church to grow.&nbsp;\r\n\r\nFinally, you may find the following resources helpful on this topic. Our article on the megachurch phenomenon and our study on Nehemiah explain these matters further."
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "anxiety",
        "topic": "anxiety"
      }, {
        "ID": "fear",
        "topic": "fear"
      }, {
        "ID": "devil",
        "topic": "devil"
      }, {
        "ID": "Demons",
        "topic": "Demons"
      }, {
        "ID": "Satan",
        "topic": "Satan"
      }],
      "ID": "1684",
      "postedDate": "1443489300",
      "title": "Christians dealing with panic attacks",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "I am a relatively new Christian, but I have been dealing with panic attacks for many years. I have been on medications to control the attacks, but recently they are coming back. I pray to the Lord and I know the Lord is in control, but I can&#39;t seem to stop the anxiety. What should a Christian do?\r\n\r\n\r\nThough VBVMI is&nbsp;not qualified to provide personal counseling services, we can offer some general biblical guidance for your situation.&nbsp;\r\n\r\nFirst, we believe your recent relationship with Christ is a key detail in&nbsp;your situation, because when a person enters into an abiding relationship with Christ (either as a new believer or a believer who has returned from a period of rebellion or neglect), they may experience&nbsp;attacks from the enemy. The demonic realm is&nbsp;under orders&nbsp;by Satan to inhibit the walk of believers, and anxiety is a key weapon:\r\n\r\n1Pet. 5:6&nbsp; Therefore humble yourselves under the mighty hand of God, that He may exalt you at the proper time,&nbsp;\r\n1Pet. 5:7&nbsp;casting all your anxiety on Him, because He cares for you.&nbsp;\r\n1Pet. 5:8&nbsp;Be of sober spirit, be on the alert. Your adversary, the devil, prowls around like a roaring lion, seeking someone to devour.&nbsp;\r\nNotice Peter reassures the believer that the Lord will exalt us only at the proper time, which means only when the Lord has determined He is ready to raise us above our circumstances. The Lord&rsquo;s timing is a matter of His purposes in growing us through trials so we may become more holy and pleasing to Him. Obviously, Peter is primarily referring to the Lord bringing us into glory in Heaven, but even now in our present circumstances the Lord calls upon believers to cast our anxieties upon the Lord.&nbsp;\r\n\r\nPeter is not saying we shouldn&rsquo;t&nbsp;feel&nbsp;anxiety for this would be impossible. All human begins feel anxiety to some extent. Peter is telling us not to act according to our anxiety, for when we do so we become vulnerable to the schemes of the enemy. Hebrews says that fear is a primary weapon of the enemy:\r\n\r\nHeb. 2:14&nbsp;Therefore, since the children share in flesh and blood, He Himself likewise also partook of the same, that through death He might render powerless him who had the power of death, that is, the devil,&nbsp;\r\nHeb. 2:15&nbsp;and might free those who through fear of death were subject to slavery all their lives.&nbsp;\r\nFear leads to a form of slavery to the devil, who brings to mind fears that are no longer true for the believer.&nbsp;Notice that Peter couples his instructions concerning anxiety with a call for the believer to be of sober spirit. Sober means not under the influence of something, and in this context Peter is speaking about the debilitating influence of anxiety, worry, fear and the like. When we allow such feelings to drive our behaviors, we become victims of the enemy, who preys on anxieties to arrest our progress in walking with the Lord. In that sense, he devours us.&nbsp;\r\n\r\nObviously, we know your situation is more severe, and we are not suggesting your can&nbsp;simply &ldquo;will&rdquo; your way out of your panic attacks. Still, we believe that as your&nbsp;Christian walk matures (by the washing of the word) you will become less enslaved by these fears.\r\n\r\nThe Lord Himself will strengthen you as you grow in the grace and knowledge of the Lord. In other words, devote yourself to becoming someone who knows the Lord&rsquo;s word and seeks to follow it, and leave the rest to Christ. You will undoubtedly continue to experience an attack from time to time, but we are convinced that you will see these things fade away as you obtain the mind of Christ by His word.\r\n\r\nFinally, we recommend you seek a godly, biblical counselor who can walk with you through this time. Hopefully,&nbsp;in time your doctor may limit or eliminate your medications, as these treatments may&nbsp;be worse than the disease. Nevertheless, seek proper medical advice before taking or ending any course of treatment.&nbsp;\r\n\r\n&nbsp;"
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "revelation",
        "topic": "revelation"
      }, {
        "ID": "dragon",
        "topic": "dragon"
      }],
      "ID": "1683",
      "postedDate": "1443488820",
      "title": "Who is standing on the seashore?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "In your Revelation study, you said the dragon (Satan)&nbsp;is standing on the sea shore in chapter 13 verse 1, but in my King James Bible, the same verse says \"I stood on the sand of the sea...\" Which is correct?\r\n\r\n\r\nIn Revelation 13, the verse in the original Greek does not offer&nbsp;a proper noun for the one doing the standing. Neither the words &ldquo;dragon&rdquo; nor &ldquo;I&rdquo; appear in the original Greek text, therefore&nbsp;the interpreters had to assume the subject of the sentence. Notice&nbsp;the subject of the immediately preceding&nbsp;verse in Revelation 12:17:\r\n\r\nRev. 12:17 &nbsp;So the dragon was enraged with the woman, and went off to make war with the rest of her children, who keep the commandments of God and hold to the testimony of Jesus.\r\n&nbsp;The subject of v.17 is the dragon, so the&nbsp;NASB translators&nbsp;assumed that John was still referring to the dragon standing by the sea in v.13:1. On the other hand, the King James Version assumed that the subject of 13:1 was the book&#39;s human author, the Apostle John. \r\n\r\nWe favor the NASB interpretation."
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "Healing",
        "topic": "Healing"
      }, {
        "ID": "Prayer",
        "topic": "Prayer"
      }, {
        "ID": "False+Teachers",
        "topic": "False Teachers"
      }],
      "ID": "1373",
      "postedDate": "1442247000",
      "title": "Faith healers for real?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "I&#39;m confused by what I&#39;ve seen at so-called healing services? People come forward, men pray over them, they fall to the ground and twist around in a trance, and then they claim to be healed. Is this the biblical way God brings healing?\r\n\r\n\r\nThroughout the centuries of the church, believers experiencing illness and injury have sought supernatural healing from the Lord.&nbsp;In the Bible, we see the Lord healing individuals in the Gospel, the Apostles healing people in the book of Acts, and the writers of the New Testament epistles speaking of healing in the church. Since healing is clearly a part of the Christian experience, does the Bible prescribe a certain manner for acquiring God&#39;s healing?\r\n\r\nThe only prescription given in scripture is found in James 5::\r\n\r\nJames 5:13&nbsp; Is anyone among you&nbsp;suffering?&nbsp;Then he must pray. Is anyone cheerful? He is to&nbsp;sing praises.&nbsp;\r\nJames 5:14&nbsp;Is anyone among you sick? Then he must call for&nbsp;the elders of the church and they are to pray over him,&nbsp;anointing him with oil in the name of the Lord;&nbsp;\r\nJames 5:15&nbsp;and the&nbsp;prayer&nbsp;offered in faith will&nbsp;restore the one who is sick, and the Lord will&nbsp;raise him up, and if he has committed sins,&nbsp;&nbsp;they will be forgiven him.&nbsp;\r\nJames 5:16&nbsp;Therefore,&nbsp;confess your sins to one another, and pray for one another so that you may be&nbsp;healed.&nbsp;The effective&nbsp;prayer of a righteous man can accomplish much.&nbsp;\r\n&nbsp;In chapter 5, James was teaching the necessity for believers&nbsp;to the seek the Lord for what we desire. In James&#39; day, the church was seeking for gain in the wrong ways, and earlier in this chapter&nbsp;James admonished the church for creating strife rather than seeking the Lord in prayer. So James&#39; purpose in chapter 5 is to correct the church&#39;s attitude and instruct it to go to the Lord for its needs.\r\n\r\nIn the case of suffering, James says we must pray for a solution. When a prayer is offered \"in faith,\" then that person can expect the Lord to restore the one who is sick. To pray \"in faith\" means to be led by the Holy Spirit into the prayer based in confidence that the Lord is preparing to accomplish the healing. In other words, praying in faith means praying with a supernatural understanding that the Lord has already determined to accomplish the healing.&nbsp;\r\n\r\nWhen we pray in faith, we do not create the outcome by means of our prayers. Rather, we&nbsp;are announcing the Lord&#39;s intentions before He acts, based on insight give to us by the Holy Spirit. This is the manner of prayer that leads to healing, James says. Apart from this instruction, the Bible gives no other recipe for healing.&nbsp;\r\n\r\nBeyond elders,&nbsp;the Lord may equip a member of the body with the gift to healing supernaturally.&nbsp;In 1Corinthians 12:28 Paul lists \"healing\" as one of the spiritual gifts available in the body, therefore we must acknowledge that healing is a spiritual gift available within the body. If someone has the gift to heal, then that person may be used by the Spirit to accomplish healing from time to time, however this does not mean the person has \"magic\" powers to heal on demand.&nbsp;\r\n\r\nThe gift of healing operates no differently than any other spiritual gift in that the believer remains 100% dependent on the will and power of the Holy Spirit. Just as a believer with a gift to teach can&#39;t know all things in scripture perfectly, neither can someone with the gift to heal succeed in healing 100% of the time. Every spiritual gift operates dependent upon the will of God, so that only if the Lord wills to heal will a&nbsp;healing take place.&nbsp;\r\n\r\nCertainly, the Lord is capable and often inclined to provide bodily healing, but there is no assurance in scripture that the Lord will&nbsp;always&nbsp;heal our bodies&nbsp;upon request. On the contrary, sooner or later our body must die and return to dust, unless we live until the resurrection day, but sooner or later our body will be replaced (thankfully!).&nbsp;Therefore, we cannot say that God always heals, otherwise no one would ever die!&nbsp;Instead, we must acknowledge that the Lord&nbsp;may&nbsp;heal us when He desires, but sooner or later He won&#39;t.\r\n\r\nUnfortunately, there are many false teachers and deceivers within the Church seeking to fleece the Lord&#39;s flock by teaching falsely that the Lord always heals us when we ask Him. Some of these evil men call themselves \"faith healers\" claiming to have the power to heal by means of the Spirit, but only for those who have \"faith.\" Usually, these conmen&nbsp;set up shop in charismatic environments, where fervour and emotion replace&nbsp;sound doctrine and good judgment, leading many needy believers to be fooled into expecting miraculous healing on demand.\r\n\r\nWe strongly advise believers to be wary of such displays. Instead, seek godly intercession with mature, devoted elders or other members of the body with a heart to serve God in quiet humility and chaste reverence. Never agree to donate money as a quid pro quo for healing, and be content with your circumstances should the Lord decline to heal your body. Remember, all believers must shed this old body one way or another so that we may inherit the new, eternal body we are promised.&nbsp;\r\n\r\nFor a more thorough treatment on this subject, we recommend you listen to our Sovereignty of God series (especially Lessons 3-4) and our teaching in 1Corinthians (Lessons 12A &ndash; 14D).."
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "Sin",
        "topic": "Sin"
      }, {
        "ID": "Faith",
        "topic": "Faith"
      }],
      "ID": "1329",
      "postedDate": "1440036300",
      "title": "What is the sin leading to death?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Could you explain what John means in 1John 5:16 about the \"sin leading to death?\"\r\n\r\n\r\nIn 1John 5 we read:\r\n\r\n1John 5:12 &nbsp; He who has the Son has the life; he who does not have the Son of God does not have the life.&nbsp;\r\n1John 5:13 &nbsp; These things I have written to you who&nbsp;&nbsp;believe in the name of the Son of God, so that you may know that you have&nbsp;&nbsp;eternal life.&nbsp;\r\n1John 5:14 &nbsp; This is&nbsp;&nbsp;the confidence which we have&nbsp;&nbsp;before Him, that,&nbsp;if we ask anything according to His will, He hears us.&nbsp;\r\n1John 5:15 &nbsp; And if we know that He hears us in whatever we ask,&nbsp;&nbsp;we know that we have the requests which we have asked from Him.&nbsp;\r\n1John 5:16 &nbsp; If anyone sees his brother&nbsp;committing a sin not leading to death,&nbsp;he shall ask and&nbsp;&nbsp;God will for him give life to those who commit sin not leading to death.&nbsp;There is a sin leading to death;&nbsp;&nbsp;I do not say that he should make request for this.&nbsp;\r\n1John 5:17 &nbsp; All unrighteousness is sin, and&nbsp;&nbsp;there is a sin not leading to death.&nbsp;\r\nAt the beginning of this passage, John defines what he means by \"death\" and\" life.\" Life is having the Son, that is to be a believing Christian. Conversely, not&nbsp;having life (i.e., death) is not having the Son, that is being an unbeliever. The Bible commonly uses the dichotomy of life and death to represent belief and&nbsp;unbelief. &nbsp;John repeats this association several times in this letter, including again in v.13 when he says that the church&#39;s belief in Christ has given them&nbsp;eternal life.\r\n\r\nThen he teaches that believers have the confidence to approach the Lord with our petitions, and the Lord will hear us. And if the Lord hears us, John says we&nbsp;know we \"have the requests which we have asked from Him.\" This is an awkward phrase in the English reflecting a difficult Greek meaning. John is saying&nbsp;that if the Lord hears our prayers, it shows that our requests are according to the Lord&#39;s desires.\r\n\r\nFurthermore, when we intercede for the needs of a brother or sister who is sinning, we can trust that the Lord&#39;s promise of eternal life for that sinning&nbsp;believer will not be broken on account of the person&#39;s sin. In other words, the believer&#39;s sin will be forgiven.&nbsp;\r\n\r\nOn the other hand, there is a sin that leads to eternal death, that is the sin of unbelief, and this sin cannot be forgiven through our intercession. We have no&nbsp;hope that the Lord will grant a petition for an unbeliever to be forgiven of their sin. The Lord cannot grant such a request.&nbsp;\r\n\r\nTherefore, concerning a person committing the sin&nbsp;of unbelief, John says the Christian ought not to&nbsp;pray&nbsp;for forgiveness since we know it cannot be granted. We would not be praying in the Lord&#39;s will in such a case. Instead, we should pray for the individual&nbsp;to believe so as to be saved and forgiven.&nbsp;\r\n\r\nFinally, John says that though all unrighteousness is sin, there is a difference between the sin of unbelief and all other sin committed by believers. One type of&nbsp;sin&nbsp;does not impede eternal life while the other type of sin (i.e., the sin of unbelief) does.&nbsp;"
    }, {
      "category": "cat1",
      "topics": [

      ],
      "ID": "471",
      "postedDate": "1439950020",
      "title": "Where did Cain find his wife?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q. Adam and Eve had Cain and Abel. Cain killed Abel and left Eden to live in the east. Where did he get his wife,&nbsp;since Adam and Eve were the first humans on the planet and with Cain and Abel were only&nbsp;four people in total?&nbsp;\r\n&nbsp;\r\n\r\nA. In Genesis 2, the Bible tells how God created man and later woman on the sixth day of creation. While they lived in the Garden of Eden, Adam and Woman were the only two human beings in the world. Nevertheless, God gave these two people the command to multiply and fill the earth in Gen 1:28.\r\n\r\nUnfortunately, Adam and Woman sinned before they could execute God&#39;s plan for reproduction. Nevertheless, the couple (now Adam and Eve) follow through on God&#39;s plan and build a family, starting with Cain and Abel.\r\n\r\nObviously, God&#39;s plan from the beginning was that these two people would conceive children and these children would, in turn, have their own children until the earth was filled with nations of people. God&#39;s instruction to Adam and Woman begs an obvious question: how did God expect one couple to fill the earth? To this question, the Bible offers an equally obvious (if troubling) answer: God intended Adam&#39;s children to marry one another and bear children.\r\n\r\nAs we consider this answer, let&#39;s review some points of scripture.\r\n\r\nFirst, Adam&#39;s family included more people than simply Eve, Cain and Abel. Gen 5:4 tells us that Adam had many sons and daughters. The first son born was Cain, and soon thereafter came Abel, but that doesn&#39;t mean other siblings weren&#39;t already living at the time Cain killed Abel.\r\n\r\nOn the contrary, Gen 4:14 indicates that there were other members of Adam&#39;s family already living as adults at the time that Cain killed Abel. Cain expressed concern when he learned from God that he must wander the world as his punishment for killing Abel, because he said he feared that others (i.e., other members of his family) would find him and take revenge against him (v.14).\r\n\r\nSecondly, though the Bible only mentions four people by name at the point of Genesis 4, the full genealogy of Adam is provided in Chapter 5. The fact that Chapter 5 follows Chapter 4 sequentially in the Bible doesn&#39;t mean that many of the people listed in Genesis 5 weren&#39;t already alive&nbsp;during the events of Chapter 4. The genealogy chapters of Genesis, including Chapter 5, span long periods of time, including events described in other chapters of Genesis before or after their order in Scripture.\r\n\r\nTherefore, we know from scripture that in the early years after the fall, Adam and Eve raised a family of many children who grew to adulthood and joined together in marriage relationships to establish the next generation. By the time Cain killed Abel, there were numerous siblings living with extended families. Later, Cain married one of his sisters (4:17) as did the rest of his siblings (5:1-5).\r\n\r\nNo answer to this question would be complete, however, unless we address the natural concern we have in hearing that God expected brothers to marry sisters.\r\n\r\nFirst, we must understand that it&#39;s clear from the circumstances described in Genesis that God intended for Adam&#39;s siblings to marry and reproduce. In fact, Adam and Woman were themselves blood relatives (Gen 2:21-22), so even the first marriage united two people who shared the same DNA. Even as late as Abraham and Isaac, the custom of marrying within one&#39;s family was still an acceptable practice (Gen 24:4).\r\n\r\nLater in the Law, God specifically outlawed sexual union between blood relatives (Leviticus 18). Likewise, today it is illegal in most (if not all) cultures for siblings to marry and produce children. Such unions are considered dangerous, since the children are at much higher risk of suffering from genetic diseases, and most incest laws are justified on the basis of this health concern.\r\n\r\nSo, why would God consider marriage between siblings to be acceptable in Adam&#39;s day but later outlaw such relationships? The answer is found in the curse placed on the Earth because of Adam&#39;s sin.\r\n\r\nGod&#39;s instructions to Adam and Woman were given while both lived in the Garden and before they had fallen into a state of sin. At that time, Adam existed as he had been created: he was perfect. His body contained no defects. In this perfect state, there would be no stigma nor health concerns over sibling marriages since every human would reproduce in perfection. It was simply the natural course established by God.\r\n\r\nAt the point of the Fall, however, God altered the state of His creation. In response to Adam&#39;s sin, God pronounced a curse on the Earth and all that came from the Earth (Gen 3:17-19). This curse directed that everything on Earth that had life would, by necessity, die a physical death and return to dust.\r\n\r\nThe death of living things was to take place through a process of decay: a slow, steady deterioration of God&#39;s perfect design culminating in the whole Earth and everything in it \"wearing\" out and ultimately being replaced (Isaiah 51:6; Psalms 102:25-26; Heb 1:10-12). Our bodies will be replaced at the resurrection and the world itself is replaced with the coming of the new Heavens and Earth.\r\n\r\nThe effects of this curse have become evident in stages. Early generations of men showed little evidence of the curse in the fact that they continued to live very long natural lives, probably because the genetic defects that God ordained to produce the disease and physical frailty leading to death were far less prevalent in those early generations. Nevertheless, Adam&#39;s descendants all died eventually as the curse required (Rom 5:14), and over time the defects in human DNA multiplied generation over generation, until disease and other physical frailties caused a decreasing lifespan.\r\n\r\nBy the time Israel left Egypt during the Exodus, the population of men and women in Israel was plentiful, eliminating the necessity for brothers to marry sisters. Furthermore, genetic defects in the population had accumulated to the point that the health risks of marrying family members were too great to permit the practice any longer. So, God outlawed it.&nbsp;"
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "Resurrection",
        "topic": "Resurrection"
      }, {
        "ID": "Judgment",
        "topic": "Judgment"
      }, {
        "ID": "Propitiation",
        "topic": "Propitiation"
      }, {
        "ID": "Hell",
        "topic": "Hell"
      }, {
        "ID": "Propitiation",
        "topic": "Propitiation"
      }, {
        "ID": "Hell",
        "topic": "Hell"
      }, {
        "ID": "Sacrifice",
        "topic": "Sacrifice"
      }, {
        "ID": "sheol",
        "topic": "sheol"
      }],
      "ID": "660",
      "postedDate": "1439863680",
      "title": "Why didn&#8217;t Jesus have to stay in Hell longer?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q. I know God accepted Jesus&#39;s sacrifice as a propitiation for our sins,&nbsp;but the part that stumps me is that Jesus only had to die physically. He didn&#39;t experience eternal separation from God as I would. Jesus only&nbsp;went to Hell for 3 days, so who is serving my \"life sentence\" in Hell if Jesus is now sitting at the right hand of the Father?\r\n&nbsp;\r\n\r\nA. Jesus&#39; time in the grave was not a payment&nbsp;for our sin or the reason we avoid eternity in Hell. As the question&nbsp;points out, Jesus was dead for only three days, yet God&#39;s word decrees an eternal death (i.e., separation from God)&nbsp;for any who reject&nbsp;Christ and die&nbsp;in sin. In reality, Jesus&#39; time spent in&nbsp;the grave served an entirely different purpose in God&#39;s plan.&nbsp;\r\n\r\nFirst, the wording of the question&nbsp;assumes that \"spending eternity in hell\" is similar to serving time in prison for a crime. Such a comparison falls short of explaining why the unjust are sent to the Lake of Fire. To know Hell&#39;s true purpose, we must begin by&nbsp;understanding&nbsp;what Jesus&#39; death accomplished on our behalf.\r\n\r\nWhen Adam was instructed not to eat of the fruit of the Tree of Knowledge of Good and Evil, God promised that if he disobeyed, Adam would die. Later in Revelation 20:14 we learn that the death God was speaking about in Genesis&nbsp;is the \"second\" death, which is an eternity spent in the Lake of Fire. This is God&#39;s promised outcome for sin. It is not a period of restitution or \"paying off our debt.\" Rather, it is the future existence God decreed for any who disobey His word.\r\n\r\nSecondly, Scripture says that God&#39;s perfect character must display wrath against unholiness, and, therefore, our very sinful nature demands that we receive God&#39;s wrath. Men&nbsp;remain subject to His wrath for as long as they exist in sin, and those who die in their sins without placing their trust in Jesus Christ remain eternally sinful. Therefore, they remain eternally&nbsp;subject to God&#39;s wrath because the sin nature of the unbeliever follows them into the grave. They must live forever&nbsp;in Hell (and later the Lake of Fire) because there is no solution to their sin if they reject Christ.\r\n\r\nJesus Christ&nbsp;addressed both these issues on our behalf by His sinless life and sacrificial death&nbsp;on the cross. First, Jesus lived a perfect, sinless life. He had no sin of His own, scripture says. Since He lived a sinless life, Jesus did not warrant God&#39;s wrath nor did He deserve death.&nbsp;Therefore, His perfect life is available for God to credit to us by faith. When we believe in the God&#39;s word, we are given Christ&#39;s righteousness. Paul expresses it&nbsp;this way:\r\n\r\nPhil. 3:9 &nbsp; and may be found in Him, not having a righteousness of my own derived from the Law, but that which is through faith in Christ, the righteousness which comes from God on the basis of faith\r\n&nbsp;So, believers in Jesus Christ are made righteous by our faith. We have \"put on\" Christ, Paul says in Romans 13:14, meaning we are covered in His righteousness, which was given to us by the Father through faith in Christ. Therefore, we enter Heaven because we are righteous by faith.&nbsp;\r\n\r\nSecondly, Jesus&#39;s death on the cross gave an opportunity for God&#39;s wrath to be satisfied for sin.&nbsp;Though we deserved God&#39;s wrath for our sin, Jesus took God&#39;s wrath on our behalf. His death on the cross was the moment God&#39;s wrath for sin&nbsp;was poured out on Jesus, as He became&nbsp;our&nbsp;propitiation or payment. \r\n\r\n1John 2:2 &nbsp;and He Himself is the propitiation for our sins; and not for ours only, but also for those of the whole world.\r\n&nbsp;Take note that God&#39;s wrath for sin was satisfied in the death of Christ alone. God&#39;s did not require that Jesus spend time in Hell to satisfy His wrath because as we said earlier, the&nbsp;Second Death is not a \"payment\" to satisfy God&#39;s wrath. It is the&nbsp;dwelling place assigned to those who exist in sin eternally. Since Jesus had no sin of His own, He had no reason to live in Hell (or the Lake of Fire) forever.\r\n\r\nTherefore,&nbsp;believers avoid eternal death not because Jesus took our place in Hell;&nbsp;we escape that punishment&nbsp;because by our faith in Christ we become eligible to live in Heaven. Our entrance into Heaven requires both a payment for our sins&nbsp;and&nbsp;we being made righteousness. Christ accomplished both for us by His life and death.&nbsp;By Christ&#39;s sinless life,&nbsp;we have been credited with Christ&#39;s&nbsp;righteousness, and by Christ&#39;s death&nbsp;on the cross, God&#39;s wrath for our sin has been appeased.\r\n\r\nSo why did Jesus spend three days in the grave after He died?\r\n\r\nFirst, Jesus spent three days in the grave to prove He was the Messiah, risen from the dead in fulfillment of scripture:\r\n\r\nPsa. 16:9&nbsp; &nbsp; &nbsp; Therefore&nbsp; my heart is glad and my glory rejoices;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;My flesh also will dwell securely.&nbsp;\r\nPsa. 16:10 &nbsp; For You will not abandon my soul to Sheol;&nbsp;\r\n&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;Nor will You allow Your Holy One to undergo decay.\r\n&nbsp;Hos. 6:1&nbsp; &nbsp; &nbsp; &ldquo;Come, let us return to the LORD.\r\n&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;For He has torn us, but He will heal us;&nbsp;\r\n&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He has wounded us, but He will bandage us.&nbsp;\r\nHos. 6:2&nbsp; &nbsp;&nbsp; &nbsp;&ldquo;He will revive us after two days;&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;He will raise us up on the third day,&nbsp;\r\n&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;That we may live before Him.&nbsp;\r\n&nbsp;Matt. 12:38 &nbsp;Then some of the scribes and Pharisees said to Him, &ldquo;Teacher,&nbsp; we want to see a&nbsp; sign from You.&rdquo;&nbsp;\r\nMatt. 12:39 &nbsp;But He answered and said to them, &ldquo; An evil and adulterous generation craves for a&nbsp; sign; and yet no&nbsp; sign will be given to it but the&nbsp; sign of Jonah the prophet;\r\nMatt. 12:40 &nbsp;for just as&nbsp; JONAH WAS THREE DAYS AND THREE NIGHTS IN THE BELLY OF THE SEA MONSTER, so will&nbsp; the Son of Man be&nbsp; three days and three nights in the heart of the earth.\r\n&nbsp;Jesus remain dead for three days to fulfill scripture and to demonstrate He was the Messiah. The three-day period Jesus spent in the grave precluded anyone charging Jesus \"faked\" His death.&nbsp;Three days was enough time to establish beyond any doubt that Jesus was truly dead so that when He resurrected, everyone could know He kept His promise to abolish death.\r\n\r\nSecondly, Jesus used His time in the grave to preach to those in Sheol, the holding place of the dead prior to the resurrection. Sheol is two parts: Abraham&#39;s Bosom and Hades. You can read about these two places in Luke 16.\r\n\r\nPrior to Christ&#39;s death and resurrection,&nbsp;Old Testament saints (i.e.,&nbsp;believers ) who died were unable to enter Heaven.&nbsp;Though they were righteous by their faith even before Christ&#39;s death on the cross (e.g., Romans 4:9), until Jesus blood was spilled,&nbsp;God&#39;s&nbsp;wrath had not been satisfied. Therefore, the Lord made a place of comfort for OT saints to wait until the Lord&#39;s coming.\r\n\r\nAfter His death, Jesus descended into Sheol, to Abraham&#39;s Bosom, which is the side of Sheol reserved for the saints. It is not a place or torment. Jesus never experienced \"Hell\" or torment during the time He was in the grave. Instead,&nbsp;Peter says that Jesus used the three days in the grave to \"preach\" to the Old Testament saints and to the unbelievers held in the other side of Sheol, Hades, which is a prison for unbelivers as they await their judgment day:\r\n\r\n1Pet. 3:18 &nbsp;For Christ also died for sins&nbsp; once for all, the just for the unjust, so that He might&nbsp; bring us to God, having been put to death in the flesh, but made alive in the spirit;\r\n1Pet. 3:19 &nbsp;in which also He went and made proclamation to the spirits now in prison\r\n&nbsp;Jesus&#39; preaching served two purposes. First, Jesus introduced Himself to the those Whe He came to rescue. Remember, they were saved by their faith in God&#39;s promises, but they lacked a full understanding of Who the Messiah would be. They waited for the Lord to reveal the Messiah, and now as they waited with Jesus for the third day, they had a private audience with Jesus to understand how He fulfilled all prophecy.\r\n\r\nSecondly, Jesus preached against the unbelievers in Hades. His appearance was not intended to give a \"second\" opportunity to those in Hades, but rather Jesus spoke against them, confirming them in their sins and convicting them.\r\n\r\nAfter the three days were complete, Jesus ascended from Sheol, resurrected as the First Fruits of the resurrection,&nbsp;and then escorted&nbsp;the souls of those waiting for Him in Abraham&#39;s Bosom to Heaven. As Paul writes:\r\n\r\nEph. 4:8&nbsp; &nbsp;&nbsp; &nbsp;Therefore it says,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&ldquo;WHEN HE ASCENDED ON HIGH,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;HE LED CAPTIVE A HOST OF CAPTIVES,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;AND HE GAVE GIFTS TO MEN.&rdquo;&nbsp;\r\nEph. 4:9 &nbsp;(Now this expression,&nbsp;&ldquo;He ascended,&rdquo; what does it mean except that He also had descended into the lower parts of the earth?&nbsp;\r\n&nbsp;So in summary, the Bible teaches that Jesus&#39; sinless life becomes ours by faith, leading us to be declared righteous and able to enter Heaven. Jesus&#39; death satisfied God&#39;s wrath for our sin. Therefore, Jesus&#39; three days in the grave was not a part of His payment for our sin. Rather, He was in the grave&nbsp;three days for two reasons: to fulfill scripture concerning Himself in demonstrating&nbsp;He was truly dead, and to set free the OT saints awaiting Jesus&#39; death and resurrection.&nbsp;&nbsp;"
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "Fasting",
        "topic": "Fasting"
      }, {
        "ID": "fasts",
        "topic": "fasts"
      }, {
        "ID": "Flesh",
        "topic": "Flesh"
      }, {
        "ID": "Discipline",
        "topic": "Discipline"
      }, {
        "ID": "Prayer",
        "topic": "Prayer"
      }],
      "ID": "1404",
      "postedDate": "1439777340",
      "title": "Why do believers fast?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "What is fasting, and why do people fast in the Bible?\r\n\r\n\r\nTo fast simply means to abstain from something for a period of time. \r\n\r\nFasting in the Bible generally involve abstaining from all food and drink for a period of a few days or even a week or longer. Some fasts in the Bible lasted as long as 40 days (e.g., Jesus&rsquo; 40 days of fasting in the wilderness), though long fasts included drinking water, since the human body cannot live longer than a week without water.\r\n\r\nIt has become fashionable in recent decades for Christians to engage in lessor forms of fasting (i.e., juice fasts, single meal fasts, etc.), but these practices are not fasts in keeping with the model given in scripture. A scriptural fast involves a complete denial of the flesh (i.e., abstaining from all food and perhaps all drink), thereby triggering a&nbsp;struggle between the will and the flesh. It&rsquo;s in this struggle that we obtain the spiritual benefit of fasting.\r\n\r\nThe Bible commonly pairs fasting with praying as essential disciplines of the faith, and while most Christians understand the necessity and importance of prayer,&nbsp;fasting has fallen out of favor among many Christians today.&nbsp;Nevertheless, fasting remains a very important part of a healthy Christian walk, and when we practice fasting as intended, we gain a number of spiritual benefits. \r\n\r\nConsider these examples of fasting from scripture:&nbsp;\r\n\r\nNeh. 1:4&nbsp;&nbsp;When I heard these words,&nbsp;I sat down&nbsp;and&nbsp;wept&nbsp;and&nbsp;mourned for days;&nbsp;and&nbsp;I was&nbsp;fasting and praying&nbsp;before&nbsp;the God of&nbsp;heaven.&nbsp;\r\n&nbsp;Psa. 35:13&nbsp;&nbsp;But as for me,&nbsp;when they were sick, my&nbsp;clothing was sackcloth;&nbsp;\r\n&nbsp;&nbsp; &nbsp;I&nbsp;&nbsp;humbled my soul with&nbsp;fasting,&nbsp;\r\n&nbsp;&nbsp; &nbsp;And&nbsp;my&nbsp;prayer&nbsp;kept returning to my bosom.&nbsp;\r\nDan. 9:3&nbsp; So I&nbsp;gave my attention to the Lord God to seek Him&nbsp;by&nbsp;prayer and&nbsp;supplications, with&nbsp;fasting, sackcloth&nbsp;and&nbsp;ashes.&nbsp;\r\n&nbsp;Matt. 17:21&nbsp; [&ldquo;But this kind does not go out except by prayer and fasting.&rdquo;]\r\n&nbsp;Luke 2:37 and then as a widow to the age of eighty-four. She never left the temple, serving night and day with fastings and prayers.&nbsp;\r\n&nbsp;Luke 5:33&nbsp; And they said to Him, &ldquo;The disciples of John often fast and offer prayers, the disciples of the Pharisees also do the same, but Yours eat and drink.&rdquo;&nbsp;\r\nLuke 5:34&nbsp; And Jesus said to them, &ldquo;You cannot make the&nbsp; attendants of the bridegroom fast while the bridegroom is with them, can you?\r\nLuke 5:35 &ldquo;But the days will come; and when the bridegroom is taken away from them, then they will fast in those days.\r\n&nbsp;Acts 13:2 While they were ministering to the Lord and fasting, the Holy Spirit said, &ldquo;Set apart for Me Barnabas and Saul for the work to which I have called them.&rdquo;\r\nActs 13:3 Then, when they had fasted and&nbsp; prayed and laid their hands on them, they sent them away.&nbsp;\r\n&nbsp;There are numerous spiritual benefits associated with the practice of fasting, and each of the scriptures quoted above reflects one of those&nbsp;spiritual purposes.&nbsp;\r\n\r\nFirst, in Nehemiah 1:4 we see fasting associated with an appeal before the Lord, as Nehemiah was appealing for satisfaction from God over a distressing situation in Israel. Fasting is a denial of joy and satisfaction to the physical body, and&nbsp;Nehemiah denied himself&nbsp;to demonstrate to the Lord that&nbsp;he was determined to find no satisfaction apart from God&rsquo;s mercy in his situation.&nbsp;\r\n\r\nNehemiah wasn&rsquo;t attempting to earn God&rsquo;s favor through his self-denial; he was demonstrating his faith and reliance on the Lord.&nbsp;Just as Abraham acted out&nbsp;of faith to sacrifice his son,&nbsp;Isaac, believing in God&rsquo;s ability to resurrect, so was&nbsp;Nehemiah showing by his&nbsp;fasting that he trusted the Lord would relieve his anguish provided he sought relief nowhere else - not&nbsp;even relief from his hunger.\r\n\r\nSecondly, in Psalms 35, the psalmist says that he humbled his soul by fasting. Fasting is a means of humbling oneself before God because it cleverly exposes our battle with our flesh. During a period of fasting, we experience the&nbsp;flesh&rsquo;s power to control our will. Though we have declared an intention to abstain from food, nevertheless our body continually wars with our&nbsp;will trying to break our commitment to fast. \r\n\r\nThis battle with the flesh reveals how powerful the flesh can be, and through this experience we learn humility to resist the flesh&#39;s desires.&nbsp;As the battle intensifies during longer&nbsp;periods&nbsp;of fasting, we gain a deeper understanding&nbsp;for the strength of our flesh and the&nbsp;weakness of our will, and we become better at winning that battle. This is the fleshly struggle Paul&nbsp;describes in Romans 7.&nbsp;\r\n\r\nAs we learn how to win this battle over our flesh, we are&nbsp;humbling&nbsp;ourselves before the Lord. A&nbsp;humble heart pleases the Lord, as it demonstrates self-awareness of our sin and our unworthiness before the Lord. The Lord is pleased to bless those who demonstrate such humility, and we will naturally become more pleasing to God as we learn how to triumph over the desires of the flesh.&nbsp;\r\n\r\nThirdly in Daniel 9, Daniel says his attention was directed toward the Lord through a period of fasting. Fasting interrupts our normal routine in a dramatic fashion. When our body is denied the food it expects, our minds are continually reminded of the spiritual reason we are engaged in this ordeal, and in that way our thoughts return to the Lord. As our&nbsp;thoughts return to our relationship with the Lord and our need for His mercy, we enter into a moment of prayer and thus fasting has the effect of bringing us back to God in a regular way.\r\n\r\nFourthly in Matthew 17, the Lord tells the disciples that certain problems in life (e.g., casting out demons from a mute man), are only solvable through prayer and fasting.&nbsp;Notice Jesus says that the solution the disciples were seeking could only come in this way, which means the Lord will not grant relief under&nbsp;lesser circumstances.\r\n\r\nAs Jesus taught, the Lord has reserved for Himself the power to address certain challenges in life, and when we encounter such circumstances,&nbsp;we must be willing to&nbsp;acknowledge His authority and power before He will act on our behalf. Fasting and prayer are acts of faith that acknowledge&nbsp;God&#39;s sovereign control over our lives and circumstances.\r\n\r\nFifth,&nbsp;in Luke 2 we read about the widow who served God in the temple through many years of fasting and prayer in anticipation of the Lord&rsquo;s arrival. From this example, we learn that fasting is a form of spiritual service to God. Paul says:\r\n\r\nRom. 12:1&nbsp; Therefore&nbsp;I urge you, brethren, by the mercies of God, to&nbsp;present your bodies a living and holy sacrifice,&nbsp;acceptable to God, which is your&nbsp;&nbsp;spiritual service of worship.&nbsp;\r\n&nbsp;Just as the saints of the Old Testament presented sacrifices of animals before the Lord, so is the Christian to present sacrifices today. Our sacrifices take a very different form, however, for we are called to present our bodies&nbsp;sacrificially,&nbsp;Paul says. Fasting is a form of sacrifice to the Lord, where we voluntarily deny ourselves something of value (i.e., food) in thanks for&nbsp;the Lord&rsquo;s mercy, kindness and provision.&nbsp;\r\n\r\nFasting doesn&#39;t&nbsp;obtain or earn&nbsp;the Lord&rsquo;s kindness (i.e., it is not a quid pro quo). Rather,&nbsp;our fast is a thanks offering to&nbsp;the Lord through our bodies. We cannot give the Lord anything He doesn&rsquo;t already own, so our gifts of thanks to Him must take the form of personal sacrifice (i.e., a denial of self) rather than an enrichment of God. In&nbsp;this sense, fasting can be a simple yet powerful way to extend a blessing of thanks to the Lord through sacrifice.\r\n\r\nSixth, in Luke 5 the Pharisee criticized Jesus&rsquo; disciples for not fasting, when it was customary for students of all rabbis to fast regularly. Jesus answered the critic by saying so long as He remained on earth, His disciples had no reason to fast, but once He departed, then the&nbsp;disciples would fast regularly.\r\n\r\nIn this exchange, we find&nbsp;yet another spiritual purpose in fasting. Fasting serves as a reminder&nbsp;that our life lived on earth apart from Christ will be one of trials and persecution and even sorrow. While our lives also include moments of joy,&nbsp;we must await the Lord&#39;s return and His kingdom before we will know true, eternal joy.&nbsp;\r\n\r\nTherefore, the New Testament continually reminds the believer not to become content with the joy of&nbsp;this world, knowing the world and all it contains&nbsp;is destined to burn up. For example,&nbsp;we&rsquo;re told believers&nbsp;are not of the world (John 15:19), we are wanderers in a land that is not ours (Heb 11:13), and we should not store up our treasure on earth (Matt 6:19).\r\n\r\nNevertheless, our flesh enjoys the lusts of life, so we need regular reminders that the pleasures of this life are not to be confused with the joy that comes in Christ alone. Saints are called to fast regularly as a reminder and acknowledgement of the deprivation and wanting that accompanies our&nbsp;time of separation from Christ.&nbsp;In a future day, when we are in the Lord&rsquo;s presence, we will know true joy&nbsp;in the Kingdom, and then all fasting will cease.\r\n\r\nFinally, in Acts 13 we see the apostles fasting and praying before making an important decision to anoint two new leaders in the church. As we consider any course of action, our own selfish thoughts and desires will compete for our attention&nbsp;with the Lord&rsquo;s counsel through the Holy Spirit and His word. Our fleshly \"counselors\" operate out of fleshly desires, like pride, lust and greed, but the Lord&rsquo;s counsel comes from the Spirit. Our fleshly voices will always oppose the counsel of the Lord.&nbsp;\r\n\r\nTherefore, we must find ways to silence our fleshly voices&nbsp;so we can hear clearly from the Holy Spirit.&nbsp;Through a discipline of regular fasting, we become practiced at quieting the flesh&nbsp;and amplifying the Spirit&rsquo;s voice, leading to better understanding of the Lord&rsquo;s will in our life.\r\n\r\nIn summary, the Bible gives us numerous, compelling reasons to engage in regular fasting as part of healthy Christian discipline.&nbsp;\r\n&nbsp;"
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "Israel",
        "topic": "Israel"
      }, {
        "ID": "Sin",
        "topic": "Sin"
      }, {
        "ID": "Pharisees",
        "topic": "Pharisees"
      }, {
        "ID": "Demons",
        "topic": "Demons"
      }, {
        "ID": "blaspheming",
        "topic": "blaspheming"
      }, {
        "ID": "Second+Coming",
        "topic": "Second Coming"
      }, {
        "ID": "Tribulation",
        "topic": "Tribulation"
      }],
      "ID": "1395",
      "postedDate": "1439691420",
      "title": "What is the unforgivable sin?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "In Matthew 12, Jesus said that blaspheming the Holy Spirit was an unforgivable sin. What exactly is blaspheming the Holy Spirit and who can commit this sin? Also,&nbsp;Jesus says this sin will not be forgiven \"in&nbsp;this world or in the world to come.\" What did He mean?\r\n\r\n\r\nThe sin of blaspheming the Holy Spirit is a sin that could only be committed in the time of Jesus&rsquo; first coming. It is not a sin that a Christian can commit today. This sin has occurred only once in history, as recorded&nbsp;in Matthew 12:\r\n\r\nMatt. 12:22&nbsp;&nbsp;&nbsp;Then a&nbsp;demon-possessed man who was blind and mute was brought to&nbsp;&nbsp;Jesus, and He healed him, so that the mute man spoke and saw.&nbsp;\r\nMatt. 12:23&nbsp;&nbsp; All the crowds were amazed, and were saying, &ldquo;This man cannot be the&nbsp;&nbsp;Son of David, can he?&rdquo;&nbsp;\r\nMatt. 12:24&nbsp;&nbsp; But when the Pharisees heard this, they said, &ldquo;This man&nbsp;&nbsp;casts out demons only by&nbsp;&nbsp;Beelzebul the ruler of the demons.&rdquo;&nbsp;\r\nMatt. 12:25&nbsp;&nbsp;&nbsp;And&nbsp;&nbsp;knowing their thoughts Jesus said to them, &ldquo;Any kingdom divided against itself is laid waste; and&nbsp;&nbsp;any city or house divided against itself will not stand.\r\nMatt. 12:26&nbsp;&nbsp;&ldquo;If&nbsp;Satan casts out Satan, he&nbsp;&nbsp;is divided against himself; how then will his kingdom stand?\r\nMatt. 12:27&nbsp; &ldquo;If I&nbsp;by&nbsp;Beelzebul cast out demons,&nbsp;by whom do your sons cast them out? For this reason they will be your judges.\r\nMatt. 12:28&nbsp; &ldquo;But&nbsp;if I cast out demons by the Spirit of God, then the kingdom of God has come upon you.\r\nMatt. 12:29&nbsp; &ldquo;Or how can anyone enter the strong man&rsquo;s house and carry off his property, unless he first binds the strong man? And then he will plunder his house.\r\nMatt. 12:30&nbsp; &ldquo;He who is not with Me is against Me; and he who does not gather with Me scatters.\r\nMatt. 12:31&nbsp; &ldquo;Therefore I say to you, any sin and blasphemy shall be forgiven people, but blasphemy against the Spirit shall not be forgiven.\r\nMatt. 12:32&nbsp; &ldquo;Whoever&nbsp;speaks a word against the Son of Man, it shall be forgiven him; but whoever&nbsp;speaks against the Holy Spirit, it shall not be forgiven him, either in&nbsp;this age or in the age to come.&nbsp;\r\nIn this scene, Jesus performed an important miracle. He healed a mute man possessed by a demon. In Jewish tradition and teaching, the Messiah was said to be recognizable on the basis of three unique miracles only He could perform. The three \"Messianic miracles\" were healing&nbsp;a leper, healing a man born blind and casting out a demon&nbsp;from a mute man. In Matthew 12 we see Jesus performing the third&nbsp;of these three Messianic miracles.\r\n\r\nWhy is casting out a demon from a mute man considered proof of the Messiah? The answer comes from an understanding of how Jewish rabbis performed exorcisms in Jesus&#39; day.\r\n\r\nCasting out of demons (exorcisms) were commonly performed in Israel by rabbis and priests. (We can see evidence that exorcism was practiced in the first century in the story found in Acts 19 of the seven sons of the Jewish priest,&nbsp;Sceva.) \r\n\r\nThe Jewish manner of casting out demons could&nbsp;only be accomplished through a very specific ritual handed down&nbsp;by tradition (and presumably originating in divine revelation). Specifically, to cast out a demon, the priest&nbsp;had to call the demon out by name. So,&nbsp;in order to cast out a demon, the priest had to learn&nbsp;the demon&#39;s name.&nbsp;\r\n\r\nTo learn the name of the demon, the priest would inquire of the demon, and the demon would&nbsp;answer by speaking using the voice of the human body it inhabited. Once a priest knew the demon&rsquo;s name, he then could perform the exorcism by casting out the demon by name. Jesus followed this same procedure at times, as&nbsp;we see in another account in Luke:\r\n\r\nLuke 8:26 &nbsp;Then they sailed to the country of the Gerasenes, which is opposite Galilee.&nbsp;\r\nLuke 8:27 &nbsp;And when He came out onto the land, He was met by a man from the city who was possessed with demons; and who had not put on any clothing for a long time, and was not living in a house, but in the tombs.&nbsp;\r\nLuke 8:28 &nbsp;Seeing Jesus, he cried out and fell before Him, and said in a loud voice, &ldquo;What business do we have with each other, Jesus, Son of the Most High God? I beg You, do not torment me.&rdquo;&nbsp;\r\nLuke 8:29 &nbsp;For He had commanded the unclean spirit to come out of the man. For it had seized him many times; and he was bound with chains and shackles and kept under guard, and yet he would break his bonds and be driven by the demon into the desert.&nbsp;\r\nLuke 8:30 &nbsp;And Jesus asked him, &ldquo;What is your name?&rdquo; And he said, &ldquo;Legion&rdquo;; for many demons had entered him.&nbsp;\r\nLuke 8:31 &nbsp;They were imploring Him not to command them to go away into&nbsp;&nbsp;the abyss.&nbsp;\r\nJesus asked the name of the demon horde, and they responding with the name &ldquo;Legion.&rdquo; Jesus then proceeded in casting out the entire group. This was the only process of exorcism known to men in Israel, and the key to the process was learning the demon&rsquo;s name.\r\n\r\nTherefore, if a&nbsp;possessed person was&nbsp;mute (i.e., unable to speak),&nbsp;then an exorcism was impossible. Without the ability to learn the demon&rsquo;s name, a priest would be unable to perform the exorcism as prescribed. As a result of this limitation, a teaching&nbsp;arose among religious leaders in Israel that only the true Messiah could cast out a demon&nbsp;from a mute person.\r\n\r\nWe see this tradition reflected in another story of demon possession found in Mark&rsquo;s Gospel:\r\n\r\nMark 9:17 &nbsp;And one of the crowd answered Him, &ldquo;Teacher, I brought You my son, possessed with a spirit which makes him mute;&nbsp;\r\nMark 9:18 &nbsp;and&nbsp;&nbsp;whenever it seizes him, it&nbsp;&nbsp;slams him to the ground and he foams at the mouth, and grinds his teeth and&nbsp;&nbsp;stiffens out. I told Your disciples to cast it out,&nbsp;and they could not do it.&rdquo;&nbsp;\r\nMark 9:19 &nbsp;And He answered them and said, &ldquo;O unbelieving generation, how long shall I be with you? How long shall I put up with you? Bring him to Me!&rdquo;\r\nMark 9:20&nbsp;They brought the boy to Him. When he saw Him, immediately the spirit threw him into a convulsion, and falling to the ground, he began rolling around and foaming at the mouth.\r\nMark 9:21 &nbsp;And He asked his father, &ldquo;How long has this been happening to him?&rdquo; And he said, &ldquo;From childhood.&nbsp;\r\nMark 9:22 &nbsp;&ldquo;It has often thrown him both into the fire and into the water to destroy him. But if You can do anything, take pity on us and help us!&rdquo;&nbsp;\r\nMark 9:23 &nbsp;And Jesus said to him, &ldquo;&lsquo;If You can?&rsquo;&nbsp;All things are possible to him who believes.&rdquo;\r\nMark 9:24 &nbsp;Immediately the boy&rsquo;s father cried out and said, &ldquo;I do believe; help my unbelief.&rdquo;&nbsp;\r\nMark 9:25 &nbsp;When Jesus saw that a crowd was rapidly gathering, He rebuked the unclean spirit, saying to it, &ldquo;You deaf and mute spirit, I command you, come out of him and do not enter him again.&rdquo;\r\nMark 9:26 &nbsp;After crying out and throwing him into terrible convulsions, it came out; and the boy became so much like a corpse that most of them said, &ldquo;He is dead!&rdquo;&nbsp;\r\nMark 9:27 &nbsp;But Jesus took him by the hand and raised him; and he got up.&nbsp;\r\nMark 9:28 &nbsp;When He came into the house, His disciples began questioning Him privately, &ldquo;Why could we not drive it out?&rdquo;&nbsp;\r\nMark 9:29 &nbsp;And He said to them, &ldquo;This kind cannot come out by anything but prayer.&rdquo;\r\nJesus encountered&nbsp;a young boy possessed by a demon. As we read, the demon had rendered the boy mute, which is the&nbsp;key detail in this story. The boy&rsquo;s father is especially troubled, because he knows that no ordinary man&nbsp;could heal his son in his mute condition. Since no man can learn the name of the demon, there is no hope for an exorcism. As we see, the disciples attempted to cast out the demon, but failed because they could not obtain the demon&rsquo;s name.\r\n\r\nConsequently, the father brought his son to Jesus for healing, probably because the father knew&nbsp;Jesus was the Messiah, and therefore he expected that Jesus could&nbsp;overcome this barrier. When Jesus remarked, &ldquo;O unbelieving generation, how long shall I be with you?&rdquo; He was referring to His&nbsp;disciples, who had tried in vain to cast out the demon. If His disciples truly understood Jesus was the Messiah, they would have known to bring the boy to Him instead of tryhing perform&nbsp;a feat reserved only for the Messiah. Jesus was highlighting their continuing&nbsp;unbelief in His Messiahship.&nbsp;\r\n\r\nAfter&nbsp;Jesus finished healing the boy, His&nbsp;disciples questioned Him as to why He was able to perform this miracle yet&nbsp;they could not. Jesus answered&nbsp;by saying this &ldquo;kind&rdquo; of demon possession only comes out with prayer and fasting. In other words, only God can remove a demon from a mute body, which is why this miracle is a sign of the Messiah. Therefore, the disciples&rsquo; only recourse was to appeal to God through prayer and fasting for a deliverance.\r\n\r\nWith that background, we return&nbsp;to our passage in Matthew to&nbsp;find Jesus casting out another mute demon. After Jesus heals the man, the Jewish crowd correctly realizes&nbsp;they just witnessed one of the Messianic miracles.&nbsp;Notice in Matt 12:23 the crowd exclaims, \"This man cannot be the&nbsp;Son of David, can he?&rdquo; The term&nbsp;&ldquo;son of David&rdquo; is a Messianic term, so the crowd is asking themselves if it is true that Jesus is their long-awaited Messiah. By the tone of their question, we can see they doubted in their own conclusion, because Jesus did not fulfill their expectations for who would be&nbsp;the Messiah.&nbsp;\r\n\r\nSo the crowd waited for their&nbsp;religious leaders, the Pharisees, to rule on their question. Was Jesus truly the Messiah as the miracle indicated?&nbsp;Rather than acknowledging the obvious and declaring Jesus to be the Messiah, the hard-hearted Pharisees concocted&nbsp;an alternative answer to explain away Jesus&#39;&nbsp;extraordinary miracle. In v.24 they attribute His miracle to the power of Satan (Beelzebul). Their explanation was illogical and absurd, as Jesus&rsquo; rebuke points out in vs.25-30.\r\n\r\nNevertheless, the people in&nbsp;the crowd agreed&nbsp;with the Pharisees&#39; assessment. Rather than accepting Jesus as their Messiah, the crowd followed the lies&nbsp;of their religious leaders, choosing to believe&nbsp;Jesus was acting with&nbsp;the power of Satan. Their decision to attribute Jesus&#39; miraculous power to Satan instead of to the Holy Spirit is the sin of blaspheming the Holy Spirit.\r\n\r\nThe people of Israel&nbsp;witnessed the power of the Holy Spirit&nbsp;working to confirm Jesus as Messiah, and even though they correctly declared it to be a&nbsp;sign of the Messiah, they blasphemed the Holy Spirit by declaring the miracle was&nbsp;the work of Satan. In a sense, they were confessing that Satan was lord, rather than confessing Jesus as Lord.&nbsp;This is an unforgivable sin, according to Jesus.\r\n&nbsp;\r\n\r\nJust the sin of unbelief?\r\n&nbsp;A common (mis)interpretation of the unpardonable sin suggests that Jesus was speaking merely about the sin of unbelief (i.e.,&nbsp;dying without accepting&nbsp;Christ as Lord), but the context of Jesus&#39; words and the related scriptures&nbsp;leads us to reject this interpretation.&nbsp;\r\n\r\nFirst, Jesus called this special sin \"blaspheming the Holy Spirit,\" and He&nbsp;assigned it an unique penalty unlike any other&nbsp;sin:\r\n\r\nMatt. 12:31&nbsp; &ldquo;Therefore I say to you, any sin and blasphemy shall be forgiven people, but blasphemy against the Spirit shall not be forgiven.\r\nMatt. 12:32&nbsp;&ldquo;&nbsp;Whoever&nbsp;speaks a word against the Son of Man, it shall be forgiven him; but whoever&nbsp;speaks against the Holy Spirit, it shall not be forgiven him,&nbsp;either in&nbsp;this age or in the age to come.\r\nNotice Jesus says that speaking against Christ is forgivable, while blaspheming the Holy Spirit is not&nbsp;forgivable. Rejecting the Gospel is a rejection of Christ, yet Jesus specifically says this sin can be&nbsp;forgiven. On the other hand,&nbsp;blaspheming the Holy Spirit offers no&nbsp;possibility of forgiveness,&nbsp;&ldquo;...either in&nbsp;this age or in the age to come&rdquo; Jesus says. \r\n\r\nThe word age refers to our present time on earth, while the \"age to come\" refers to the eternal age. Jesus says that once the unforgivable sins occurs, there can be no forgiveness in&nbsp;this age. In other words, once this sin occurs, a person is precluded from forgiveness even while they still live in the present age.&nbsp;\r\n\r\nBased on this penalty, we know Jesus cannot be speaking about rejecting&nbsp;Christ. If someone rejects Christ&nbsp;today, that person can&nbsp;still receive forgiveness at a later point in this age&nbsp;should the person accept&nbsp;the Gospel on a future day. A person who rejects Christ a million times is still eligible for forgiveness &ldquo;in this age&rdquo; until they die.&nbsp;This fact explains why&nbsp;Jesus says speaking \"against the Son\" is forgivable in this age. Rejecting Christ&nbsp;can be forgiven in this age, so long as the person repents&nbsp;before the age is over (i.e., before death).\r\n\r\nOn the other hand, blaspheming the Holy Spirit offers no such second chance.&nbsp;Jesus says that when the unforgivable sin is committed, it shall not be forgiven in this age. When this sin is committed, it eliminates all&nbsp;future opportunity for forgiveness even while a person is still alive. There is no second chance for those who commit this particular sin.&nbsp;This unique penalty means Jesus was speaking&nbsp;about something very different than merely rejecting the Gospel.&nbsp;\r\n\r\nJesus was speaking about the unique circumstances Israel encountered when they rejected Christ face-to-face.&nbsp;Israel committed the unpardonable sin, and therefore that&nbsp;entire generation of Israel received a special judgment - a judgment that only that generation could experience. Their penalty was disqualification&nbsp;from receiving the Kingdom. Instead of receiving the Kingdom, that generation was excluded forever from God&#39;s forgiveness, leaving only a remnant of Israel to know Christ and receive the Kingdom. The rest of Israel was hardened, according to Paul:\r\n\r\nRom. 11:7 &nbsp;What then? What Israel is seeking, it has not obtained, but those who were chosen obtained it, and the rest were hardened;&nbsp;\r\nRom. 11:8&nbsp; just as it is written,\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&ldquo;GOD GAVE THEM A SPIRIT OF STUPOR,\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;EYES TO SEE NOT AND EARS TO HEAR NOT,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; DOWN TO THIS VERY DAY.&rdquo;&nbsp;\r\nRom. 11:9&nbsp; &nbsp;And David says,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&ldquo;LET THEIR TABLE BECOME A SNARE AND A TRAP,\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; AND A STUMBLING BLOCK AND A RETRIBUTION TO THEM.&nbsp;\r\nRom. 11:10 &nbsp;&ldquo;LET THEIR EYES BE DARKENED TO SEE NOT,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;AND BEND THEIR BACKS FOREVER.&rdquo;&nbsp;\r\n&nbsp;A few verses later in Matt 12, Jesus revealed this judgment upon this generation of Israel because they committed the unforgivable sin:\r\n\r\nMatt. 12:39 &nbsp;But He answered and said to them, &ldquo;An evil and adulterous generation craves for a sign; and yet no sign will be given to it but the sign of Jonah the prophet;\r\nMatt. 12:40 &nbsp;for just as JONAH WAS THREE DAYS AND THREE NIGHTS IN THE BELLY OF THE SEA MONSTER, so will the Son of Man be three days and three nights in the heart of the earth.\r\nMatt. 12:41&nbsp;&ldquo;The men of Nineveh will stand up with this generation at the judgment, and will condemn it because they repented at the preaching of Jonah; and behold,&nbsp;&nbsp;something greater than Jonah is here.\r\nMatt. 12:42 &nbsp;&ldquo;The Queen of the South will rise up with this generation at the judgment and will condemn it, because she came from the ends of the earth to hear the wisdom of Solomon; and behold, something greater than Solomon is here.\r\nThat generation of Israel was condemned for the remainder of their earthly lives and into&nbsp;eternity, Jesus declares. No second chances. No reprieve. Not in this age nor the next. And notice the reason Jesus gives for why&nbsp;this generation&#39;s&nbsp;unbelief was unforgivable when past generations of Israel were permitted to repent and&nbsp;did receive forgiveness for their unbelief:&nbsp;because this time &ldquo;something greater is here.&rdquo; \r\n\r\nIn other words, Jesus says that&nbsp;because&nbsp;this&nbsp;generation of Israel saw the Messiah in person, they could not be forgiven for rejecting Him. A person&nbsp;can be forgiven&nbsp;through repentance and faith&nbsp;for rejecting lessor&nbsp;messengers who declare the Gospel (i.e., the apostles, evangelists, prophets, etc.), but there is&nbsp;no second chance for a person who rejects Jesus to His face. By blaspheming the Holy Spirit in the physical presence of the Messiah, Israel&nbsp;committed a unique sin that could not be forgiven that generation.\r\n\r\nWe can see even more confirmation of this unique and pivotal moment in Israel&rsquo;s history by noticing how Jesus&rsquo; teaching changed immediately after Israel committed the unpardonable sin. Prior to the unpardonable sin (in Matt 1-12), Jesus&nbsp;never taught a single parable. Everything He taught was in the open for all to hear and understand.\r\n\r\nBut after Israel committed the unpardonable sin in Matt 12, Jesus changed His teaching style dramatically. From Matthew 13 until His death on the cross,&nbsp;Jesus only taught in parables. After the unpardonable sin, Jesus begins hiding the truth from Israel, because Israel is no longer permitted to understand it, because they cannot be forgiven.&nbsp;\r\n\r\nEven the disciples noticed Jesus&#39; abrupt change in style, so they ask Jesus in Matthew 13 why He has suddenly begun to teach in parables. Look at what Jesus says in response:\r\n\r\nMatt. 13:10&nbsp; And the disciples came and said to Him, &ldquo;Why do You speak to them in parables?&rdquo;&nbsp;\r\nMatt. 13:11&nbsp;&nbsp;Jesus answered them, &ldquo;To you it has been granted to know the mysteries of the kingdom of heaven, but to them it has not been granted.\r\nMatt. 13:12 &nbsp;&ldquo;For whoever has, to him more shall be given, and he will have an abundance; but whoever does not have, even what he has shall be taken away from him.\r\nMatt. 13:13 &nbsp;&ldquo;Therefore I speak to them in parables; because while seeing they do not see, and while hearing they do not hear, nor do they understand.\r\nMatt. 13:14 &nbsp;&ldquo;In their case the prophecy of Isaiah is being fulfilled, which says,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &lsquo;YOU WILL KEEP ON HEARING, BUT WILL NOT UNDERSTAND;&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;YOU WILL KEEP ON SEEING, BUT WILL NOT PERCEIVE;\r\nMatt. 13:15&nbsp;&nbsp;&nbsp;&nbsp;FOR THE HEART OF THIS PEOPLE HAS BECOME DULL,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;WITH THEIR EARS THEY SCARCELY HEAR,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;AND THEY HAVE CLOSED THEIR EYES,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;OTHERWISE THEY WOULD SEE WITH THEIR EYES,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; HEAR WITH THEIR EARS,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; AND UNDERSTAND WITH THEIR HEART AND RETURN,&nbsp;\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; AND I WOULD HEAL THEM.&rsquo;\r\nMatt. 13:16 &nbsp;&ldquo;But blessed are your eyes, because they see; and your ears, because they hear.\r\nJesus says that only a few in Israel (the remnant) would be permitted from this point forward to know the truth. Just as the OT prophets foretold, Israel would not be permitted to understand the truth of the Messiah as a judgment against them. Notice in Matt 13:15, Isaiah declared that God has closed Israel&#39;s eyes and ears&nbsp;so that they could not hear or understand. In other words, their sin would not be forgiven in this age.\r\n\r\nFinally, we see even more confirmation that Israel&rsquo;s sin was unforgivable in another passage:\r\n\r\nLuke 13:34&nbsp;&ldquo;O Jerusalem, Jerusalem, the city that kills the prophets and stones those sent to her! How often I wanted to gather your children together,&nbsp;&nbsp;just as a hen gathers her brood under her wings, and you would not have it!\r\nLuke 13:35&nbsp;&ldquo;Behold, your house is left to you desolate; and I say to you, you will not see Me until the time comes when you say, &lsquo;&nbsp;BLESSED IS HE WHO COMES IN THE NAME OF THE LORD!&rsquo;&rdquo;\r\nHere Jesus pronounce Israel&#39;s final judgment for unbelief. Notice Jesus says Israel&rsquo;s &ldquo;house&rdquo; is left to them desolate (from that point forward). This moment occurred only shortly after the events in Matt 12, so&nbsp;Jesus made this declaration long before He was crucified and long before the Romans destroyed the city.&nbsp;He pronounced&nbsp;Israel&#39;s judgment here&nbsp;in Luke 13 while there was yet still&nbsp;time for the nation to receive Him as Messiah.&nbsp;\r\n\r\nWhy did Jesus declare judgment upon&nbsp;Israel for unbelief at such an early point in His earthly ministry?&nbsp;Because Israel&#39;s die was cast once they committed&nbsp;the unforgivable sin. There could be no forgiveness \"in this age\" (as Jesus said)&nbsp;for the unforgivable sin, so from this point onward,&nbsp;this generation of Israel&nbsp;was under judgment.\r\n\r\nNotice also Jesus declares that Israel will not see their Messiah and the Kingdom &ldquo;until\" a future generation of Israel reverses the sin of this generation by declaring Jesus to be Lord. A future generation of Israel must reverse the sin of this generation by confessing that Jesus is Messiah, and when the nation follows suit, then (and only then) Jesus will return to set up the promised Kingdom. In other words, the Lord&rsquo;s Second Coming hinges on the entire nation of Israel declaring &ldquo;Blessed is He Who comes in the name of the Lord\" (i.e., declaring that Jesus is Messiah).&nbsp;\r\n\r\nIsrael will finally meet these terms on the last day of Tribulation (according to Zech 12-14), resulting in the return of Christ:\r\n\r\nZech. 12:9&nbsp;&ldquo;And in that day I will&nbsp;&nbsp;&nbsp;set about to destroy all the nations that come against Jerusalem.&nbsp;\r\nZech. 12:10&nbsp; &ldquo;I will&nbsp;&nbsp;pour out on the house of David and on the inhabitants of Jerusalem,&nbsp;the Spirit of grace and of supplication, so that they will look on Me whom they have&nbsp;&nbsp;pierced; and they will mourn for Him, as one&nbsp;&nbsp;mourns for an only son, and they will weep bitterly over Him like the bitter weeping over a firstborn.&nbsp;\r\nZech. 12:11&nbsp;&ldquo;In that day there will be great&nbsp;&nbsp;mourning in Jerusalem, like the mourning of Hadadrimmon in the&nbsp;plain of&nbsp;&nbsp;Megiddo.&nbsp;\r\nZech. 12:12&nbsp;&ldquo;The land will mourn, every family by itself; the family of the house of David by itself and their wives by themselves; the family of the house of Nathan by itself and their wives by themselves;&nbsp;\r\nZech. 12:13&nbsp;the family of the house of Levi by itself and their wives by themselves; the family of the Shimeites by itself and their wives by themselves;&nbsp;\r\nZech. 12:14&nbsp;all the families that remain, every family by itself and their wives by themselves.&nbsp;\r\nZech. 14:2&nbsp;For I will&nbsp;&nbsp;gather all the nations against Jerusalem to battle, and the city will be captured, the&nbsp;&nbsp;houses plundered, the women ravished and half of the city exiled, but the rest of the people will not be cut off from the city.&nbsp;\r\nZech. 14:3&nbsp;Then the LORD will go forth and&nbsp;&nbsp;fight against those nations, as&nbsp;&nbsp;when He fights on a day of battle.&nbsp;\r\nZech. 14:4&nbsp;In that day His feet will&nbsp;&nbsp;stand on the Mount of Olives, which is in front of Jerusalem on the east; and the Mount of Olives will be&nbsp;&nbsp;split in its middle from east to west by a very large valley, so that half of the mountain will move toward the north and the other half toward the south.&nbsp;\r\nWhen the Lord pours out His Spirit on Israel at the end of Tribulation, the nation will respond with a mass confession of faith in Christ. Once all Israel has made this declaration, then Christ will return to defeat the antichrist and set up the Kingdom for Israel (as He promised in Luke 13). \r\n\r\nSo the unpardonable sin is closely related to the Second Coming of Christ. It&rsquo;s no &ldquo;ordinary&rdquo; rejection of the Gospel. It is the very reason Jesus left the earth the first time!&nbsp;"
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "Headship",
        "topic": "Headship"
      }],
      "ID": "1047",
      "postedDate": "1439605080",
      "title": "Can a woman serve as a pastor?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q. Should we have a problem with woman pastors in the church? I understand that men have authority in the church, and I know there are no woman pastors mentioned in the Bible, but I don&#39;t see much difference between woman pastors and woman evangelists.&nbsp;\r\n&nbsp;\r\n\r\nA. First, some background on leadership in the church is important to answering this question, so we recommend you familiarize yourself with our article entitled \"Presbuteros, Episkopos, Diakonos\" explaining the differences between the various church leadership roles of elders, overseers, and deacons.\r\n\r\nHaving read our article, you should now understand that the Bible provides for two levels of leadership in the church: one focused on teaching and governing (called elders, bishops or overseers) and a second group focused on service (deacons). Deacons are always under the authority of the elders.\r\n\r\nThe qualifications for elders and deacons are given in 1Tim 3. Looking more closely at the passage from 1Tim 3, we find interesting distinctions between Paul&#39;s criteria for elders versus his criteria for deacons.\r\n\r\n1Tim. 3:1&nbsp; It is a trustworthy statement: if any man aspires to the office of overseer, it is a fine work he desires to do.\r\n1Tim. 3:2&nbsp; An overseer, then, must be above reproach,&nbsp; the husband of one wife,&nbsp; temperate, prudent, respectable,&nbsp; hospitable,&nbsp; able to teach,\r\n1Tim. 3:3&nbsp; not addicted to wine&nbsp; or pugnacious, but gentle, peaceable, free from the love of money.\r\n1Tim. 3:4 He must be one who&nbsp; manages his own household well, keeping his children under control with all dignity\r\n1Tim. 3:5 (but if a man does not know how to manage his own household, how will he take care of&nbsp; the church of God?),\r\n1Tim. 3:6 and not a new convert, so that he will not become&nbsp; conceited and fall into the&nbsp; condemnation&nbsp; incurred by the devil.\r\n1Tim. 3:7 And he must&nbsp; have a good reputation with&nbsp; those outside the church, so that he will not fall into reproach and&nbsp; the snare of the devil.\r\nFirst, elders are described as men exclusively. Notice Paul&#39;s consistent use of the male pronoun in describing elders, together with mentions of \"husband\" and managing a household, which was the exclusive role of men in Paul&#39;s day. Furthermore, Paul makes no mention of women whatsoever. Finally, Paul teaches elsewhere in the New Testament that women are not permitted to teach a man or hold authority over a man.\r\n\r\nTherefore, a woman may never serve as a leader over the church. Should a church elevate a woman into a role of elder or overseer, the church is in disobedience to the word of God.\r\n\r\nOn the other hand, Paul&#39;s criteria for deacons is markedly different:\r\n\r\n1Tim. 3:8&nbsp;&nbsp; Deacons likewise must be men of dignity, not double-tongued, or addicted to much wine or fond of sordid gain,\r\n1Tim. 3:9&nbsp; but holding to the mystery of the faith with a clear conscience.\r\n1Tim. 3:10&nbsp; These men must also first be tested; then let them serve as deacons if they are beyond reproach.\r\n1Tim. 3:11&nbsp; Women must likewise be dignified, not malicious gossips, but temperate, faithful in all things.\r\n1Tim. 3:12&nbsp; Deacons must be&nbsp; husbands of only one wife, and good managers of their children and their own households.\r\n1Tim. 3:13 For those who have served well as deacons&nbsp; obtain for themselves a high standing and great confidence in the faith that is in Christ Jesus.\r\nPaul&#39;s description of deacons begins with male pronouns and a specific reference to men (e.g., v.10), but then Paul switches to describing qualifications for women in v.11. Then in v.12, Paul returns to discussing the men. Paul&#39;s inclusion of women in this passage is clear evidence that Paul anticipated women serving as deacons in the church. Since deacons are under the authority of elders\/overseers (who are always men), then it makes sense Paul allowed female deacons. Woman deacons would still fall under male authority in the church.\r\n\r\nFurthermore, the Bible gives us evidence that women served as deacons (called deaconess) in the early church. For example, Paul mentions a deaconess in his letter to Rome:\r\n\r\nRom. 16:1&nbsp; I commend to you our sister Phoebe, who is a servant of the church which is at Cenchrea;\r\nRom. 16:2 &nbsp;that you receive her in the Lord in a manner worthy of the saints, and that you help her in whatever matter she may have need of you; for she herself has also been a helper of many, and of myself as well.\r\nThe Greek word for servant in v.1 is diakonos, which is the same word translated as deacon elsewhere in the New Testament.&nbsp; Furthermore, when Paul describes Phoebe as a helper of many, he uses a Greek verb often used in describing Paul himself as a leader and benefactor over the church. Taken together, the natural reading of Romans 16:1-2 proves that women served as deaconesses in the early church.\r\n\r\nWhat do these conclusions teach us about woman pastors? This is a more difficult question because technically speaking a pastor is not a position of leadership in the church. According to the Bible, a pastor is a type of spiritual service within the body. Just as some are gifted in prayer or teaching, some are gifted to pastor or shepherd God&#39;s people. We find the clearest mention of pastor in Paul&#39;s teaching in Ephesians:\r\n\r\nEph. 4:11 And He gave some as apostles, and some as prophets, and some as evangelists, and some as pastors and teachers,\r\nCuriously, this is the only mention in all the New Testament letters of the role of pastor (poimen in Greek), and Paul includes the term pastor in a list of spiritual gifts. Apostles, prophets and teachers are all roles requiring specific evidence of specific spiritual gifts, and these giftings (apart from the unique role of apostles) were not automatically considered positions of church authority because they could be found among women just as with men.&nbsp;\r\n\r\nSo, Paul&#39;s inclusion of the term pastor in a list of spiritual gifts strongly suggests he considered pastoring to be a spiritual gift rather than a position of authority (though unfortunately&nbsp;in the church today it is used as&nbsp;a defacto position of authority). Therefore, the question is can a woman use her spiritual gift of pastoring within the church&nbsp;without violating the Bible&#39;s restrictions on women leading men?\r\n\r\nWe believe the answer is yes, provided the woman pastor&nbsp;conforms to the Biblical role and not to the modern version of the same.\r\n\r\nWe have already established that church leadership is provided by elders&nbsp;and that elders must be men. Furthermore, leadership roles and spiritual gifts are independent of one another. A prophet can be an elder, an evangelist can be an elder, a teacher can be an elder, and a pastor can be an elder. On the other hand, not all teachers are elders, not all evangelists are elders, and therefore not all pastors are necessarily elders. With these constraints in mind, a woman can legitimately serve in the role pastor provided she doesn&#39;t&nbsp;assume a leadership or teaching&nbsp;position over men specifically.\r\n\r\nSince the Bible doesn&#39;t use the term \"pastor\" as a title of church leadership, women can serve as&nbsp;pastors in the sense of shepherds over a flock. The Spirit empowers both men and woman with the gift of pastoral ministry, so the church should encourage woman pastors to serve in their gift by shepherding God&#39;s people in appropriate ways. In this way, woman pastors provide valuable service to the body, particularly as shepherds over women&#39;s groups, children&#39;s ministries and outreach\/evangelistic ministries.\r\n\r\nNevertheless,&nbsp;a woman pastor must serve under male headship. A woman pastor cannot serve as an overseer or elder in the church, though she could serve as a deaconess under the authority of male elders. Furthermore, while a woman pastor may refer to herself as a \"pastor\" (in the same way that a woman may call herself a \"teacher\" or \"evangelist\"), a women should be careful not to use that title to imply she has authority over men.\r\n\r\nFinally, a woman pastor (or teacher) cannot exercise teaching or shepherding authority over a man or mixed-gender groups. She must limit her pastoral duties to shepherding women&#39;s groups and children unless she is pastoring as a team with her husband.\r\n\r\nIf you are interested in reading more about a woman&#39;s role in the church, we invite you to read the following articles."
    }, {
      "category": "cat1",
      "topics": [{
        "ID": "yoga",
        "topic": "yoga"
      }, {
        "ID": "Satan",
        "topic": "Satan"
      }, {
        "ID": "Demons",
        "topic": "Demons"
      }, {
        "ID": "mysticism",
        "topic": "mysticism"
      }],
      "ID": "1654",
      "postedDate": "1439255160",
      "title": "Is yoga OK for Christians?",
      "authorThumbnailSource": "",
      "authorThumbnailAltText": "VBVM Staff",
      "averageRating": "",
      "authorName": "VBVM Staff",
      "description": "",
      "qAndAThumbnailSource": "",
      "qAndAThumbnailAltText": "",
      "body": "Q: Is it acceptable for Christians to participate in yoga?\r\n\r\n\r\nA: Popular in&nbsp;Eastern culture for centuries, yoga has recently become a popular activity for many Westerners as well, including some professing Christians. A popular yoga website explains yoga this way:\r\n\r\nYoga means \"joined together.\" &nbsp;The word comes from the ancient Sanskrit root word yug, which means \"to unify.\" A yogi is one who consciously unifies body, mind, emotions, and spirit so that they work together very well.&nbsp; The yogi strives to open the gift of life and discover his fullest possibilities. A yogi endeavors to discover the higher consciousness and how the body, mind, and emotional nature can be truly fulfilled through unifying their purposes &mdash; rather than living in constant interior civil war.\r\nBased on this description, yoga is an activity mixing&nbsp;physical exercise and Eastern mysticism, and therefore traditional yoga&nbsp;should be avoided by Christians. The stated goal of traditional yoga is two-fold. First, yoga seeks to \"unify\"&nbsp;body,&nbsp;mind, emotions and spirit and end the \"civil war\" inside us. Biblically, we know that the human experience can only be unified in perfection and peace through faith in Jesus Christ and the regeneration that comes as a result of His grace.\r\n\r\nNo other means for unifying&nbsp;spirit and body exists, therefore the essential teaching of yoga qualifies as \"another Gospel,\" which competes with the Gospel of Jesus Christ for the hearts and mind of humanity. It is a lie of Satan intended as a stumbling block to prevent the world from knowing the truth.\r\n\r\nAs&nbsp;Paul said, if anyone comes to us preaching another Gospel, we are to reject both the messenger and the&nbsp;message&nbsp;entirely:\r\n\r\nGal. 1:8 But even if we, or an angel from heaven, should preach to you a gospel contrary to what we have preached to you, he is to be accursed!&nbsp;\r\nGal. 1:9 As we have said before, so I say again now, if any man is preaching to you a gospel contrary to what you received, he is to be accursed!&nbsp;\r\n&nbsp;Secondly, yoga claims to promote \"higher states of consciousness,\" which is coded language for seeking an encounter&nbsp;with the demonic realm. The Bible plainly&nbsp;commands&nbsp;believers to steer clear of worship of angels (demons) and to rely entirely on Christ for our spiritual enlightenment:\r\n\r\nCol. 2:18 Let no one keep defrauding you of your prize by delighting in self-abasement and the worship of the angels, taking his stand on visions he has seen, inflated without cause by his fleshly mind,&nbsp;\r\nCol. 2:19 and not holding fast to the head, from whom the entire body, being supplied and held together by the joints and ligaments, grows with a growth which is from God.&nbsp;\r\nFurthermore, associating with the enemy even in a casual way is a dangerous and foolish practice:\r\n\r\n2Cor. 6:15 Or what harmony has Christ with Belial, or what has a believer in common with an unbeliever?&nbsp;\r\n2Cor. 6:16 Or what agreement has the temple of God with idols? For we are the temple of the living God; just as God said,&nbsp;\r\n&nbsp;&nbsp; &nbsp;&ldquo;I WILL DWELL IN THEM AND WALK AMONG THEM;&nbsp;\r\n&nbsp;&nbsp; &nbsp;AND I WILL BE THEIR GOD, AND THEY SHALL BE MY PEOPLE.&nbsp;\r\n2Cor. 6:17 &ldquo;Therefore, COME OUT FROM THEIR MIDST AND BE SEPARATE,&rdquo; says the Lord.&nbsp;\r\n&nbsp;&nbsp; &nbsp;&ldquo;AND DO NOT TOUCH WHAT IS UNCLEAN;&nbsp;\r\n&nbsp;&nbsp; &nbsp;And I will welcome you.&nbsp;\r\n2Cor. 6:18 &ldquo;And I will be a father to you,&nbsp;\r\n&nbsp;&nbsp; &nbsp;And you shall be sons and daughters to Me,&rdquo;&nbsp;\r\n&nbsp;&nbsp; &nbsp;Says the Lord Almighty.&nbsp;\r\n&nbsp;Regardingless of any potential physical benefits of yoga, if the practice includes these mind techniques,&nbsp;it violates scripture and will lead the believer into unprofitable and potentially dangerous practices. The demonic realm is powerful and not something with which believers should experiment.\r\n\r\nIn some cases you may find a yoga instructor who has dispensed with yoga&#39;s Eastern mysticism&nbsp;and teaches only the stretching and strengthening routines associated with yoga. Such classes may still be called \"yoga\" to indicate the style of exercise being offered, yet the class has little in common with&nbsp;traditional yoga. Specifically, exercise-only yoga events will have&nbsp;no calls to meditation, no appeals to higher consciousness and no talk of uniting body and mind.&nbsp;\r\n\r\nUnder these circumstances, such yoga groups&nbsp;are simply exercise classes, and therefore they are acceptable for believers to enjoy. Nevertheless, believers participating in this type of \"innocent\" yoga should remain on guard for any unexpected shift into mysticism by the instructors. If the class begins to&nbsp;move away from simply exercise and into&nbsp;a spiritual dimension, the believer should cease participating.&nbsp;"
    }]
  }
}
